{
    "fetch_date": "2025-03-25",
    "articles": [
        {
            "title": "Why the internet still needs Section 230",
            "content": "Why the internet still needs Section 230\r\nThe laws 26 words were written to address the same challenges we face today.\r\nWhy the internet still needs Section 230\r\nThe laws 26 words were written to add… [+10683 chars]",
            "url": "https://www.theverge.com/policy/626326/ron-wyden-section-230-history-it-takes-chutzpah-excerpt"
        },
        {
            "title": "How Trump's threats have brought Canada's Liberals back from the dead",
            "content": "Nadine Yousif\r\nWatch: 'It's frustrating' - How Trumps tariffs are being received in Canada\r\nIf you had asked Canadians a few months ago who would win the country's next general election, most would h… [+7202 chars]",
            "url": "https://www.bbc.com/news/articles/cd7eyz3yn5do"
        },
        {
            "title": "'They're playing politics with my little boy': Parents on US Department of Education cuts",
            "content": "The Department of Education headquarters in Washington, DC\r\nWhen Rebecca, a 48-year-old mother from Michigan, needed help for her disabled son, she turned to the US Department of Education's Office o… [+8090 chars]",
            "url": "https://www.bbc.com/news/articles/cgl039j87x0o"
        },
        {
            "title": "The politics behind universal basic income",
            "content": "A universal basic income provides recurring cash payments with no strings attached.Wong Yu Liang\r\n<ul><li>Universal basic income was once thought politically impossible. Then came Andrew Yang and COV… [+6552 chars]",
            "url": "https://www.businessinsider.com/universal-basic-income-politics"
        },
        {
            "title": "The fake promise of better Siri",
            "content": "On The Vergecast: AI gadget failures, how Tesla became politics, and Sonoss TV dreams.\r\nOn The Vergecast: AI gadget failures, how Tesla became politics, and Sonoss TV dreams.\r\nApple Intelligence is t… [+2130 chars]",
            "url": "https://www.theverge.com/the-vergecast/629652/siri-delay-bad-apple-tesla-trump-vergecast"
        },
        {
            "title": "Who's in, who's out and who is Billboard's Woman of the Year? Find out in the quiz",
            "content": "This week marked the fifth birthday of the COVID pandemic, which absolutely no one wanted to celebrate with a Publix sheet cake and a party at an indoor trampoline park. You'll have to wait until nex… [+230 chars]",
            "url": "https://www.npr.org/2025/03/14/g-s1-53261/trump-tariff-musk-tesla-southwest-fashion-canada-tubman"
        },
        {
            "title": "NASA astronaut Butch Wilmore says politics aren't why he and his crewmate are still in space nearly 9 months longer than planned",
            "content": "NASA astronauts Butch Wilmore and Suni Williams have been in space since June 2024.NASA\r\n<ul><li>NASA astronauts Butch Wilmore and Suni Williams held a press conference last week.</li><li>Wilmore sai… [+3876 chars]",
            "url": "https://www.businessinsider.com/nasa-astronaut-butch-wilmore-politics-not-affecting-return-earth-2025-3"
        },
        {
            "title": "Michelle Obama has no interest in running for president — here's why",
            "content": "Michelle Obama has no interest in running for president.Anadolu/Anadolu via Getty Images\r\n<ul><li>Former first lady Michelle Obama is doubling down on her decision to not run for president.</li><li>S… [+2671 chars]",
            "url": "https://www.businessinsider.com/michelle-obama-no-interest-running-for-president-kids-mother-2025-3"
        },
        {
            "title": "Elon Musk is paying voters again ahead of the Wisconsin Supreme Court election",
            "content": "Musk has already funneled $14 million into the consequential race, which would swing the balance of power in the states highest court.\r\nMusk has already funneled $14 million into the consequential ra… [+2854 chars]",
            "url": "https://www.theverge.com/news/633834/elon-musk-paying-voters-petition-wisconsin-supreme-court-race"
        },
        {
            "title": "I moved to Canada to avoid Trump's second term, but I can't escape US politics",
            "content": "Canada's healthcare system is a big attraction for many in the US.Bruce Yuanyue Bi/Getty Images\r\n<ul><li>Grace Hern, 36, moved to Canada in 2023 to pursue graduate school and escape US politics.</li>… [+5821 chars]",
            "url": "https://www.businessinsider.com/moved-to-canada-from-us-cant-escape-tariffs-american-politics-2025-3"
        },
        {
            "title": "We're getting rid of our Tesla — and Elon Musk's politics have nothing to do with it",
            "content": "Tesla Hong Kong\r\n<ul><li>I'm not a car person and could drive whatever, but my husband loves cars.</li><li>After doing tons of research, he decided we needed a Tesla Model Y.</li><li>Insuring it is v… [+4421 chars]",
            "url": "https://www.businessinsider.com/we-are-selling-our-tesla-model-y-2025-3"
        },
        {
            "title": "Actually, Sometimes Facts Don’t Matter",
            "content": "Everyone is entitled to his own opinion, but not his own facts. This saying has become one of the most overused phrases of the Trump era. It has a seductive appeal in a partisan era. Its reassuringyo… [+9215 chars]",
            "url": "https://time.com/7263845/facts-dont-matter-misinformation-essay/"
        },
        {
            "title": "Politics Has Come for Science",
            "content": "With every passing day, it is harder to remember that Elon Musk was not always a political firebrand. The old Musk advocated for his business interests and professed to care deeply about climate chan… [+8277 chars]",
            "url": "https://www.theatlantic.com/science/archive/2025/03/elon-musk-royal-society-science/682018/"
        },
        {
            "title": "The Oscars Mostly Avoided Explicit Politics—With One Major Exception",
            "content": "How political did the Oscars get? Not very. Whether because of a chill in the political air or a calculation that millionaires in couture are not the best messengers for cries of revolution, the winn… [+5066 chars]",
            "url": "https://slate.com/culture/2025/03/oscars-2025-no-other-land-conan-trump-speech-video.html"
        },
        {
            "title": "The Hottest Job in DC: Helping Foreign Allies Make Sense of Trump",
            "content": "Predictability is the most valuable currency of diplomacy. But it's been in decidedly short supply in Washington since Jan. 20, as the Trump administration meddles in foreign nations domestic politic… [+5960 chars]",
            "url": "https://time.com/7266892/trump-foreign-allies-diplomacy/"
        },
        {
            "title": "Elon Musk made more promises about Optimus and Cybercabs at Tesla’s surprise all-hands meeting",
            "content": "The Tesla CEO pleads with employees (and, indirectly, to investors) to hang onto their stocks.\r\nThe Tesla CEO pleads with employees (and, indirectly, to investors) to hang onto their stocks.\r\nAt a su… [+2089 chars]",
            "url": "https://www.theverge.com/news/633907/elon-musk-tesla-employee-meeting-stock-value-drop-cybercab-optimus"
        },
        {
            "title": "Trump’s confusing crusade against Big Tech",
            "content": "On The Vergecast: Siris still bad, Pebbles so back, Starlinks in the White House, and chaos at the FTC.\r\nOn The Vergecast: Siris still bad, Pebbles so back, Starlinks in the White House, and chaos at… [+1751 chars]",
            "url": "https://www.theverge.com/the-vergecast/633757/trump-big-tech-tiktok-ftc-siri-vergecast"
        },
        {
            "title": "The Place of Politics in Fiction",
            "content": "This is an edition of the Books Briefing, our editors’ weekly guide to the best in books. Sign up for it here.Novelists are an opinionated lot. They often say things, write essays, and sign petitions… [+6345 chars]",
            "url": "https://www.theatlantic.com/newsletters/archive/2025/03/books-briefing-place-politics-fiction/681966/"
        },
        {
            "title": "Carney talks tough on Trump threat - but can he reset relations?",
            "content": "John SudworthSenior North America correspondent\r\nWatch: Trump has put unjustified tariffs on Canada, says Mark Carney\r\nMark Carney's thumping victory in the race to succeed Justin Trudeau makes him n… [+5294 chars]",
            "url": "https://www.bbc.com/news/articles/c39v779xpdno"
        },
        {
            "title": "Hot New Thermodynamic Chips Could Trump Classical Computers",
            "content": "Guillaume Verdon stands before me with a new kind of computer chip in his handa piece of hardware he believes is so important to the future of humanity that hes asked me not to reveal our exact locat… [+3636 chars]",
            "url": "https://www.wired.com/story/thermodynamic-computing-ai-guillaume-verdon-based-beff-jezos/"
        },
        {
            "title": "Chris Mason: Starmer is helping to shape talks but path to peace could be long",
            "content": "Russia, watching on, teased that this was an anti-Trump gathering, skilfully picking away at the vulnerability of a divided West.\r\nSir Keir and others were insistent it was nothing of the sort. The p… [+1466 chars]",
            "url": "https://www.bbc.com/news/articles/c39vxz87je9o"
        },
        {
            "title": "Rep. Al Green shouts Trump has 'no mandate' before being removed from House chamber",
            "content": "NPR is bringing you the latest from President Trump's address to a joint session of Congress. For more updates, get our NPR Politics newsletter or listen to The NPR Politics Podcast.\r\nTexas Democrati… [+1301 chars]",
            "url": "https://www.npr.org/2025/03/04/nx-s1-5318102/trump-joint-session-al-green-protest"
        },
        {
            "title": "Sen. Mark Kelly is looking into selling his Tesla over Elon Musk. Other big names have already pulled the trigger.",
            "content": "Sen. Mark Kelly might become the latest big name to get rid of his Tesla over Elon Musk's politics.\r\nThe Arizona Democrat told reporters on Tuesday that he's \"looking into\" selling his Tesla, though … [+424 chars]",
            "url": "https://www.businessinsider.com/celebrities-politicians-who-sold-tesla-over-elon-musk-trump"
        },
        {
            "title": "Vance sparks row with Ukraine peacekeeping remarks",
            "content": "Becky Morton\r\nThe US vice-president has sparked a row with comments he made about the potential involvement of international forces to police a peace deal in Ukraine.\r\nUK opposition politicians accus… [+4132 chars]",
            "url": "https://www.bbc.com/news/articles/czx7w7q7qzro"
        },
        {
            "title": "Kendall sets out 'pro-work' benefits changes",
            "content": "The work and pensions secretary has promised to tackle the \"perverse incentives\" driving people to depend on benefits, as she set out wide-ranging changes to the welfare system. \r\nLiz Kendall said th… [+2281 chars]",
            "url": "https://www.bbc.com/news/articles/c89y30nel59o"
        },
        {
            "title": "Democrat Angie Craig on How to Win Back Rural Midwestern Voters",
            "content": "This article is part of The D.C. Brief, TIMEs politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nIn a year when Democrats fared badly across rural areas and the industria… [+8858 chars]",
            "url": "https://time.com/7267198/democrat-angie-craig-interview/"
        },
        {
            "title": "“Paradise” Is Manna for the Moment",
            "content": "Paradise, on Hulu, is a political thriller with a vintage feel. Surely Hollywoods obsession with the Presidency has produced this kind of drama before? There is the handsome white Commander-in-Chief,… [+8269 chars]",
            "url": "https://www.newyorker.com/culture/critics-notebook/paradise-is-manna-for-the-moment"
        },
        {
            "title": "There's no emotion we ought to think harder about than anger",
            "content": "Theres no emotion we ought to think harder and more clearly about than anger. Anger greets most of us every day in our personal relationships, in the workplace, on the highway, on airline trips and, … [+12038 chars]",
            "url": "https://aeon.co/essays/there-s-no-emotion-we-ought-to-think-harder-about-than-anger"
        },
        {
            "title": "The A.I. Monarchy",
            "content": "",
            "url": "https://substack.com/home/post/p-156886169"
        },
        {
            "title": "Starmer praised for statesman role abroad but can he turn things round at home?",
            "content": "\"Trump may be the best thing to happen to Starmer,\" says a diplomat, suggesting the brash property tycoon busy upending the world order might be just what the strait-laced prime minister - who's been… [+9733 chars]",
            "url": "https://www.bbc.com/news/articles/cyvend06zmlo"
        },
        {
            "title": "MAGA’s Tesla Embrace Means EV Politics Will Never Be the Same Again",
            "content": "President Donald Trump, the same man who once said that people promoting electric vehicles should ROT IN HELL, bought his own EV this week. He showed off his new Tesla Model S red, like the Make Amer… [+7079 chars]",
            "url": "https://gizmodo.com/magas-tesla-embrace-means-ev-politics-will-never-be-the-same-again-2000576747"
        },
        {
            "title": "Canadian Officials Cancel $100 Million Starlink Contract, Propose 100% Tariffs on Teslas",
            "content": "President Donald Trump has unleashed economic warfare on two of America’s most closely aligned trading partners (and political allies): Mexico and Canada. On Tuesday, the Trump administration put int… [+2920 chars]",
            "url": "https://gizmodo.com/canadian-officials-cancel-100-million-starlink-contract-propose-100-tariffs-on-teslas-2000571699"
        },
        {
            "title": "Mark Cuban Shares the Dumbest Video Ever Uploaded to Bluesky",
            "content": "Mark Cuban is probably best known as that billionaire on Shark Tank. But did you also know he’s quickly becoming the worst poster on Bluesky? It’s true.\r\nCuban shared an AI-generated video on Friday … [+2912 chars]",
            "url": "https://gizmodo.com/mark-cuban-shares-the-dumbest-video-ever-uploaded-to-bluesky-2000576391"
        },
        {
            "title": "Why Rachel Reeves is feeling the heat ahead of her Spring Statement",
            "content": "In a discussion ahead of next week's statement, the Chancellor hints at a more guarded approach amid global uncertainty - and issues a warning\r\nA thick skin is a must for our top politicians. There's… [+11558 chars]",
            "url": "https://www.bbc.com/news/articles/c0egy79qx93o"
        },
        {
            "title": "Disability benefit cuts test loyalty of Labour MPs",
            "content": "Iain Watson &amp; Harry Farley\r\nThe prime minister's policy team has beenmeeting Labour MPs behind closed doorsin Downing Street ahead of significant cuts to the welfare budget.\r\nThese could be twice… [+6323 chars]",
            "url": "https://www.bbc.com/news/articles/c5y45g3935no"
        },
        {
            "title": "You are a media theorist",
            "content": "If you’ve ever caught a ball, you’re a physicist. You might not be trained in it, but your intuitive sense of where the ball is going to land requires having a theory about gravity.\r\nAnd if you’ve ev… [+1273 chars]",
            "url": "https://seths.blog/2025/03/you-are-a-media-theorist/"
        },
        {
            "title": "Protesters disrupt St. Patrick's event in Washington D.C.",
            "content": "A St Patrick's Day event involving the Taoiseach (Irish PM) has been disrupted by members of a high-profile evangelical Christian family from the Republic of Ireland.\r\nRelatives of Enoch Burke were f… [+2876 chars]",
            "url": "https://www.bbc.com/news/articles/cj0qnlpmmrro"
        },
        {
            "title": "PM pays tribute to British troops after Vance comments",
            "content": "Becky Morton\r\nSir Keir Starmer has paid tribute to British veterans who fought in Iraq, after US Vice-President JD Vance was accused of disrespecting UK troops. \r\nWithout directly referring to Vance'… [+3401 chars]",
            "url": "https://www.bbc.com/news/articles/cz9nkz928v9o"
        },
        {
            "title": "Chris Mason: Starmer's strategy for dealing with Team Trump outbursts",
            "content": "Week after week, there was a grim but poignant ritual at the start of Prime Minister's Question Time.\r\nThe prime minister would begin by acknowledging by name and by rank the British servicemen and w… [+2981 chars]",
            "url": "https://www.bbc.com/news/articles/c62z82z8qr4o"
        },
        {
            "title": "2 NASA astronauts head back to Earth after an unexpectedly long mission in space",
            "content": "Two NASA astronauts who've been on the International Space Station since last summer after their weeklong assignment turned into a nine-month saga are headed back to Earth on Tuesday.\r\nA SpaceX Drago… [+3559 chars]",
            "url": "https://www.npr.org/2025/03/18/nx-s1-5331907/nasa-astronauts-return-long-space-station-suni-williams-butch-wilmore"
        },
        {
            "title": "Supreme Court confronts another challenge to the Voting Rights Act",
            "content": "Race and politics were front and center at the U.S. Supreme Court on Monday as the justices took up a voting rights case involving Louisiana's congressional redistricting after the 2020 Census. The c… [+3757 chars]",
            "url": "https://www.npr.org/2025/03/24/nx-s1-5338773/supreme-court-louisiana-voting-rights-act"
        },
        {
            "title": "Another company is caught in the US-China fight, and investors are worried",
            "content": "The Panama Canal is a key shipping waterway.Reuters/ARIS MARTINEZ\r\n<ul><li>China criticized CK Hutchinson's sale of its Panama port stake, sending shares falling 6.7%.</li><li>The deal is seen as US … [+3351 chars]",
            "url": "https://www.businessinsider.com/panama-canal-blackrock-ck-hutchinson-deal-company-us-china-fight-2025-3"
        },
        {
            "title": "A bad movie full of big ideas about tech",
            "content": "Plus, in this weeks Installer: Netflix gets into late-night shows, a web app for podcasts, a cozy game youll love, and much more.\r\nPlus, in this weeks Installer: Netflix gets into late-night shows, a… [+11026 chars]",
            "url": "https://www.theverge.com/installer-newsletter/629893/electric-state-mickey-17-mulaney-netflix-installer"
        },
        {
            "title": "NASA's latest space launch: Stranded astronauts and messy politics",
            "content": "Later today, a SpaceX capsule is scheduled to carry four astronauts to the International Space Station. Their arrival will clear the way for two astronauts that have been labeled as \"stranded\" to fin… [+6160 chars]",
            "url": "https://www.npr.org/2025/03/12/nx-s1-5324653/trump-space-musk-astronauts-international-space-station-nasa"
        },
        {
            "title": "A new collection of Harper Lee's writing is coming later this year",
            "content": "Harper Lee, the acclaimed author who once professed her dream of being the \"Jane Austen of South Alabama\", was known for restraint when it came to sharing work.\r\nThroughout the course of Lee's 89 yea… [+1478 chars]",
            "url": "https://www.npr.org/2025/03/04/nx-s1-5317684/harper-lee-collection-new"
        },
        {
            "title": "Trump plans to visit the Justice Department Friday, a rare move for a president",
            "content": "President Trump is set to visit the Department of Justice Friday to make remarks on \"restoring law and order,\" his press secretary, Karoline Leavitt, said.\r\nTrump will also talk about \"ending the wea… [+1396 chars]",
            "url": "https://www.npr.org/2025/03/13/nx-s1-5327268/trump-doj-justice-department"
        },
        {
            "title": "What's the ideal age to reach a life milestone? Many Americans say it depends",
            "content": "What do you consider a life milestone?\r\nMaybe it's buying a home, starting a family or finally finishing that manuscript you've been working on.\r\nA new survey from the Pew Research Center released We… [+1629 chars]",
            "url": "https://www.npr.org/2025/03/21/g-s1-55154/life-milestone-pew-study-retirement-home-ownership-americans"
        },
        {
            "title": "Musk Plans to Give Trump Groups $100 Million After Tesla Ad at the White House",
            "content": "Elon Musk is planning to give $100 million to two political groups associated with President Donald Trump, according to a report from the New York Times. The move is unprecedented in American politic… [+5302 chars]",
            "url": "https://gizmodo.com/musk-plans-to-give-trump-groups-100-million-after-tesla-ad-at-the-white-house-2000575040"
        },
        {
            "title": "A Spanner, A Multitool, A Survival Gadget—The Titanium TiSpanner 3.0 Does It All",
            "content": "If it ain’t broken, don’t fix it. A phrase I believe applies perfectly to life, politics, culture, economics, and yes, even design. There’s this constant trend of wanting to do something new and some… [+5226 chars]",
            "url": "https://www.yankodesign.com/2025/03/05/a-spanner-a-multitool-a-survival-gadget-the-titanium-tispanner-3-0-does-it-all/"
        },
        {
            "title": "Donald Trump Is What Some Historians Call a ‘Transformative President’",
            "content": "After Donald Trumps first presidential victory, supporters and opponents alike argued that he was an aberrationa fluke winner who was a stark, but temporary, departure from long-standing political tr… [+9638 chars]",
            "url": "https://time.com/7260609/donald-trump-some-historians-call-transformative/"
        },
        {
            "title": "'From my standpoint, politics is not playing into this at all.' 'Stuck' NASA astronauts on ISS grilled on Earthly politics as long 9-month mission nears end",
            "content": "Butch Wilmore and Suni Williams are getting ready to wrap up their surprisingly long — and unexpectedly controversial — orbital stay.\r\nThe two NASA astronauts arrived at the International Space Stati… [+4476 chars]",
            "url": "https://www.space.com/space-exploration/human-spaceflight/from-my-standpoint-politics-is-not-playing-into-this-at-all-stuck-nasa-astronauts-on-iss-grilled-on-earthly-politics-as-long-9-month-mission-nears-end"
        },
        {
            "title": "The Case for Returning U.S. Public Lands to Indigenous People",
            "content": "The many hardworking civil servants whove lost their livelihoods to politics do apolitical things like clean bathrooms and maintain facilities in campgrounds, enforce regulations, fight fires, clear … [+772 chars]",
            "url": "https://time.com/7262838/us-public-lands-return-indigenous-people/"
        },
        {
            "title": "Censorship: These are the topics Gemini won’t talk about",
            "content": "Gemini is hands-down one of my favorite tools, but it doesnt always answer every question I ask it. Certain topics are completely off-limits, and that piqued my curiosity. I wanted to dig into which … [+6670 chars]",
            "url": "https://www.androidauthority.com/gemini-censorship-3533925/"
        },
        {
            "title": "Uber and Lyft drivers with Teslas don't want to talk about Elon Musk",
            "content": "Some Uber and Lyft drivers with Teslas don't want to talk with riders about Elon Musk but they'll play along because it's good for business.\r\nWesley Johnson said his passengers regularly mention Musk… [+3809 chars]",
            "url": "https://www.businessinsider.com/tesla-elon-musk-uber-lyft-drivers-avoid-talking-politics-passengers-2025-3"
        },
        {
            "title": "Trump’s Putin-Like Cull of the White House Press Pool",
            "content": "Listen and subscribe:Apple | Spotify | Google | Wherever You Listen\r\nSign upto receive our twice-weekly News &amp; Politics newsletter.\r\nThe Washington Roundtable discusses the Trump Administrations … [+283 chars]",
            "url": "https://www.newyorker.com/podcast/political-scene/trumps-putin-like-cull-of-the-white-house-press-pool"
        },
        {
            "title": "Switching to BunnyCDN in Less Than 2 Hours",
            "content": "Contents\r\nContents\r\nGiven some recent, uh, instability in US politics, and given that everyone likes an underdog, I’ve been looking at European alternatives to my current hosting situation, which is … [+12248 chars]",
            "url": "https://jonathan-frere.com/posts/switching-to-bunny-cdn/"
        },
        {
            "title": "Is Trump reining in Musk after a cabinet showdown with secretaries?",
            "content": "Anthony Zurcher\r\nTrump says cabinet will cut staff with Musk 'watching'\r\nUS President Donald Trump called a meeting of his cabinet secretaries on Thursday to discuss Elon Musk and his efforts to slas… [+4872 chars]",
            "url": "https://www.bbc.com/news/articles/cpwd1722yr2o"
        },
        {
            "title": "Trump says he is 'just getting started' in speech to US Congress",
            "content": "Anthony Zurcher\r\nSix weeks into his presidency, Donald Trump came to a US Capitol controlled by his Republican Party to take a lengthy victory lap.\r\n\"We have accomplished more in 43 days than most ad… [+5684 chars]",
            "url": "https://www.bbc.com/news/articles/ckgn3v0rdx2o"
        },
        {
            "title": "Trump's week of dealing means a fast pace with few concerns about risks",
            "content": "Anthony Zurcher\r\nIn his address to Congress last night, Donald Trump said the American people elected him to do a job \"and I am doing it\". The following day, the president again demonstrated what tha… [+4854 chars]",
            "url": "https://www.bbc.com/news/articles/cwyd5xn98yno"
        },
        {
            "title": "The Women Who Wanted to Leave Their Husbands Over Politics. “This fall,...",
            "content": "×Hello! In order to comment or fave, you need to be a current kottke.org member. If you'd like to sign up for a\r\n membership to support the site and join the conversation, you can explore your option… [+404 chars]",
            "url": "https://kottke.org/25/03/0046436-the-women-who-wanted-to"
        },
        {
            "title": "Andrew Cuomo Wanted To Be President. He’ll Settle For Mayor.",
            "content": "Andrew Cuomothe hard-headed former governor of New York state became something of a national hero in 2020 with his no-nonsense press conferences. By 2021, he was mired in a sexual misconduct scandal … [+610 chars]",
            "url": "https://slate.com/podcasts/what-next/2025/03/andrew-cuomo-mayor-new-york-city"
        },
        {
            "title": "European leaders pledge to back Ukraine. And, takeaways from the Oscars",
            "content": "Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\r\nToday's top st… [+4756 chars]",
            "url": "https://www.npr.org/2025/03/03/g-s1-51744/up-first-newsletter-ukraine-volodymyr-zelenskyy-russia-oscars"
        },
        {
            "title": "Australia won't retaliate against 'unjustified' U.S. tariffs, prime minister says",
            "content": "MELBOURNE, Australia Australian Prime Minister Anthony Albanese said Wednesday that U.S. tariffs on Australian steel and aluminum were unjustified, but his government would not retaliate with its own… [+2604 chars]",
            "url": "https://www.npr.org/2025/03/12/g-s1-53270/australia-us-tariffs-steel-and-aluminum"
        },
        {
            "title": "Elon Musk's net worth dropped $29 billion in one day as Tesla stock tanks",
            "content": "Elon Musk's net worth has dropped by $132 billion this year as Tesla's stock price has tanked.Andrew Harnik/Getty Images\r\n<ul><li>Elon Musk's net worth fell by $29 billion as Monday as Tesla's stock … [+2222 chars]",
            "url": "https://www.businessinsider.com/elon-musk-net-worth-drops-billion-tesla-stock-2025-3"
        },
        {
            "title": "Starliner astronauts Suni Williams and Butch Wilmore are finally set to return home this week, after 9 months in space",
            "content": "Two NASA astronauts who have been in space for more than nine months awaiting a return trip to Earth are finally set to come home this week.\r\nSuni Williams and Butch Wilmore who have been aboard the … [+3359 chars]",
            "url": "https://www.yahoo.com/news/starliner-astronauts-suni-williams-and-butch-wilmore-are-finally-set-to-return-home-this-week-after-9-months-in-space-170135080.html"
        },
        {
            "title": "U.S. relationship likely top of mind for voters this federal election, poll analyst says",
            "content": "Liberals and Conservatives are running neck-in-neck to win the federal election April 28, says a poll analyst, who has identified three potentially close races in New Brunswick.\r\nÉric Grenier, who co… [+3476 chars]",
            "url": "https://ca.news.yahoo.com/u-relationship-likely-top-mind-133705255.html"
        },
        {
            "title": "Why are thousands of people protesting in Turkey?",
            "content": "Tens of thousands of people across Turkey have been protesting the arrest of Istanbul mayor Ekrem Imamoglu - the main political rival of President Recep Tayyip Erdogan.\r\nProtesters have been fired up… [+5414 chars]",
            "url": "https://www.bbc.com/news/articles/czrnzdkp68eo"
        },
        {
            "title": "Rachel Reeves: I will not 'tax and spend'",
            "content": "Chancellor Rachel Reeves has ruled out \"tax and spend\" policies, signalling that she will neither raise taxes nor government budgets in her critical Spring Statement next week.\r\nSpeaking in a BBC doc… [+4314 chars]",
            "url": "https://www.bbc.com/news/articles/c78eg7dp9ypo"
        },
        {
            "title": "SpaceX craft to launch to retrieve 2 astronauts who have been swept up in politics",
            "content": "A SpaceX Dragon spacecraft will launch Wednesday to the International Space Station. It's expected to bring back two astronauts who've had an unexpectedly long stay that's become mired in politics.",
            "url": "https://www.npr.org/2025/03/12/nx-s1-5323071/spacex-craft-to-launch-to-retrieve-2-astronauts-who-have-been-swept-up-in-politics"
        },
        {
            "title": "‘Musk’s Involvement in Politics Could Be the Downfall of Tesla’",
            "content": "Once upon a time, Tesla owners could feel assured that they came off as forward-thinking consumers looking to reduce their carbon footprint. The sleek, high-tech electric vehicles were even something… [+15720 chars]",
            "url": "http://www.rollingstone.com/culture/culture-features/musk-tesla-backlash-protest-1235288504/"
        },
        {
            "title": "Contentious Republican town halls are going viral",
            "content": "In a TikTok video from CNN that has been viewed more than 3 million times since late February, the voice of a voter in Roswell, Georgia, pierces through a town hall event held by Rep. Rich McCormick … [+10042 chars]",
            "url": "https://www.theverge.com/news/628284/republican-town-hall-videos-doge-musk-trump-tiktok"
        },
        {
            "title": "Trump is bringing back McCarthyism to go after Mahmoud Khalil",
            "content": "Trump is bringing back McCarthyism to go after Mahmoud Khalil\r\nThe current administration wants to go after protesters using an obscure Cold War-era statute.\r\nTrump is bringing back McCarthyism to go… [+10987 chars]",
            "url": "https://www.theverge.com/policy/628411/mahmoud-khalil-immigration-nationality-act-green-card-state-department"
        },
        {
            "title": "How ‘Careless People’ is becoming a bigger problem for Meta",
            "content": "The companys attempt to squash an ex-employees controversial memoir has gotten the attention of Congress.\r\nThe companys attempt to squash an ex-employees controversial memoir has gotten the attention… [+8144 chars]",
            "url": "https://www.theverge.com/command-line-newsletter/634080/careless-people-sarah-wynn-williams-book-meta-congress"
        },
        {
            "title": "The Meaning of Rodrigo Duterte’s Arrest",
            "content": "March 11 was a day of reckoning. Fresh off a plane at the Manila international airport, former Philippine President Rodrigo Duterte was flanked and detained under an arrest warrant issued by the Inte… [+3400 chars]",
            "url": "https://time.com/7266779/philippines-duterte-arrest-icc-warrant/"
        },
        {
            "title": "Leaked WaPo memo reveals big changes coming to Jeff Bezos' newsroom",
            "content": "Jeff Bezos owns The Washington Post, which will undergo a reorganization.Axelle/Bauer-Griffin/FilmMagic\r\n<ul><li>Washington Post executive editor Matt Murray detailed a newsroom reorganization in a m… [+10230 chars]",
            "url": "https://www.businessinsider.com/leaked-wapo-memo-reveals-big-changes-coming-to-bezos-newsroom-2025-3"
        },
        {
            "title": "Tesla's challenges run deeper than 'toxic' controversy around Elon Musk",
            "content": "\"This has been our family car for three years, and it has been an absolute dream,\" says Ben Kilbey as he shows me his gleaming pearl-white Tesla Model Y.\r\nBen is a staunch electric car advocate. He r… [+13198 chars]",
            "url": "https://www.bbc.com/news/articles/cz61vwjel2zo"
        },
        {
            "title": "A look at community apps like Kutumb mobilizing millions of Indians for politics, spreading disinformation, and inciting hate, beyond civil watchdogs' scrutiny (The Reporters' Collective)",
            "content": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 3:55 AM ET, March 12, 2025.\r\nThe most current version of the site as always is available at our home page.\r\nTo vie… [+68 chars]",
            "url": "https://www.techmeme.com/250312/p10"
        },
        {
            "title": "Northeast Greenland National Park: Photographing Earth’s Last Untouched Frontier",
            "content": "Greenland has been making headlines lately, but beyond the news stories, another side of the island has nothing to do with politics. \r\nNortheast Greenland National Park is the largest national park o… [+3553 chars]",
            "url": "https://petapixel.com/2025/03/08/northeast-greenland-national-park-photographing-earths-last-untouched-frontier/"
        },
        {
            "title": "6 falling Tesla sales numbers that should worry Elon Musk",
            "content": "Elon Musk told investors to expect Tesla sales to grow this year but plummeting sales in multiple countries around the world are complicating that goal.\r\nWhile Tesla's Model Y continues to be a top s… [+2634 chars]",
            "url": "https://www.businessinsider.com/tesla-falling-sales-numbers-should-worry-elon-musk-2025-3"
        },
        {
            "title": "Kenya’s handshake politics: Elite self-preservation disguised as compromise",
            "content": "The handshake is an honoured tradition of Kenyan politics. It signifies the coming together of seemingly intractable enemies into an agreement to share the spoils rather than fight over them. It has … [+5902 chars]",
            "url": "https://www.aljazeera.com/opinions/2025/3/21/kenyas-handshake-politics-elite-self-preservation-disguised-as-compromise"
        },
        {
            "title": "Bernie Sanders is drawing record crowds as he pushes Democrats to 'fight oligarchy'",
            "content": "TEMPE, Ariz. Sen. Bernie Sanders has emerged as a leading voice for voters opposed to President Trump's rapid push to dismantle the federal government and frustrated with the Democratic Party's respo… [+6463 chars]",
            "url": "https://www.npr.org/2025/03/22/nx-s1-5334488/bernie-sanders-fight-oligarchy-tour-trump-musk-doge-democrats"
        },
        {
            "title": "Musk demoted, markets sink & voters recoil from Trump slump: Ezra Klein x Ari Melber",
            "content": "The New York Times Ezra Klein joins MSNBCs Ari Melber for an extended conversation on the Trump-Musk agenda, Bidens legacy, the role of media and the internet in shaping politics, and Kleins new book… [+145 chars]",
            "url": "https://www.yahoo.com/news/musk-demoted-markets-sink-voters-201433044.html"
        },
        {
            "title": "The Elon tax: Ad insiders say they're advising clients to spend on X to avoid legal and political headaches",
            "content": "Elon Musk owns X, which has seen some advertisers return to the platform.AP/Evan Vucci\r\n<ul><li>Some ad agencies and consultants say they're advising clients to spend on Elon Musk's X.</li><li>Indust… [+7701 chars]",
            "url": "https://www.businessinsider.com/ad-insiders-advise-to-spend-x-avoid-political-legal-pain-2025-3"
        },
        {
            "title": "Zero-sum politics is destroying America. We can build a way out.",
            "content": "If youre anything like me a policy dork who spends too much time on X youve been unable to escape discussion of a new book called Abundance. \r\nWritten by the Atlantics Derek Thompson and the New York… [+4788 chars]",
            "url": "https://www.vox.com/future-perfect/405403/abundance-ezra-klein-building-costs-housing-energy-democrats-polarization"
        },
        {
            "title": "Judge weighing whether to compel Trump administration to unfreeze FEMA funds",
            "content": "A federal judge is weighing whether to compel the Trump administration to unfreeze millions of dollars in previously allocated FEMA funds.\r\nA coalition of 22 Democratic attorneys general says the adm… [+1403 chars]",
            "url": "https://abcnews.go.com/US/judge-weighing-compel-trump-administration-unfreeze-fema-funds/story?id=119477524"
        },
        {
            "title": "‘Love Is Blind’ Executive Producer Says ‘We Just Need Nice Men’",
            "content": "It’s been five years since Love Is Blind debuted on Netflix back in February 2020, becoming a pandemic-era sensation. Over that time, the show has remained a phenomenon but changed in many ways, some… [+15303 chars]",
            "url": "http://www.rollingstone.com/tv-movies/tv-movie-features/love-is-blind-season-8-reunion-interview-1235293273/"
        },
        {
            "title": "Elon Musk's surprise Tesla all-hands left some workers feeling comforted and some feeling cynical",
            "content": "One Tesla worker says it was obvious Elon Musk took his focus from the carmaker when he bought Twitter, but it's sense returned — sometimes erratically.Justin Sullivan/Getty Images\r\n<ul><li>Elon Musk… [+3581 chars]",
            "url": "https://www.businessinsider.com/elon-musk-surprise-tesla-all-hands-employee-reaction-2025-3"
        },
        {
            "title": "Palmer Luckey reveals his latest texts with Elon Musk",
            "content": "Palmer Luckey (left) and Elon Musk (right) text regularly.Patrick T. Fallon/Getty Images; AP Photo/Matt Rourke\r\n<ul><li>In recent texts, Palmer Luckey and Elon Musk discussed an award-winning Black E… [+2965 chars]",
            "url": "https://www.businessinsider.com/elon-musk-palmer-luckey-black-eyed-peas-song-2025-3"
        },
        {
            "title": "How the Nazis Waged War on Modern Art: Inside the “Degenerate Art” Exhibition of 1937",
            "content": "Before his fate­ful entry into pol­i­tics, Adolf Hitler want­ed to be an artist. Even to the most neu­tral imag­in­able observ­er, the known exam­ples of the esti­mat­ed 2,000 to 3,000 paint­ings and… [+3437 chars]",
            "url": "https://www.openculture.com/?p=1122420"
        },
        {
            "title": "A photographer took a shot of Trump's notes — and they read like a Tesla sales pitch",
            "content": "President Donald Trump holding a handwritten list of Tesla options.Andrew Harnik/Getty Images\r\n<ul><li>President Donald Trump said he plans to buy a Tesla to support Elon Musk.</li><li>Trump praised … [+2607 chars]",
            "url": "https://www.businessinsider.com/photo-trumps-notes-shows-tesla-prices-2025-3"
        },
        {
            "title": "Musk’s never been more powerful so why are Tesla shares tanking?",
            "content": "The bromance between United States President Donald Trump and tech billionaire Elon Musk was on full display on Tuesday when the White House South Lawn was transformed into a miniature Tesla showroom… [+8533 chars]",
            "url": "https://www.aljazeera.com/news/2025/3/14/musks-never-been-more-powerful-so-why-are-tesla-shares-tanking"
        },
        {
            "title": "Farrah Abraham Jokes About Throuples, Politics & More in Stand-Up Debut",
            "content": "All good things dont come in threes -- well, according to Farrah Abraham, who made her stand-up comedy debut in NYC with a cheeky \"throuple\" joke.\r\nWeve got a clip of her best bits -- Farrah was flex… [+745 chars]",
            "url": "https://www.tmz.com/2025/03/14/farrah-abraham-stand-up-comedy-debut-nyc-spearmint-rhino/"
        },
        {
            "title": "Elon Musk urges Tesla staffers to 'hang onto your stock' even though it has fallen 50%",
            "content": "Our free, fast, and fun briefing on the global economy, delivered every weekday morning.",
            "url": "https://qz.com/elon-musk-tesla-stock-plunge-trump-doge-1851771615"
        },
        {
            "title": "Bad Bunny and adidas Introduce the Ballerina",
            "content": "Name: Bad Bunny x adidas Ballerina “Bold Gold”Colorway: Bold Gold/Core BlackSKU: JQ9230MSRP: $120 USDRelease Date: March 29Where to Buy:adidas\r\nUpdate: It’s been a big year for Bad Bunny as he kicked… [+1781 chars]",
            "url": "https://hypebeast.com/2025/3/bad-bunny-adidas-ballerina-bold-gold-jq9230-release-date"
        },
        {
            "title": "Belonging Is Bigger Than Politics",
            "content": "This week, the New York Timesreported that the Trump Administration is compiling a list of words to be erased from government documents and for federal workers to refrain from using. Many of the term… [+4475 chars]",
            "url": "https://www.psychologytoday.com/us/blog/the-power-of-belonging/202503/belonging-is-bigger-than-politics"
        },
        {
            "title": "Center-Right Party Wins Most Votes in Greenland’s Elections Amid Threat of Trump Takeover",
            "content": "NUUK, Greenland The center-right Demokraatit Party won the most votes in Greenlands parliamentary elections, a surprise result as the territory went to the polls in the shadow of President Donald Tru… [+2547 chars]",
            "url": "https://time.com/7267067/demokraatit-democrats-party-greenland-elections-trump-denmark/"
        },
        {
            "title": "Supreme Court to hear Louisiana race and redistricting case",
            "content": "The United States Supreme Court on Monday will hear arguments in a Louisiana case involving politics, race and voting maps with potential implications for the 2026 midterm elections.\r\nThe justices ar… [+1389 chars]",
            "url": "https://abcnews.go.com/Politics/supreme-court-hear-louisiana-race-redistricting-case/story?id=120093245"
        },
        {
            "title": "Trump is asserting extraordinary power over independent agencies. Is the Fed next?",
            "content": "This first appeared in the Planet Money newsletter. You can sign up here.\r\nPresident Trump vs. the independent agencies. It's a battle for the history books literally. To understand the significance … [+15778 chars]",
            "url": "https://www.npr.org/sections/planet-money/2025/03/04/g-s1-51515/trump-asserting-extraordinary-power-over-independent-agencies-is-the-fed-next"
        },
        {
            "title": "Tesla's biggest fan on Wall Street says worries over Elon Musk's politics are overblown",
            "content": "Tesla (TSLA) stock was booming as 2024 came to a close, hitting a new all-time high and closing at more than $420 per share. Now sales are getting slammed in Europe and those gains have been all but … [+3278 chars]",
            "url": "https://qz.com/tesla-stock-market-cap-trump-politics-elon-musk-wedbush-1851768370"
        },
        {
            "title": "The Boeing Starliner astronauts are trying to stay out of American politics",
            "content": "In This Story\r\nAstronauts Barry Butch Wilmore and Sunita Sunny Williams headed to space on June 5 for an approximately eight-day mission. Now 273 days later, theyre still orbiting around the world on… [+2579 chars]",
            "url": "https://qz.com/boeing-starliner-astronauts-musk-trump-spacex-nasa-1851767811"
        },
        {
            "title": "Under Trump, AI Scientists Are Told to Remove ‘Ideological Bias’ From Powerful Models",
            "content": "The National Institute of Standards and Technology (NIST) has issued new instructions to scientists that partner with the US Artificial Intelligence Safety Institute (AISI) that eliminate mention of … [+3395 chars]",
            "url": "https://www.wired.com/story/ai-safety-institute-new-directive-america-first/"
        },
        {
            "title": "AMD is launching its latest Ryzen 9 X3D gaming processors on March 12th",
            "content": "AMD is announcing that its latest gaming-oriented Ryzen 9 9950X3D and 9900X3D processors will be available next week. The new chips improve on the 9800X3D, which is widely considered as the best gami… [+957 chars]",
            "url": "https://www.theverge.com/news/625984/amd-ryzen-9-x3d-9950-9900-16-zen-5-cores-launch"
        },
        {
            "title": "LG’s new air conditioner directs cool air towards people it detects.",
            "content": "The Artcool AI Air doesn’t look as artsy as LG’s previous Artcool air conditioners, but it does offer improved energy efficiency by detecting the room’s layout and the position of its occupants so it… [+246 chars]",
            "url": "https://www.theverge.com/news/626065/lg-artcool-ai-air-conditioner-room-occupant-sensing"
        },
        {
            "title": "Watch this ultra-detailed animation of the seafloor",
            "content": "A NASA and CNES satellite lets scientists see the ocean floor in new ways. \r\nA NASA and CNES satellite lets scientists see the ocean floor in new ways. \r\nThe world has a more detailed map of the seaf… [+2724 chars]",
            "url": "https://www.theverge.com/nasa/634086/ocean-floor-map-satellite-nasa-cnes"
        },
        {
            "title": "FCC chair says we’re too dependent on GPS and wants to explore ‘alternatives’",
            "content": "FCC chair Brendan Carr says relying heavily on GPS leaves us exposed.\r\nFCC chair Brendan Carr says relying heavily on GPS leaves us exposed.\r\nThe Federal Communications Commission (FCC) plans to vote… [+1179 chars]",
            "url": "https://www.theverge.com/news/625671/fcc-vote-gps-911-technologies-inquiry"
        },
        {
            "title": "7 cool indie games from GDC 2025",
            "content": "The Game Developers Conference, an annual gathering that brings thousands of game developers to San Francisco, has just wrapped up. While most of the event is about networking and interesting talks a… [+5150 chars]",
            "url": "https://www.theverge.com/games/633885/gdc-2025-best-indie-games"
        },
        {
            "title": "Hear what Horizon Zero Dawn actor Ashly Burch thinks about AI taking her job",
            "content": "Ashly Burch, the award-winning voice and performance actor behind Horizon Zero Dawn’s Aloy — one of the most prominent characters on PlayStation today — has some news and some very strong thoughts ab… [+3400 chars]",
            "url": "https://www.theverge.com/news/630176/ashly-burch-sony-ai-horizon-aloy-tech-demo-sag-aftra-strike"
        },
        {
            "title": "Android 16 is getting a major hearing accessibility feature",
            "content": "Auracast will give people who use hearing aids a little extra clarity.\r\nAuracast will give people who use hearing aids a little extra clarity.\r\nAndroid phones will soon support Auracast with Bluetoot… [+1443 chars]",
            "url": "https://www.theverge.com/tech/628533/android-16-auracast-hearing-aid-support"
        },
        {
            "title": "Xiaomi Buds 5 Pro are the first to deliver on Qualcomm’s promise of Wi-Fi earbuds",
            "content": "They even have better battery life than the Bluetooth model.\r\nThey even have better battery life than the Bluetooth model.\r\nXiaomi has given a European launch to its Buds 5 Pro, the first earbuds to … [+2156 chars]",
            "url": "https://www.theverge.com/news/622452/xiaomi-buds-5-pro-are-the-first-to-deliver-on-qualcomms-promise-of-wi-fi-earbuds"
        },
        {
            "title": "Sony is experimenting with AI-powered PlayStation characters",
            "content": "Sonys advanced technology group has created an AI-powered version of Aloy from PlayStations Horizon games.\r\nSonys advanced technology group has created an AI-powered version of Aloy from PlayStations… [+3464 chars]",
            "url": "https://www.theverge.com/news/626695/sony-playstation-ai-characters-aloy-horizon-forbidden-west-prototype"
        },
        {
            "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
            "content": "Donald Trump's arrival to the White House is a \"a major blow to global climate action\". So said Christiana Figueres, the former UN climate chief, after he was elected for a second term in November.\r\n… [+10864 chars]",
            "url": "https://www.bbc.com/news/articles/c30mjedjzgpo"
        },
        {
            "title": "Apple Releases Safari Technology Preview 215 With Bug Fixes and Performance Improvements",
            "content": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test fe… [+968 chars]",
            "url": "https://www.macrumors.com/2025/03/17/apple-releases-safari-technology-preview-215/"
        },
        {
            "title": "Google’s Gemini Robotics AI Model Reaches Into the Physical World",
            "content": "Google said at its briefing that it is currently collaborating with a number of robotics companies, including Agility Robotics and Boston Dynamics, which make legged robots, and Enchanted Tools, whic… [+2299 chars]",
            "url": "https://www.wired.com/story/googles-gemini-robotics-ai-model-that-reaches-into-the-physical-world/"
        },
        {
            "title": "Sony’s Dazzling New RGB LED TV Comes in 2026",
            "content": "LED TVs are about to get a lot better. As demonstrated by Hisense and to some extent Samsung at CES 2025, a new backlight technology called RGB LED is poised to improve the quality and efficiency of … [+2714 chars]",
            "url": "https://www.wired.com/story/sony-rgb-led-tv/"
        },
        {
            "title": "Chinese Companies Rush to Put DeepSeek in Everything",
            "content": "A mobile shooting game developed by Tencent is using DeepSeek to power an in-game assistant that can, among other things, give players fortune-telling readers about whether they are going to have a g… [+3020 chars]",
            "url": "https://www.wired.com/story/deepseek-china-nationalism/"
        },
        {
            "title": "Apple will soon support encrypted RCS messaging with Android users",
            "content": "We will add support for end-to-end encrypted RCS messages to iOS, iPadOS, macOS, and watchOS in future software updates.\r\nWe will add support for end-to-end encrypted RCS messages to iOS, iPadOS, mac… [+1748 chars]",
            "url": "https://www.theverge.com/news/629620/apple-iphone-e2ee-encryption-rcs-messaging-android"
        },
        {
            "title": "Cellphone deepfake detection technology unveiled at MWC",
            "content": "STORY: :: Barcelona, Spain\r\nIt's a new line of defense against the rising prevalence of deepfakes.\r\n:: March 2, 2025\r\nAll built into a mobile phone, one artificial intelligence claims it can snuff ou… [+1055 chars]",
            "url": "https://finance.yahoo.com/video/cellphone-deepfake-detection-technology-unveiled-142431681.html"
        },
        {
            "title": "GHD’s Chronos Max Review: High Tech, Not High Heat",
            "content": "A too-high heat, like 450 degrees, can damage the hair strand's internal structure; the lowest setting damages the hair's cuticle layer without creating a long-lasting style. GHD has found the perfec… [+3199 chars]",
            "url": "https://www.wired.com/review/ghd-chronos-max-hair-straightener/"
        },
        {
            "title": "Insomniac’s VR titles delisted, casting a shadow over the technology",
            "content": "Before they became tied to the Spider-Man series of games and subsequently acquired to become a part of PlayStation Worldwide Studios, Burbank-based Insomniac Games dabbled in VR titles like The Edge… [+2669 chars]",
            "url": "https://venturebeat.com/games/insomniacs-vr-titles-delisted-casting-a-shadow-over-the-technology/"
        },
        {
            "title": "Top general warns Marines that their cellphones could get them killed in new video pointing out Russian catastrophes",
            "content": "The Marine Corps' top general sent a video reminder out to the force this week, cautioning troops that battlefield cellphone usage can have deadly consequences. It points to Russian disasters in Ukra… [+3525 chars]",
            "url": "https://www.businessinsider.com/marine-general-warns-troops-cellphones-could-get-them-killed-video-2025-3"
        },
        {
            "title": "Quantum Computing Is Dead. Long Live Quantum Computing!",
            "content": "This is the year of quantum science and technology. Literally: The United Nations said so. But no amount of pomp and hype can make something true. The fact is, its been the year of quantum nearly eve… [+486 chars]",
            "url": "https://www.wired.com/story/quantum-computing-is-dead-alive/"
        },
        {
            "title": "A Private Space Mission Just Successfully Landed on the Moon for the First Time",
            "content": "With its Blue Ghost lunar module, Texas-based Firefly Aerospace has just achieved what no other private company, anywhere in the world, has ever accomplished: successfully landing on the surface of t… [+1964 chars]",
            "url": "https://www.wired.com/story/a-private-space-mission-has-successfully-landed-on-the-moon-for-the-first-time-blue-ghost-firefly-aerospace/"
        },
        {
            "title": "5 wild things quantum computing could unlock now that Big Tech believes a breakthrough is within reach",
            "content": "Once fault-tolerant quantum computers are here, they stand to revolutionize medicine, privacy, and more.SAMEER AL-DOUMY/AFP via Getty Images\r\n<ul><li>Big Tech companies are investing heavily in quant… [+6383 chars]",
            "url": "https://www.businessinsider.com/quantum-computing-could-improve-medicine-climate-logistics-world-hunger-2025-3"
        },
        {
            "title": "The CEO of Anthropic thinks it may be impossible to warn people about the risks of AI — but he's still going to try",
            "content": "Anthropic CEO Dario Amodei said that people still aren't taking AI seriously enough but he expects that to change within the next two years.\r\n\"I think people will wake up to both the risks and the be… [+3636 chars]",
            "url": "https://www.businessinsider.com/anthropic-ceo-says-ai-risks-are-being-overlooked-2025-2"
        },
        {
            "title": "Tesla more than tripled the workers testing its self-driving technology in California",
            "content": "Tesla registered over 220 test drivers and 100 vehicles for an autonomous driving permit in California.Justin Sullivan/Getty Images\r\n<ul><li>Tesla registered over 220 test drivers and 100 vehicles fo… [+4877 chars]",
            "url": "https://www.businessinsider.com/tesla-autonomous-driving-california-robotaxi-2025-3"
        },
        {
            "title": "VCs have poured billions into a nascent nuclear technology — these are the 4 companies to watch",
            "content": "The site of a small modular reactor in Changjiang Li Autonomous County, Hainan Province of China. The US does not have any operational SMRs.Luo Yunfei/China News Service/VCG via Getty Images\r\n<ul><li… [+9260 chars]",
            "url": "https://www.businessinsider.com/small-modular-reactor-venture-capital-ai-data-centers-2025-3"
        },
        {
            "title": "Sony Ult Wear Noise Cancelling Headphones Are Now at a Steal for $148, Way Cheaper Than AirPods Max",
            "content": "The pursuit of perfect audio has led many enthusiasts down an expensive path, but true immersive sound doesn’t always require breaking the bank. Sony’s Ult Wear Over-Ear Noise Cancelling Headphones r… [+2599 chars]",
            "url": "https://gizmodo.com/sony-ult-wear-noise-cancelling-headphones-are-now-at-a-steal-for-148-way-cheaper-than-airpods-max-2000576011"
        },
        {
            "title": "What to Expect at Nvidia GTC 2025",
            "content": "Nvidias been on a roll this year, starting with the announcement and launch of its 5000 series GPUs. However, as the company’s annual GPU Technology Conference (GTC) starts next week, its clear that … [+2099 chars]",
            "url": "https://gizmodo.com/what-to-expect-at-nvidia-gtc-2025-2000576285"
        },
        {
            "title": "Wire Recording Speaks Again",
            "content": "If you think of old recording technology, you probably think of magnetic tape, either in some kind of cassette or, maybe, on reels. But there’s an even older technology that recorded voice on hair-th… [+1324 chars]",
            "url": "https://hackaday.com/2025/03/16/wire-recording-speaks-again/"
        },
        {
            "title": "Elon Musk’s Neuralink Files to Trademark ‘Telepathy’",
            "content": "Elon Musks brain implant company, Neuralink, has filed applications with the United States Patent and Trademark Office (USPTO) to exclusively own the names Telepathy, Telekinesis, and others for futu… [+3022 chars]",
            "url": "https://www.wired.com/story/elon-musks-neuralink-files-trademark-telepathy/"
        },
        {
            "title": "10 upgrades the FAA says it's making to flying safer",
            "content": "Becoming an air traffic controller is a long and difficult process, and the job is equally stressful. But it comes with good pay.Michael Dwyer/AP\r\n<ul><li>The Department of Transportation announced a… [+4133 chars]",
            "url": "https://www.businessinsider.com/faa-upgrades-air-safety-dc-crash-2025-3"
        },
        {
            "title": "New AI models are running on just one or two chips. Will they trigger another DeepSeek moment for Nvidia?",
            "content": "Nvidia lost close to $600 billion in value over fears that more efficient AI would mean lower demand for its chips. I-Hwa Cheng/AFP/Getty Images\r\n<ul><li>New AI models are emerging that show they can… [+4792 chars]",
            "url": "https://www.businessinsider.com/google-gemma-cohere-nvidia-chips-efficient-deepseek-2025-3"
        },
        {
            "title": "Nvidia's partnership with Taco Bell means AI could soon do more than take your drive-thru order",
            "content": "Yum! has been testing AI at some Taco Bell and Pizza Hut.Ethan Miller/Getty Images\r\n<ul><li>Taco Bell is using AI for drive-thru orders through a partnership with Nvidia.</li><li>Voice AI adoption is… [+3483 chars]",
            "url": "https://www.businessinsider.com/nvidia-taco-bell-yum-team-up-on-ai-ordering-2025-3"
        },
        {
            "title": "U.S. Housing Agency Considers Launching Crypto Experiment",
            "content": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.The U.S. Department of Housing and Urban Development… [+9853 chars]",
            "url": "https://gizmodo.com/u-s-housing-agency-considers-launching-crypto-experiment-2000573596"
        },
        {
            "title": "Yahoo Is Still Here—and It Has Big Plans for AI",
            "content": "In September 2021, Jim Lanzone took over a company whose name once embodied the go-go spirit of the internet but had, over the years, become a joke: Yahoo. He accepted the CEO post from the new priva… [+4722 chars]",
            "url": "https://www.wired.com/story/plaintext-yahoo-turns-30-jim-lanzone/"
        },
        {
            "title": "China Delays BYD Factory in Mexico Over Concerns Tech Will Leak to American Rivals",
            "content": "China is frequently a target of criticism over allegations that it does not innovate but instead exfiltrates intellectual property developed abroad and wins by undercutting rivals on price. Now that … [+3860 chars]",
            "url": "https://gizmodo.com/china-delays-byd-factory-in-mexico-over-concerns-tech-will-leak-to-american-rivals-2000578281"
        },
        {
            "title": "GM taps Nvidia to boost its embattled self-driving projects",
            "content": "The automaker will use the deep-pocketed tech giants chips and software to develop next-gen autonomous cars, robots, and manufacturing processes.\r\nThe automaker will use the deep-pocketed tech giants… [+3825 chars]",
            "url": "https://www.theverge.com/news/631951/gm-nvidia-gtc-deal-cars-robots-factories"
        },
        {
            "title": "Amazon Offers a Self-Heating Coffee Mug at an All-Time Low to Clear Out Stock",
            "content": "For coffee enthusiasts who’ve experienced the disappointment of a lukewarm brew, the Nextmug Temperature-Controlled Self-Heating Coffee Mug offers an elegant solution. This innovative mug, designed i… [+2854 chars]",
            "url": "https://gizmodo.com/amazon-offers-a-self-heating-coffee-mug-at-an-all-time-low-to-clear-out-stock-2000572344"
        },
        {
            "title": "Subsea fibre cables can 'listen out' for sabotage",
            "content": "Chris Baraniuk\r\nSubsea cables are critical to the operation of the internet\r\nThe diver had found the fibre optic cable lying on the seabed of the North Sea. He swam closer, until it was near enough t… [+6780 chars]",
            "url": "https://www.bbc.com/news/articles/cn52rglxr62o"
        },
        {
            "title": "Quantum Computing: Tech's Next Giant Leap?",
            "content": "<ul><li>(2:00) - Key Takeaways From Nvidia GTC 2025\r\n</li><li>(6:50) - What To Learn From Nvidia’s Quantum Day Events\r\n</li><li>(13:30) - What Investors Need To Know About D-wave Quantum Computing\r\n<… [+5413 chars]",
            "url": "https://finance.yahoo.com/news/quantum-computing-techs-next-giant-201200500.html"
        },
        {
            "title": "Sony Unveils RGB LED Backlight Tech That Outperforms Traditional Mini LED",
            "content": "Sony has developed a new TV display technology combining individual red, green, and blue LEDs for backlighting, potentially offering a middle ground between existing Mini LED and OLED panels. Dubbed … [+1065 chars]",
            "url": "https://entertainment.slashdot.org/story/25/03/19/0743248/sony-unveils-rgb-led-backlight-tech-that-outperforms-traditional-mini-led"
        },
        {
            "title": "Shark FlexStyle Styling System Hits a Record Low of $250, the Dyson Airwrap Alternative You Need",
            "content": "The Shark FlexStyle represents a revolutionary approach to hair styling, combining the versatility of a multi-styler with the power of a premium hair dryer. This innovative system transforms from a p… [+2669 chars]",
            "url": "https://gizmodo.com/shark-flexstyle-styling-system-hits-a-record-low-of-250-the-dyson-airwrap-alternative-you-need-2000573444"
        },
        {
            "title": "Power Rangers May Get an AI-Boosted Remaster",
            "content": "As the world waits to see what’s next for Power Rangers, the superhero franchise may return to its past with the help of generative AI.\r\nDuring this weekend’s New York Toy Fair, attendees learned Pla… [+2001 chars]",
            "url": "https://gizmodo.com/power-rangers-may-get-an-ai-boosted-remaster-2000570522"
        },
        {
            "title": "The Dyson Hot and Cool Purifier Drops to Its Lowest Price, Save $130 on Year-Round Air Treatment",
            "content": "Looking for a single solution to your year-round air quality and temperature needs? The Dyson Purifier Hot + Cool Gen 1 stands as one of the most versatile home appliances on the market, combining po… [+2772 chars]",
            "url": "https://gizmodo.com/the-dyson-hot-and-cool-purifier-drops-to-its-lowest-price-save-130-on-year-round-air-treatment-2000575942"
        },
        {
            "title": "Theater-Like Audio for Just $100, Amazon Fire TV Soundbar Makes It Possible",
            "content": "Looking to upgrade your TV’s audio without breaking the bank? Amazon’s Fire TV Soundbar offers a compelling solution for anyone seeking better sound quality than their TV’s built-in speakers can prov… [+2529 chars]",
            "url": "https://gizmodo.com/theater-like-audio-for-just-100-amazon-fire-tv-soundbar-makes-it-possible-2000572335"
        },
        {
            "title": "Apple Watch Series 10 Just Hit Its Lowest Price Since Launch, $100 Off on Amazon for a Limited Time",
            "content": "The Apple Watch Series 10 represents the pinnacle of wearable technology, combining advanced health monitoring, fitness tracking, and smart features in a sleeker, more refined design. With a larger d… [+2647 chars]",
            "url": "https://gizmodo.com/apple-watch-series-10-just-hit-its-lowest-price-since-launch-100-off-on-amazon-for-a-limited-time-2000573441"
        },
        {
            "title": "Bless the Modder Who Is Fixing AMD’s Newest GPUs",
            "content": "You save up your hard-earned money to invest in a new graphics card for your PC, snagged your new prized possession, and life is good. Youre gaming with smooth renders, negligible latency, and bliste… [+2297 chars]",
            "url": "https://gizmodo.com/bless-the-modder-who-is-fixing-amds-newest-gpus-2000576983"
        },
        {
            "title": "TSMC announces $100 billion investment in US chipmaking",
            "content": "TSMC will build two new chip factories in addition to the three it announced previously.\r\nTSMC will build two new chip factories in addition to the three it announced previously.\r\nTaiwan Semiconducto… [+1731 chars]",
            "url": "https://www.theverge.com/news/623335/tsmc-chip-factories-100-billion-trump"
        },
        {
            "title": "Bad design might simply be obsolete design",
            "content": "Perhaps you’ve encountered a sink with two taps, not one. One for hot, one for cold, without a chance to mix them before you scald or chill yourself.\r\nIt seems absurd that the folks who figured out t… [+664 chars]",
            "url": "https://seths.blog/2025/03/bad-design-might-simply-be-obsolete-design/"
        },
        {
            "title": "Democratic FCC Commissioner Geoffrey Starks will resign this spring",
            "content": "WASHINGTON, DC – DECEMBER 05: Federal Communication Commission Commissioner Geoffrey Starks testifies before the House Energy and Commerce Committee’s Communications and Technology Subcommittee in th… [+1942 chars]",
            "url": "https://www.theverge.com/news/631833/democratic-fcc-commissioner-geoffrey-starks-resigns"
        },
        {
            "title": "China claims its stealth drones fly 3x longer using 50% less energy than US rivals",
            "content": "China has allegedly taken over the US in the development of a state-of-the-art new stealth aircraft, a report from the South China Morning Post (SCMP) reveals.\r\nNewly published research shows that Be… [+3011 chars]",
            "url": "https://interestingengineering.com/innovation/china-stealth-drones-ahead-of-darpas"
        },
        {
            "title": "Mercedes-Benz is hedging its bets with rebooted CLA sedan",
            "content": "The automaker plans to offer electric, hybrid, and gas versions of the upcoming model all built on the new MMA platform.\r\nThe automaker plans to offer electric, hybrid, and gas versions of the upcomi… [+6722 chars]",
            "url": "https://www.theverge.com/news/628464/mercedes-benz-cla-ev-hybrid-mma-platform"
        },
        {
            "title": "Want to Live Longer, Healthier, and Happier? Then Cultivate Your Social Connections",
            "content": "Social scientist Kasley Killam has always been fascinated by the science of human connection. In college, for instance, she once decided to conduct a personal experiment and perform an act of kindnes… [+3758 chars]",
            "url": "https://www.wired.com/story/want-to-live-longer-healthier-and-happier-cultivate-your-social-connections-wired-health-kasley-killam/"
        },
        {
            "title": "Prince William to visit British troops in Estonia",
            "content": "The Prince of Wales will make his first visit to Estonia at the end of next week to meet British troops providing a deterrent to Russian aggression in the region.\r\nPrince William will travel in his r… [+497 chars]",
            "url": "https://www.bbc.com/news/articles/clyz3d514w0o"
        },
        {
            "title": "Patronus AI’s Judge-Image wants to keep AI honest — and Etsy is already using it",
            "content": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\r\nPatronus AI announced today the launch of what it calls the industrys f… [+6223 chars]",
            "url": "https://venturebeat.com/ai/patronus-ais-judge-image-wants-to-keep-ai-honest-and-etsy-is-already-using-it/"
        },
        {
            "title": "China's BYD Claims 5-Minute EV Battery Charge Gives 250 Miles of Range",
            "content": "Chinese auto manufacturer BYD says it has developed technology that speeds up electric vehicle battery charging to as little as five minutes at 1,000 kilowatts, providing enough energy for nearly 250… [+684 chars]",
            "url": "https://www.cnet.com/home/electric-vehicles/chinas-byd-claims-5-minute-ev-battery-charging-gives-250-miles-of-range/"
        },
        {
            "title": "This Is the Best Scene in Star Trek: Voyager‘s First Season",
            "content": "Star Trek has always found great strength in the episodic format. Sure, the classic shows all dabbled in serialized elements, and some of them excelled in those elements the further they played with … [+7479 chars]",
            "url": "https://gizmodo.com/star-trek-voyager-best-scene-prime-factors-30th-anniversary-janeway-tuvok-2000578836"
        },
        {
            "title": "The Weird and Wacky Gadgets We Saw at MWC 2025",
            "content": "Infinix says the case stores up to 2 watts of this energy and transfers it to the phone when needed. The company also claims the case employs its Sunflower wireless charging technology, inspired by p… [+5347 chars]",
            "url": "https://www.wired.com/story/weird-and-wacky-gadgets-at-mwc-2025/"
        },
        {
            "title": "Window cleaner in quest to confirm priceless Shakespeare portrait",
            "content": "Eric Johnson &amp; Louise Parry\r\nArt experts are divided on whether this is a genuine contemporary portrait of Shakespeare\r\nWindow cleaner Steven Wadlow has spent more than a decade trying to prove h… [+4661 chars]",
            "url": "https://www.bbc.com/news/articles/c5yr37nlzv8o"
        },
        {
            "title": "Trump’s FCC Head Warns EU Content Rules ‘Incompatible’ With Free Speech",
            "content": "The European Union wants social media companies like Facebook, Instagram, and X to do more to crack down on illegal content like hate speech and child sexual abuse material. The Trump administration … [+3448 chars]",
            "url": "https://gizmodo.com/trumps-fcc-head-warns-eu-content-rules-incompatible-with-free-speech-2000570843"
        },
        {
            "title": "Trump’s Dismantling of NASA Has Officially Begun",
            "content": "NASA has begun implementing its reduction in force (RIF) approach, closing three offices and laying off staff in compliance with executive orders by the new administration that target the federal wor… [+3077 chars]",
            "url": "https://gizmodo.com/nasa-closes-offices-reduces-workforce-following-trumps-executive-orders-2000574340"
        },
        {
            "title": "Patient With Artificial Heart Smashes Survival Record",
            "content": "An Australian man has become a medical marvel thanks to his groundbreaking artificial heart. The man’s doctors reported this week that he was the first person in the world to be discharged from the h… [+3192 chars]",
            "url": "https://gizmodo.com/patient-with-artificial-heart-smashes-survival-record-2000574948"
        },
        {
            "title": "Tearing Down a Vintage Word Processor",
            "content": "There was a time when the line between typewriters and word processing software was a bit fuzzy. [Poking Technology] found a Xerox 6040 which can’t decide what it is. It looks like a typewriter but h… [+1089 chars]",
            "url": "https://hackaday.com/2025/03/07/tearing-down-a-vintage-word-processor/"
        },
        {
            "title": "Writing a GPS Receiver from Scratch",
            "content": "GPS is an incredible piece of modern technology. Not only does it allow for locating objects precisely anywhere on the planet, but it also enables the turn-by-turn directions we take for granted thes… [+1234 chars]",
            "url": "https://hackaday.com/2025/03/18/writing-a-gps-receiver-from-scratch/"
        },
        {
            "title": "Latest Turing Award winners again warn of AI dangers",
            "content": "The creators of a foundational AI training method are concerned that companies are motivated by profit, not safety.\r\nThe creators of a foundational AI training method are concerned that companies are… [+2134 chars]",
            "url": "https://www.theverge.com/news/624485/turing-award-andrew-barto-richard-sutton-ai-dangers"
        },
        {
            "title": "Driverless racecar sets a new autonomous speed record",
            "content": "A fully driverless Maserati MC20 Coupe reached 197.7 mph at Kennedy Space Center last week.\r\nA fully driverless Maserati MC20 Coupe reached 197.7 mph at Kennedy Space Center last week.\r\nLook out: the… [+2018 chars]",
            "url": "https://www.theverge.com/news/621990/autonomous-speed-record-indy-challenge-maserati"
        },
        {
            "title": "Sony will give the PS5 Pro crisper graphics — by backporting FSR 4",
            "content": "Sony says its working on a reimplementation of AMDs FSR 4 upscaler that will make PS5 Pro games look crisper.\r\nSony says its working on a reimplementation of AMDs FSR 4 upscaler that will make PS5 Pr… [+2326 chars]",
            "url": "https://www.theverge.com/news/626952/sony-fsr-4-upscaler-coming-to-ps5-pro-reimplementation"
        },
        {
            "title": "Alphabet spins off Starlink competitor Taara",
            "content": "Taara’s current Lightbridges are about the size of a traffic light, but its new chips should deliver smaller designs.\r\n\n\nLight-based internet project Taara is exiting Alphabet’s “moonshot” incubator … [+2417 chars]",
            "url": "https://www.theverge.com/news/631049/alphabet-spins-off-starlink-competitor-taara"
        },
        {
            "title": "JD Vance tries to mend the MAGA-Tech divide",
            "content": "How do you get the globalists and anti-globalists to get along? Blame the government.\r\nHow do you get the globalists and anti-globalists to get along? Blame the government.\r\nOn Tuesday, Vice Presiden… [+2135 chars]",
            "url": "https://www.theverge.com/policy/632006/jd-vance-maga-tech-divide-andreesen-horowitz"
        },
        {
            "title": "I bought a Tesla for its safety and technology. Strangers have mocked me for supporting Elon Musk, but that won't stop me from buying another one.",
            "content": "Mitchell Feldman said he bought his Tesla in 2022 the experience, safety, and technology.Mitchell Feldman\r\n<ul><li>Mitchell Feldman bought his Tesla Model Y in 2022 and was immediately enamoured by t… [+3957 chars]",
            "url": "https://www.businessinsider.com/tesla-owner-confronted-about-musk-shocked-2025-3"
        },
        {
            "title": "UK autonomous driving startup Wayve rolls into Germany with new testing hub",
            "content": "British autonomous driving startup Wayve is set to establish a testing and development hub in Germany as it prepares to deploy self-driving vehicles in Europes largest automotive market. \r\nWayves new… [+2575 chars]",
            "url": "https://thenextweb.com/news/autonomous-vehicles-startup-wayve-bring-embodied-ai-to-germany"
        },
        {
            "title": "Military vehicles to get mixed reality windshields controlled by human eyes",
            "content": "Finnish startup Distance Technologies emerged from stealth last year with a technology it claims can turn any transparent surface into a mixed reality (MR) display. Now, it has teamed up with Patria … [+3372 chars]",
            "url": "https://thenextweb.com/news/military-vehicles-add-distance-mixed-reality-windshields"
        },
        {
            "title": "How 18F Transformed Government Technology and Why Its Elimination Matters",
            "content": "Healthcare.gov, the government health insurance marketplace website, launched in October 2013 only to buckle under the weight of just 2,000 simultaneous users. As millions of Americans stared at erro… [+5913 chars]",
            "url": "https://gizmodo.com/how-18f-transformed-government-technology-and-why-its-elimination-matters-2000574345"
        },
        {
            "title": "Domu Technology Inc. (YC S24) Is Hiring a Vibe Coder",
            "content": "About Us:Domu is an enterprise voice AI startup crushing it in the financial services industry. Weve tripled (ARR) with Fortune 500 customers and are on track to dominate the industry. Now, 50% of ou… [+1421 chars]",
            "url": "https://www.ycombinator.com/companies/domu-technology-inc/jobs/hwWsGdU-vibe-coder-ai-engineer"
        },
        {
            "title": "Wearable Electronics Made with a 1000-Year Old Technology",
            "content": "Yes, you read it right. A 1000-year old technology from Song Dynasty is being used to make smart textiles as we speak.\r\nPhoto by Marco Zuppone on Unsplash\r\nIt is the year 989 AD, silk has gained the … [+5148 chars]",
            "url": "https://ygoliya.medium.com/wearable-electronics-made-with-a-1000-year-old-technology-c585a792b958"
        },
        {
            "title": "Draper stuns Alcaraz to reach Indian Wells final",
            "content": "Britain's Jack Draper was helped by a controversial video assistant referee-style call in his favour to earn a coming-of-age win over Carlos Alcaraz and reach the biggest final of his career.\r\nDraper… [+1089 chars]",
            "url": "https://www.bbc.com/sport/tennis/articles/czdn86z4v50o"
        },
        {
            "title": "iRobot launches eight new Roombas and finally adds lidar mapping",
            "content": "iRobot’s new lineup of Roomba robot vacuum and mops now all come with lidar navigation and mapping and a whole new look.\r\n\n\nAfter a tumultuous 2024, in which iRobot lost its founder and CEO, Colin An… [+7882 chars]",
            "url": "https://www.theverge.com/news/627751/irobot-launches-eight-new-roombas-with-lidar-room-mapping"
        },
        {
            "title": "The Legend of Larry Owl",
            "content": "This post sits at the intersection of technology and 20th century history.At 42 Lomasney Way in downtown Boston, theres a brownstone known as the Last Tenement. Built in the 1870s, it was once part o… [+3550 chars]",
            "url": "https://onefoottsunami.com/2025/03/14/the-legend-of-larry-owl/"
        },
        {
            "title": "Opening iOS is good news for smartwatches",
            "content": "The EUs new interoperability requirements underscore that the best smartwatch shouldnt be dictated by your phone.\r\nThe EUs new interoperability requirements underscore that the best smartwatch should… [+4915 chars]",
            "url": "https://www.theverge.com/news/633765/ios-eu-interoperability-smartwatches-headphones"
        },
        {
            "title": "Dow Jones CEO Almar Latour on AI, press freedom, and the future of news",
            "content": "Today, I’m talking with Almar Latour, who is the publisher of The Wall Street Journal and CEO of its parent company Dow Jones, which you can think of as a huge research and data provider for companie… [+52490 chars]",
            "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/626229/dow-jones-ceo-almar-latour-wsj-interview-ai-journalism"
        },
        {
            "title": "Severance Re-Introduces Us to Its Wider, Weirder World",
            "content": "Up until this point, Severance has been a relatively isolated show. We see the Lumon office, we see some places around the Lumon offices, and that’s really about it (“Woe’s Hollow” aside). That chang… [+9152 chars]",
            "url": "https://gizmodo.com/severance-recap-season-2-episode-8-patricia-arquette-2000572360"
        },
        {
            "title": "The Corvette ZR1’s 233-mph run had to start in a virtual world",
            "content": "The Corvette ZR1s 233-mph run had to start in a virtual world\r\nIt turns out it takes a little Fortran to make a faster Corvette.\r\nThe Corvette ZR1s 233-mph run had to start in a virtual world\r\nIt tur… [+11443 chars]",
            "url": "https://www.theverge.com/chevrolet/624087/chevy-corvette-zr1-speed-record-simulation"
        },
        {
            "title": "Jurassic World: Chaos Theory Is Still the Most Exciting Part of the Franchise",
            "content": "The surviving Nublar Five escape to Europe in the aftermath of finding out their former friend Brooklynn has now joined the bad guys in dealing with even more dinosaur danger in the next chapter of N… [+2488 chars]",
            "url": "https://gizmodo.com/jurassic-world-chaos-theory-is-still-the-most-exciting-part-of-the-franchise-2000575348"
        },
        {
            "title": "Bob Iger Showcases Disneyland Paris’ New Lion King Ride",
            "content": "More key details of the sprawling expansions coming to Disney Parks were unveiled by CEO Bob Iger himself this week, including a look at the Lion King ride for Disneyland Paris. Disney is also busy o… [+5125 chars]",
            "url": "https://gizmodo.com/bob-iger-showcases-disneyland-paris-new-lion-king-ride-2000579328"
        },
        {
            "title": "The Handmaid’s Tale Just Reminded Us There’s a Sequel Series Coming",
            "content": "With The Handmaid’s Tale suddenly rocketing back into pop-culture consciousness due to its upcoming sixth and final seasonand the fact that it’s unfortunately very culturally relevantagainthe Hulu sh… [+2216 chars]",
            "url": "https://gizmodo.com/the-handmaids-tale-just-reminded-us-theres-a-sequel-series-coming-2000570881"
        },
        {
            "title": "Marvel’s Imperial Event Will Change Its Hierarchy of Cosmic Power",
            "content": "Every year, Marvel tends to have a couple of event miniseries that shake things up for every comics character, or just certain characters within their own corner of the universe. While the heroes are… [+1602 chars]",
            "url": "https://gizmodo.com/marvels-imperial-event-will-change-its-hierarchy-of-cosmic-power-2000576568"
        },
        {
            "title": "20 Plagues Y Combinator Unleashed on the World Over the Last 20 Years",
            "content": "Today marks the 20th anniversary of Y Combinator, a startup accelerator that has fostered companies that have changed the world. YC has brought us innovations like making everything an app and horrif… [+11979 chars]",
            "url": "https://gizmodo.com/20-plagues-y-combinator-unleashed-on-the-world-over-the-last-20-years-2000574395"
        },
        {
            "title": "RFK Jr.’s Measles Cure? Cod Liver Oil and a Whole Lot of Other Nonsense",
            "content": "The measles outbreak in Texas is continuing to rage on, and Robert F. Kennedy Jr.the newly enshrined Health and Human Services secretaryis touting scientifically unsupported treatments for it. In a r… [+4340 chars]",
            "url": "https://gizmodo.com/rfk-jr-s-measles-cure-cod-liver-oil-and-a-whole-lot-of-other-nonsense-2000574321"
        },
        {
            "title": "Florida Opens Criminal Investigation Into Andrew Tate and His Brother",
            "content": "Florida has launched an investigation into misogyny influencer Andrew Tate and his brother Tristan just days after the pair arrived in the United States. The Tate brothers have dual U.S. and British … [+4315 chars]",
            "url": "https://gizmodo.com/florida-opens-criminal-investigation-into-andrew-tate-and-his-brother-2000572004"
        },
        {
            "title": "Universal Just Gave Us Our First Look Inside Epic Universe",
            "content": "Take a look at the nearly completed worlds at Epic Universe that will transport theme park guests into their favorite adventures within the realms of Nintendo, Universal Monsters, Harry Potter, and H… [+2306 chars]",
            "url": "https://gizmodo.com/universal-just-gave-us-our-first-look-inside-epic-universe-2000576943"
        },
        {
            "title": "'The wrestling stereotype is changing – I'm the proof'",
            "content": "Zoe Dennis\r\nAnnabelle says her wrestling style has been adapted to use her body weight against opponents during moves\r\nThe teenage Bellatrix European champion might not look like a traditional profes… [+4151 chars]",
            "url": "https://www.bbc.com/news/articles/cd646zq53yyo"
        },
        {
            "title": "Starmer praised for statesman role abroad but can he turn things round at home?",
            "content": "\"Trump may be the best thing to happen to Starmer,\" says a diplomat, suggesting the brash property tycoon busy upending the world order might be just what the strait-laced prime minister - who's been… [+9733 chars]",
            "url": "https://www.bbc.com/news/articles/cyvend06zmlo"
        },
        {
            "title": "Some nice upgrades for Apple’s best gadgets",
            "content": "Plus, in this weeks Installer: a fantastic new co-op game, a new Daredevil show, a Twitter doc, Digg, and much more.\r\nPlus, in this weeks Installer: a fantastic new co-op game, a new Daredevil show, … [+10864 chars]",
            "url": "https://www.theverge.com/installer-newsletter/626239/apple-ipad-macbook-air-split-fiction-digg-installer"
        },
        {
            "title": "Watch: 'Unpleasant to see' - Ukrainians react to spat",
            "content": "Ukrainians have reacted to a clash between President Volodymyr Zelensky, US President Donald Trump and Vice-president JD Vance in the Oval Office.\r\nDuring the fiery exchange, the US president accused… [+194 chars]",
            "url": "https://www.bbc.com/news/videos/cqly6ydypzro"
        },
        {
            "title": "The fake promise of better Siri",
            "content": "On The Vergecast: AI gadget failures, how Tesla became politics, and Sonoss TV dreams.\r\nOn The Vergecast: AI gadget failures, how Tesla became politics, and Sonoss TV dreams.\r\nApple Intelligence is t… [+2130 chars]",
            "url": "https://www.theverge.com/the-vergecast/629652/siri-delay-bad-apple-tesla-trump-vergecast"
        },
        {
            "title": "Lego’s Official Bluey Sets Are Here, for Real Life",
            "content": "The Bluey Lego sets have finally been revealed for real life! The setsaimed at the younger Lego demographic, but Bluey fans come in all ageswill take kids and collectors through some of the most icon… [+1968 chars]",
            "url": "https://gizmodo.com/legos-official-bluey-sets-are-here-for-real-life-2000570841"
        },
        {
            "title": "Percy Jackson is Already Fated For a Third Season",
            "content": "Good news, fans of Percy Jackson &amp; the Olympians: the show’s got a green light for a third season.\r\nDisney announced the renewal on Friday, which comes well ahead of the show’s second season, whi… [+1413 chars]",
            "url": "https://gizmodo.com/percy-jackson-is-already-fated-for-a-third-season-2000576558"
        },
        {
            "title": "The Quantum Apocalypse Is Coming. Be Very Afraid",
            "content": "One day soon, at a research lab near Santa Barbara or Seattle or a secret facility in the Chinese mountains, it will begin: the sudden unlocking of the worlds secrets. Your secrets.\r\nCybersecurity an… [+3447 chars]",
            "url": "https://www.wired.com/story/q-day-apocalypse-quantum-computers-encryption/"
        },
        {
            "title": "Stephen King’s Cujo Gets an Unexpected Yet Exciting Director",
            "content": "Cujo is chomping his way back to the movies and his new owner is someone very good at terrifying you. Darren Aronofsky, the director of Requiem for a Dream, The Wrestler, Black Swan, mother!, and The… [+2145 chars]",
            "url": "https://gizmodo.com/stephen-kings-cujo-gets-an-unexpected-yet-exciting-director-2000577510"
        },
        {
            "title": "Italian Newspaper Creates Entirely AI-Generated Edition",
            "content": "An Italian newspaper says it has created the world’s first issue generated entirely using AI, with journalists limited to asking questions of a chatbot and reading the answers before inserting them. … [+3055 chars]",
            "url": "https://gizmodo.com/italian-newspaper-creates-entirely-ai-generated-edition-2000577463"
        },
        {
            "title": "A Fifth John Wick Will Happen, Come Hell or High Water",
            "content": "Gemma Chan is keeping the faith for an Eternals 2. Netflix wants to be the latest to take on Stephen King’s Cujo. Plus, Final Destination: Bloodlines prepares for a long time with its grisly accident… [+3215 chars]",
            "url": "https://gizmodo.com/john-wick-5-keanu-reeves-lionsgate-2000574765"
        },
        {
            "title": "Intel Delays Ohio Semiconductor Factory to 2030, Maybe 2031",
            "content": "There has been little good news to come out of Intel in recent memory, and now the storied chipmaker has announced it will postpone the opening of a new Ohio semiconductor factory that was originally… [+3097 chars]",
            "url": "https://gizmodo.com/intel-delays-ohio-semiconductor-factory-to-2030-maybe-2031-2000570189"
        },
        {
            "title": "The Mandalorian and Grogu Ride Will Open Alongside the Movie",
            "content": "During its SXSW panel on “The Future of Worldbuilding,” Disney unveiled a new look at its upcoming theme park ride focused on the Mandalorian and Grogu, which releases on May 22, 2026the same day the… [+1772 chars]",
            "url": "https://gizmodo.com/mandalorian-grogu-galaxys-edge-mission-2000573522"
        },
        {
            "title": "Check Out Stunning Images of the Scientifically Plausible Alien Planet From Ash",
            "content": "If you’re going to set a sci-fi movie on an alien planet, it’s a nice bonus if that planet actually exists. Or, at least, is inspired by one that actually exists. In the new film Ash, director Flying… [+1890 chars]",
            "url": "https://gizmodo.com/ash-movie-planet-elza-gonzalez-aaron-paul-2000572816"
        },
        {
            "title": "Former F1 boss and TV pundit Jordan dies aged 76",
            "content": "Eddie Jordan, the flamboyant former Formula 1 team owner and television pundit, has died aged 76.\r\nThe Irishman, who had aggressive prostate cancer, died in the early hours of Thursday morning.\r\nA st… [+1564 chars]",
            "url": "https://www.bbc.com/sport/formula1/articles/cq8y1335qlwo"
        },
        {
            "title": "Power Rangers Will Live Once More, This Time on Disney+",
            "content": "The Power Rangers are ready to rise again. After multiple attempts to bring back the popular franchise over the past few years, Hasbro just struck a deal with Disney+ to make a new live-action versio… [+1880 chars]",
            "url": "https://gizmodo.com/power-rangers-reboot-disney-plus-percy-jackson-2000578187"
        },
        {
            "title": "Indiana Jones and the Great Circle Will Bring Its Nazi-Punching to PS5 Very Soon",
            "content": "I’ve been waiting to punch Nazis for what feels like forever and today, I found out I’ll get to do it very, very soon. Indiana Jones and the Great Circle was released exclusively for PC and Xbox late… [+2069 chars]",
            "url": "https://gizmodo.com/indiana-jones-game-ps5-release-date-great-circle-2000579827"
        },
        {
            "title": "George Lowe, Star of Adult Swim’s Space Ghost, Has Died",
            "content": "George Lowe, a comedian and voice actor best known for his role as Space Ghost in the Adult Swim animated talk show series Space Ghost Coast to Coast, has died at 67.\r\nNews of Lowe’s passing was firs… [+2245 chars]",
            "url": "https://gizmodo.com/george-lowe-star-of-adult-swims-space-ghost-has-died-2000571346"
        },
        {
            "title": "News Weekly: MWC wrap up, Nothing Phone 3a series launch, One UI 7 delays, and more",
            "content": "(Image credit: Android Central)\r\nNews Weekly is our column where we highlight and summarize some of the week's top stories so you can catch up on the latest tech news.\r\nThis is Android Central's News… [+6315 chars]",
            "url": "https://www.androidcentral.com/phones/news-weekly-march-8-2025"
        },
        {
            "title": "News Weekly: Massive Pixel 10 leak, March update chaos, OnePlus ditching its Alert Slider, and more",
            "content": "(Image credit: Android Central)\r\nNews Weekly is our column where we highlight and summarize some of the week's top stories so you can catch up on the latest tech news.\r\nThis is Android Central's News… [+6025 chars]",
            "url": "https://www.androidcentral.com/apps-software/news-weekly-march-15-2025"
        },
        {
            "title": "Saw XI Has Reportedly Been Cancelled",
            "content": "When Saw X hit theaters in 2023, it was actually a refreshing departure for the James Wan and Leigh Whannell-created series: rather than propelling things forward, it was an “interquel” set between t… [+1708 chars]",
            "url": "https://gizmodo.com/saw-xi-cancelled-rumor-report-lionsgate-2000577061"
        },
        {
            "title": "Viz is Making Black Torch Into an Anime",
            "content": "Another shonen manga has been deemed worthy to become an animebut this one’s different from the rest.\r\nDuring its Emerald City Comic-Con panel, Viz Media announced an adaptation of Tsuyoshi Takaki’s … [+1471 chars]",
            "url": "https://gizmodo.com/viz-is-making-black-torch-into-an-anime-2000573612"
        },
        {
            "title": "DC’s Latest Celebrity Comics Cameo Will Take You to Flavortown",
            "content": "Saving the world on a regular basis would make anyone work up quite the appetiteso it’s a good thing that Batman and Superman are now buddies with celebrity chef Guy Fieri, known for his popular Food… [+1510 chars]",
            "url": "https://gizmodo.com/dcs-latest-celebrity-comics-cameo-will-take-you-to-flavortown-2000577464"
        },
        {
            "title": "Disneyland and Disney World: First Look at Avengers Rides, Monsters Coaster, Cars Rally Race",
            "content": "As Walt Disney once predicted, Disneyland will \"never be completed.\" It will continue growing \"as long as there is imagination left in the world.\" Disney's original theme park in Anaheim, California,… [+14017 chars]",
            "url": "https://www.cnet.com/tech/services-and-software/disneyland-and-disney-world-first-look-at-avengers-rides-monsters-coaster-cars-rally-race/"
        },
        {
            "title": "Yahoo Is Still Here—and It Has Big Plans for AI",
            "content": "In September 2021, Jim Lanzone took over a company whose name once embodied the go-go spirit of the internet but had, over the years, become a joke: Yahoo. He accepted the CEO post from the new priva… [+4722 chars]",
            "url": "https://www.wired.com/story/plaintext-yahoo-turns-30-jim-lanzone/"
        },
        {
            "title": "Sadie Sink Teases Her Mystery Marvel Role",
            "content": "The cast of Spider-Man Noir continues to grow. Jenna Ortega teases some wild moments in Wednesday season 2. Plus, there’s already good news for Amazon’s God of War adaptation. To me, my spoilers!\r\nSp… [+3310 chars]",
            "url": "https://gizmodo.com/sadie-sink-spider-man-4-role-marvel-mcu-2000577307"
        },
        {
            "title": "Musk Plans to Give Trump Groups $100 Million After Tesla Ad at the White House",
            "content": "Elon Musk is planning to give $100 million to two political groups associated with President Donald Trump, according to a report from the New York Times. The move is unprecedented in American politic… [+5302 chars]",
            "url": "https://gizmodo.com/musk-plans-to-give-trump-groups-100-million-after-tesla-ad-at-the-white-house-2000575040"
        },
        {
            "title": "Disney’s Next Legacy Lightsaber Sends Mara Jade to Galaxy’s Edge",
            "content": "Although Mara Jade herself has managed to spend the best part of the last decade not making the leap from Star Wars‘ former expanded universe and into current continuity, it’s not stopped her from be… [+2679 chars]",
            "url": "https://gizmodo.com/star-wars-galaxys-edge-mara-jade-lightsaber-price-release-date-2000573147"
        },
        {
            "title": "Pebble’s Successor Has Me Stoked for the Return of the Simple Smartwatch",
            "content": "The dream of the cool-but-not-overly-garish smartwatch is alive and well with not-Pebble’s new smartwatches, the Core 2 Duo and the Core Time 2. Pebble, known by diehard nerds for making one of the g… [+3571 chars]",
            "url": "https://gizmodo.com/pebbles-successor-has-me-stoked-for-the-return-of-the-simple-smartwatch-2000577589"
        },
        {
            "title": "Will TSMC escape tariffs with pledge for $100B in U.S. chip manufacturing plants?",
            "content": "Its been a whirlwind of news on the tariff front and Taiwan has avoided tariffs for now. But the timing of a $100 billion commitment by TSMC to build chip manufacturing plants in the U.S. may have he… [+3264 chars]",
            "url": "https://venturebeat.com/business/will-tsmc-escape-tariffs-with-pledge-for-100b-in-u-s-chip-manufacturing-plants/"
        },
        {
            "title": "BBC & ITV agree new four-year Six Nations rights deal",
            "content": "BBC Sport and ITV have agreed a new four-year deal for the live free-to-air rights for the Men's Six Nations to 2029.\r\nThe BBC will provide live TV coverage, TV highlights and digital clips of the ch… [+2087 chars]",
            "url": "https://www.bbc.com/sport/rugby-union/articles/c0kg15j0kl6o"
        },
        {
            "title": "Does the World Even Want Digg in 2025?",
            "content": "Digg is coming back, and Im left wondering if anyone will care.\r\nTo a certain kind of elder millennial who has spent the last few decades online, news of a return of Digg will trigger a nostalgic fug… [+4888 chars]",
            "url": "https://gizmodo.com/does-the-world-even-want-digg-in-2025-2000572119"
        },
        {
            "title": "News Weekly: Pixel 9a is here, EU Commission gives Google heat, One UI 7 gets a launch date, and more",
            "content": "(Image credit: Android Central)\r\nNews Weekly is our column where we highlight and summarize some of the week's top stories so you can catch up on the latest tech news.\r\nThis is Android Central's News… [+6539 chars]",
            "url": "https://www.androidcentral.com/phones/google-pixel/news-weekly-march-22-2025"
        },
        {
            "title": "Severance‘s Creator Answers Our Burning Questions After the Season 2 Finale",
            "content": "And now we wait. Season two of Severance just ended, leaving us with more answers than we expected but also new questions we never even fathomed. You can read our full breakdown here [TK LINK] but, i… [+8457 chars]",
            "url": "https://gizmodo.com/severance-season-2-finale-spoilers-interview-dan-erickson-2000578450"
        },
        {
            "title": "Vin Diesel Claims Marvel Wants to Make a Groot Movie",
            "content": "Vin Diesel had much more to say besides “I am Groot” on his Instagram Tuesday. The star of The Fast and the Furious franchise took to the social media platform to tease a slew of upcoming projects wi… [+2568 chars]",
            "url": "https://gizmodo.com/vin-diesel-groot-movie-guardians-of-the-galaxy-marvel-2000571446"
        },
        {
            "title": "Shein and Temu got a taste of what it could be like once de minimis is gone for good",
            "content": "Temu experienced sales volatility in the wake of de minimis deliberation and tariff talk.NurPhoto/Getty Images\r\n<ul><li>Sales for Shein and Temu slowed after Trump announced tariffs and de minimis ch… [+3057 chars]",
            "url": "https://www.businessinsider.com/trump-tariffs-impact-shein-temu-sales-de-minimis-uncertainty-2025-3"
        },
        {
            "title": "News Weekly: Pixel Watch 3 feature gets nod from FDA, Slack's massive outage, some Android phones get insane updates, and more",
            "content": "(Image credit: Android Central)\r\nNews Weekly is our column where we highlight and summarize some of the week's top stories so you can catch up on the latest tech news.\r\nThis is Android Central's News… [+6661 chars]",
            "url": "https://www.androidcentral.com/wearables/news-weekly-march-1-2025"
        },
        {
            "title": "YouTube’s Ad-Free Premium Plans Just Got a Cheaper Tier",
            "content": "YouTube announced it’s expanding its Premium subscription plan to viewers in the U.S. The new $8 a month YouTube Premium Lite plan joins the regular $14 a month Premium plan. The subscription plan le… [+1947 chars]",
            "url": "https://gizmodo.com/youtubes-ad-free-premium-plans-just-got-a-cheaper-tier-2000572052"
        },
        {
            "title": "Somehow, David Arquette Will Return for the Increasingly Meta Scream 7",
            "content": "Just when you thought Kevin Williamson couldn’t out-Kevin Williamson himself, he’s doing just that. The original Scream writer, who’s returning to helm its upcoming seventh installment, has added the… [+1878 chars]",
            "url": "https://gizmodo.com/somehow-david-arquette-will-return-for-the-increasingly-meta-scream-7-2000571685"
        },
        {
            "title": "The Wheel of Time‘s Dónal Finn on Learning to Speak the ‘Old Tongue’",
            "content": "If your story’s taking place in a fantasy realm, chances are there are going to be some made-up fantasy languages in the mix. Think Elvish in Lord of the Rings, or High Valyrian in Game of Thronesimp… [+2063 chars]",
            "url": "https://gizmodo.com/wheel-of-time-season-3-donal-finn-old-tongue-prime-video-2000570820"
        },
        {
            "title": "Power Rangers May Get an AI-Boosted Remaster",
            "content": "As the world waits to see what’s next for Power Rangers, the superhero franchise may return to its past with the help of generative AI.\r\nDuring this weekend’s New York Toy Fair, attendees learned Pla… [+2001 chars]",
            "url": "https://gizmodo.com/power-rangers-may-get-an-ai-boosted-remaster-2000570522"
        },
        {
            "title": "The Book Behind Edge of Tomorrow Is Being Turned Into a Stunning-Looking Anime",
            "content": "Yesterday, Warner Bros. Japan announced an anime film adaptation for All You Need Is Kill, the sci-fi light novel that inspired the 2014 Hollywood film, Edge of Tomorrow, starring Tom Cruise and Emil… [+2393 chars]",
            "url": "https://gizmodo.com/all-you-need-is-kill-anime-movie-trailer-edge-of-tomorrow-warner-bros-2000575528"
        },
        {
            "title": "Stream Without Borders – Unblock Global Entertainment With This Cheap VPN",
            "content": "Whenever we discuss streaming services, we can’t find a person who doesn’t have at least one subscription. However, as much as these services are awesome, they have one annoying aspect they’re usuall… [+2378 chars]",
            "url": "https://gizmodo.com/stream-without-borders-unblock-global-entertainment-with-this-cheap-vpn-2000571791"
        },
        {
            "title": "Lego Pokémon Is Finally Real and Coming Next Year",
            "content": "Pokémon and Lego officially announced their first-ever collab, which will release sometime in 2026.\r\nEarlier today, the announcement leaked on the Lego Mexico Facebook page, which posted a short vide… [+2066 chars]",
            "url": "https://gizmodo.com/lego-pokemon-is-finally-real-and-coming-next-year-2000577396"
        },
        {
            "title": "Blade Runner 2099‘s Tom Burke Teases the Show’s Aesthetics and Themes",
            "content": "Prime Video series Blade Runner 2099 was announced in 2022, delayed in 2023 as part of the Hollywood strikes, and cast Hunter Schaefer and Michelle Yeoh as co-leads in 2024. It’s been a long road, in… [+1961 chars]",
            "url": "https://gizmodo.com/blade-runner-2099-tv-show-visuals-amazon-2000572072"
        },
        {
            "title": "Ballerina‘s New Trailer Teases a John Wick Showdown for the Ages",
            "content": "Lionsgate has released a new trailer for the John Wick spin-off movie with too many SEO-centric words stuffed in its title, From the World of John Wick: Ballerina, starring Ana de Armas. Long-ass nam… [+2177 chars]",
            "url": "https://gizmodo.com/john-wick-ballerina-trailer-ana-de-armas-keanu-reeves-2-2000578077"
        },
        {
            "title": "Russell T Davies Has Started Thinking About His Doctor Who Successor",
            "content": "Ncuti Gatwa’s second season as the Fifteenth Doctor gets underway April 12, but Doctor Who showrunner Russell T Davies has already started to think beyond that. And this time, it’s in refreshing cont… [+2103 chars]",
            "url": "https://gizmodo.com/russell-t-davies-has-started-thinking-about-his-doctor-who-successor-2000575339"
        },
        {
            "title": "WATCH: Identical twin brothers take on ballet world",
            "content": "<ul><li>'Nazis got better treatment,' judge says of Trump administration's deportations\r\n</li><li>IRS close to finalizing data-sharing agreement with ICE, sources say\r\n</li><li>Louisiana redistrictin… [+4265 chars]",
            "url": "https://abcnews.go.com/GMA/GMA3/video/naazir-and-shaakir-muhammad-reflect-on-professional-ballet-career-while-breaking-down-stereotypes-along-the-way-119991575"
        },
        {
            "title": "Trump’s Defense Secretary Accidentally Texted Yemen War Plans to the Head Editor of The Atlantic",
            "content": "Journalists often dream of finding the right government leaker who can share with them detailed information about the internal workings of the federal government. Few journalists would presume, howev… [+5049 chars]",
            "url": "https://gizmodo.com/trumps-defense-secretary-accidentally-texted-yemen-war-plans-to-the-head-editor-of-the-atlantic-2000579924"
        },
        {
            "title": "CBS Warns That FCC Action On ’60 Minutes’ Complaint Would Create “A Less Free World” Where Government Becomes “A Roving Censor”",
            "content": "CBS is calling out the FCCs inquiry into how 60 Minutes edited an interview with Kamala Harris as inappropriate for the federal agency, while warning that any government sanction against the network … [+4688 chars]",
            "url": "https://deadline.com/2025/03/trump-60-minutes-cbs-fcc-1236320668/"
        },
        {
            "title": "Fox News AI Newsletter: Helping DOGE cut waste",
            "content": "Welcome to Fox News Artificial Intelligence newsletter with the latest AI technology advancements.\r\nIN TODAYS NEWSLETTER:\r\n- How AI can help Trump and DOGE cut waste, CEO explains- Taco Bell shows of… [+1415 chars]",
            "url": "https://www.foxnews.com/tech/fox-news-ai-newsletter-helping-doge-cut-waste"
        },
        {
            "title": "Iron Man’s Death Will Connect to Robert Downey Jr.’s Doom In Avengers: Doomsday",
            "content": "Amber Midthunder isn’t sure if she’ll return to the Predator franchise any time soon. Sarah Michelle Gellar discusses how quickly the Buffy revival is coming together. Plus, get another new look at T… [+4512 chars]",
            "url": "https://gizmodo.com/avengers-doomsday-tony-stark-death-doctor-doom-robert-downey-jr-2000576673"
        },
        {
            "title": "Players tend to like games that give them rewards, Almedia study shows",
            "content": "Players who receive rewards for playing or downloading a game tend to feel more positively towards the game and are more likely to recommend it, according to a study conducted by user acquisition com… [+3041 chars]",
            "url": "https://venturebeat.com/games/players-tend-to-like-games-that-give-them-rewards-almedia-study-shows/"
        },
        {
            "title": "Judge declines to lift ban on Trump deportations under wartime powers",
            "content": "Madeline Halpert\r\nA US federal judge has refused to lift a temporary restraining order blocking the deportation of Venezuelan migrants under President Donald Trump's invocation of wartime powers.\r\nOn… [+2994 chars]",
            "url": "https://www.bbc.com/news/articles/cp3y03l1gvko"
        },
        {
            "title": "Rosenberg: Trump-Putin call seen as victory in Russia",
            "content": "Judging by some of the headlines today in Russia, Moscow believes that the latest telephone conversation between Presidents Putin and Trump went well - certainly for the Kremlin.\r\n\"Putin and Trump ag… [+3290 chars]",
            "url": "https://www.bbc.com/news/articles/cjevg23enggo"
        },
        {
            "title": "Chris Mason: Colossal stakes for UK summit on Ukraine",
            "content": "In the immediate hours after those astonishing exchanges between Presidents Donald Trump and Volodymyr Zelensky in the White House, European leaders, one after another, offered their public support f… [+3190 chars]",
            "url": "https://www.bbc.com/news/articles/cj6787zzg79o"
        },
        {
            "title": "Check out how to watch the Future Games Show 2025 Spring Showcase",
            "content": "What you need to know\r\n<ul><li>The Future Games Show Spring Showcase is coming up on March 20 at 4 pm ET/ 1 pm ET.</li><li>The company states its showcase will include a slew of world premier trailer… [+2710 chars]",
            "url": "https://www.androidcentral.com/gaming/how-to-watch-future-games-show-spring-showcase-2025"
        },
        {
            "title": "Conspiracy Theorists Think Mark Zuckerberg Started Myrtle Beach Wildfires",
            "content": "At least 175 wildfires have been burning in the Carolinas since this past weekend, with one fire near Myrtle Beach, South Carolina, burning about 1,600 acres and forcing residents to evacuate, accord… [+4402 chars]",
            "url": "https://gizmodo.com/conspiracy-theorists-think-mark-zuckerberg-started-myrtle-beach-wildfires-2000570780"
        },
        {
            "title": "What we know about Paradise season 2",
            "content": "Just days before Paradise’s big season 1 finale, Hulu announced that the hit sci-fi thriller had officially been greenlighted for a second season. The news was a relief to writer John Hoberg, who spo… [+6601 chars]",
            "url": "https://www.polygon.com/news/534196/paradise-season-2-premiere-date-cast-story-details"
        },
        {
            "title": "My baby's premature birth was humbling, says Beatrice",
            "content": "Princess Beatrice has described the premature birth of her daughter as \"humbling\". \r\nHer daughter Athena Elizabeth Rose was born several weeks premature at London's Chelsea and Westminster Hospital o… [+2405 chars]",
            "url": "https://www.bbc.com/news/articles/ckgd74zl2xpo"
        },
        {
            "title": "Trump’s AG Claims She Will Release More Epstein Docs, but They May Be Redacted for National Security",
            "content": "MAGA-world was perturbed last week when President Trump’s new attorney general, Pam Bondi, claimed to have finally shed light on the mysterious case of Jeffrey Epstein but, instead, released a bunch … [+6467 chars]",
            "url": "https://gizmodo.com/trumps-ag-claims-she-will-release-more-epstein-docs-but-they-may-be-redacted-for-national-security-2000571431"
        },
        {
            "title": "World's largest iceberg runs aground off remote island",
            "content": "Georgina RannardClimate and science reporter\r\nErwan Rivault\r\nThe world's largest iceberg has run aground in shallow waters off the remote British island of South Georgia, home to millions of penguins… [+5261 chars]",
            "url": "https://www.bbc.com/news/articles/c20d1xp6046o"
        },
        {
            "title": "Google takes home 'Smartphone of the Year' award at MWC for the second straight year",
            "content": "What you need to know\r\n<ul><li>Google secured two of GLOMO's most desirable awards at MWC Barcelona in the Device category.</li><li>Google's Pixel 9 Pro won the \"Smartphone of the Year\" award, markin… [+2339 chars]",
            "url": "https://www.androidcentral.com/phones/google-takes-home-smartphone-of-the-year-at-mwc-for-the-second-straight-year"
        },
        {
            "title": "Netflix makes its case for gaming on its massive platform",
            "content": "Netflix made its case for creating and publishing games on its massive streaming platform for all the world to engage with.\r\nSpeaking at a side event at the Game Developers Conference, Alain Tascan, … [+4126 chars]",
            "url": "https://venturebeat.com/games/netflix-makes-its-case-for-gaming-on-its-massive-platform/"
        },
        {
            "title": "Handmaid’s Tale‘s First Season Still Feels Uncomfortably Timely in 2025",
            "content": "The sixth season of Hulu’s The Handmaid’s Tale arrives in April, bringing its run to an end while also presumably setting up sequel series The Testaments, itself coming to Hulu soon. For all the show… [+6446 chars]",
            "url": "https://gizmodo.com/handmaids-tale-season-1-2025-politics-trump-2000578392"
        },
        {
            "title": "8 TV Shows and Movies to Watch After You Finish Severance",
            "content": "The Severance season two finale is this week, making this both a thrilling and devastating moment for its devoted fans. Finally, some answers (maybe?) about all those lingering mysteries! But also, t… [+5922 chars]",
            "url": "https://gizmodo.com/what-to-watch-if-you-like-severance-streaming-2000577595"
        },
        {
            "title": "Severance Season 3 Might Be Something Totally Different, but Probably Not",
            "content": "We’re talking a lot about Severance today and for good reason. The second season just wrapped up with a banger of a finale, an event that itself was almost three years in the making. Plus, a third se… [+2537 chars]",
            "url": "https://gizmodo.com/severance-season-3-plot-lumon-dan-erickson-2000579335"
        },
        {
            "title": "James Gunn Throws Water Over Those Wild Clayface Casting Rumors",
            "content": "Patrick Dempsey isn’t among Scream 7‘s many returning faces. Jessica Lange has a firm answer on if she’d ever return for American Horror Story. Plus, what’s coming on Ghosts and Yellowjackets. Spoile… [+3282 chars]",
            "url": "https://gizmodo.com/clayface-daniel-radcliffe-rumors-james-gunn-dc-warner-bros-2000570625"
        },
        {
            "title": "Nacelle’s New Star Trek Figures Are Perfectly Accessorized",
            "content": "As io9 has pointed out previously, Star Trek is not your typical sci-fi franchise when it comes to toys. There have been some very weird releases over the years, made even more notable by the fact th… [+3420 chars]",
            "url": "https://gizmodo.com/nacelles-new-star-trek-figures-are-perfectly-accessorized-2000571496"
        },
        {
            "title": "Crypto Soars Then Plunges Following Trump’s Post About a Strategic Reserve",
            "content": "Donald Trumps touch is poison. On Sunday morning the President took to Truth Social to juice the numbers of the cryptocurrencies XRP, SOL, and ADA. He said theyd be part of the forthcoming U.S. Crypt… [+2981 chars]",
            "url": "https://gizmodo.com/crypto-soars-then-plunges-following-trumps-post-about-a-strategic-reserve-2000570740"
        },
        {
            "title": "Patricia Arquette Breaks Down Severance‘s Latest Bombshell",
            "content": "If you’ve seen the latest episode of Severance, you know it ends with another huge revelationone that we won’t spoil here at the top in case you haven’t seen it yet. But it involves Harmony Cobel, pl… [+3173 chars]",
            "url": "https://gizmodo.com/patricia-arquette-severance-twist-apple-tv-plus-2000573250"
        },
        {
            "title": "Andor Season 2 Will Explore Luthen’s Past and the Future of His Rebellion",
            "content": "One of the most exciting characters we’re eager to see more of in season two of Andor on Disney+ is Stellan Skarsgård’s Luthen Rael, the rebellion’s main orchestrator. As the Empire has tried to unco… [+2711 chars]",
            "url": "https://gizmodo.com/andor-season-2-will-explore-luthens-past-and-the-future-of-his-rebellion-2000575895"
        },
        {
            "title": "The Electric State‘s First Week on Netflix Doesn’t Bode Well",
            "content": "There aren’t many scenarios when 25 million people viewing something can be seen as a bad thing, but there aren’t many $300 million movies that don’t have paying customers either. In both cases thoug… [+2693 chars]",
            "url": "https://gizmodo.com/the-electric-states-first-week-on-netflix-doesnt-bode-well-2000577706"
        },
        {
            "title": "Blox Fruits codes for March 2025",
            "content": "Blox Fruits is a Roblox game inspired by the hit anime and manga series One Piece.\n\nIn this world, you can play as either a pirate or a marine and assemble your own crew of scallywags or do-gooders. … [+2415 chars]",
            "url": "https://www.polygon.com/guides/538890/blox-fruits-codes-list-all-redeem-how-to"
        },
        {
            "title": "How to get pets for your Hideout in Assassin’s Creed Shadows",
            "content": "Good news: You can pet the dog in Assassin’s Creed Shadows. When you pet an animal, you’re rewarded with a really cute cinematic — apparently, even strange cats are ready to leap into Naoe’s hands fo… [+2941 chars]",
            "url": "https://www.polygon.com/assassins-creed-shadows-guides/543533/pets-cats-dogs-how-to-get"
        },
        {
            "title": "Outraged fans call out Coca-Cola after noticing glaring issue with new ad: 'How ... lazy can one of the biggest companies in the world be?'",
            "content": "Eagle-eyed consumers are criticizing the world's largest beverage company after spotting an error in a new advertisement generated by artificial intelligence.\r\nA Reddit user posted a screenshot of th… [+2614 chars]",
            "url": "https://www.yahoo.com/lifestyle/outraged-fans-call-coca-cola-110011983.html"
        },
        {
            "title": "1 in 5 People Say Climate Change Has Had a Big Impact on Their Daily Lives",
            "content": "From December 2024 to February 2025, the effects of human-induced climate change were evident in nearly all regions of the world, new analysis from Climate Central has found. \r\nThe report, which exam… [+2947 chars]",
            "url": "https://time.com/7269229/climate-change-impact-daily-life-analysis/"
        },
        {
            "title": "#TheAndroidShow: Multimodal for Gemini in Android Studio, news for gaming devs, the latest devices at MWC, XR and more!",
            "content": "Posted by Anirudh Dewani – Director, Android Developer Relations\n\n\n\nWe just dropped our Winter episode of #TheAndroidShow, on YouTube and on developer.android.com, and this time we were in Barcelona … [+4071 chars]",
            "url": "https://android-developers.googleblog.com/2025/03/winter-episode-theandroidshow.html"
        },
        {
            "title": "Infinix unveils its first-ever tri-fold concept phone",
            "content": "What you need to know\r\n<ul><li>Infinix enters the tri-fold segment with the Zero Mini Tri-Fold, featuring dual vertical hinges for a three-way fold.</li><li>The concept's outward-folding design lets … [+2025 chars]",
            "url": "https://www.androidcentral.com/phones/infinix-unveils-its-first-ever-tri-fold-concept-phone"
        },
        {
            "title": "Google is updating Chrome for Android to fill more of your screen",
            "content": "What you need to know\r\n<ul><li>Chrome for Android now stretches content right to the edges, even under the status and navigation bars.</li><li>It hides when you scroll, giving you more room for conte… [+2241 chars]",
            "url": "https://www.androidcentral.com/apps-software/google-is-updating-chrome-for-android-to-fill-more-of-your-screen"
        },
        {
            "title": "The most innovative companies in media and news for 2025",
            "content": "As the hollowing-out of newsrooms across the country continues, some media outlets have stood apart by doubling down on serving their communities. Last August, the countrys eighth-leading daily newsp… [+18211 chars]",
            "url": "https://www.fastcompany.com/91269631/media-news-most-innovative-companies-2025"
        },
        {
            "title": "Unexploded WWII bomb in Paris halts Eurostar travel to London, trains across France",
            "content": "LONDON -- Eurostar trains to London, including all trains heading to northern France, stopped abruptly on Friday morning after an unexploded bomb dating back to World War II was discovered near the t… [+1321 chars]",
            "url": "https://abcnews.go.com/International/unexploded-wwii-bomb-paris-halts-eurostar-travel-london/story?id=119542006"
        },
        {
            "title": "Kuo: Cook Should Personally Address Siri Apple Intelligence Failure",
            "content": "Apple made a major misstep with the way that it handled the delay of Apple Intelligence features for Siri, Apple analyst Ming-Chi Kuosaid today. Announcing the delay through a press statement was a b… [+2240 chars]",
            "url": "https://www.macrumors.com/2025/03/13/kuo-tim-cook-siri-apple-failure/"
        },
        {
            "title": "Fans Celebrate Surprise Lego Pokémon Tease: 'Free From Mega Bloks Hell'",
            "content": "Lego has teased its latest video game mashup and this time its with Pokémon. Theres no release date beyond 2026, no pricing info or other details at the moment, and it doesnt really matter because wh… [+1951 chars]",
            "url": "https://kotaku.com/lego-pokemon-pikachu-date-price-mega-bloks-teaser-1851770713"
        },
        {
            "title": "20 Questions We Have After Severance Season 2",
            "content": "Everyone has now had a few days to sit with “Cold Harbor,” the hugely consequential season two finale of Apple TV+’s Severance. And that break is necessary because, wow. On a show known for blowing o… [+12731 chars]",
            "url": "https://gizmodo.com/severance-season-2-spoilers-burning-questions-apple-2000577845"
        },
        {
            "title": "Google TV survey previews how Gemini Live is coming to the big screens",
            "content": "What you need to know\r\n<ul><li>Google is planning to upgrade Google TV with AI features, including News Brief and Gemini Live.</li><li>The company sent out a survey to Google TV Advisors that tests o… [+4528 chars]",
            "url": "https://www.androidcentral.com/streaming-tv/google-tv-survey-previews-how-gemini-live-is-coming-to-the-big-screens"
        },
        {
            "title": "How JD Vance sees the world - and why that matters",
            "content": "Mike Wendling\r\nAn argument in the White House tore apart the US alliance with Ukraine, shook European leaders and highlighted JD Vance's key role in forcefully expressing Donald Trump's foreign polic… [+11634 chars]",
            "url": "https://www.bbc.com/news/articles/cly82yx09zeo"
        },
        {
            "title": "Inside the high-wire business of MrBeast",
            "content": "Leaked plans reveal the ambitions and risk appetite of the biggest YouTuber on earth.\r\nLeaked plans reveal the ambitions and risk appetite of the biggest YouTuber on earth.\r\nThe biggest YouTuber in t… [+6207 chars]",
            "url": "https://www.theverge.com/command-line-newsletter/626330/mrbeast-business-youtube-feastables-fundraising"
        },
        {
            "title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies",
            "content": "The Trump administrations Federal Trade Commission has removed four years worth of business guidance blogs as of Tuesday morning, including important consumer protection information related to artifi… [+4436 chars]",
            "url": "https://www.wired.com/story/federal-trade-commission-removed-blogs-critical-of-ai-amazon-microsoft/"
        },
        {
            "title": "1Password Coupon: Get Up to 50% Off in March",
            "content": "1Password has long been one of our favorite password managers. It's our upgrade pick for all the extra features it offers compared to other password managers. 1Password has apps that work just about … [+2187 chars]",
            "url": "https://www.wired.com/story/1password-coupon/"
        },
        {
            "title": "Deal to buy Prince Andrew's business unravels",
            "content": "Sean Coughlan\r\nBen King\r\nPrince Andrew has been under pressure to find funding for his home in Windsor\r\nA deal to take over the Duke of York's former start-up business network now seems to be in doub… [+3926 chars]",
            "url": "https://www.bbc.com/news/articles/c62k6zkd3g5o"
        },
        {
            "title": "People Are Paying Millions to Dine With Donald Trump at Mar-a-Lago",
            "content": "Guests are paying millions of dollars to dine and meet with President Donald Trump at special events held at his Mar-a-Lago estate in Palm Beach, Florida.\r\nBusiness leaders can secure a one-on-one me… [+2931 chars]",
            "url": "https://www.wired.com/story/people-paying-millions-donald-trump-mar-a-lago/"
        },
        {
            "title": "'Unfinished business' - Mings redemption has Villa dreaming",
            "content": "On Tuesday, Mings provided a headed assist for Leon Bailey to open the scoring in the third minute.\r\nAt 1-1, Brugge skipper Vanaken produced a header which was on target and heading for the back of t… [+940 chars]",
            "url": "https://www.bbc.com/sport/football/articles/c981wnder7jo"
        },
        {
            "title": "Lenovo’s ThinkBook Flip puts an extra-tall folding display on a laptop",
            "content": "Lenovo keeps finding new ways to stuff huge screens into otherwise plain productivity laptops.\r\nLenovo keeps finding new ways to stuff huge screens into otherwise plain productivity laptops.\r\nLenovo … [+3140 chars]",
            "url": "https://www.theverge.com/news/622380/lenovo-thinkbook-flip-concept-laptop-foldable-mwc"
        },
        {
            "title": "GM taps Nvidia to boost its embattled self-driving projects",
            "content": "The automaker will use the deep-pocketed tech giants chips and software to develop next-gen autonomous cars, robots, and manufacturing processes.\r\nThe automaker will use the deep-pocketed tech giants… [+3825 chars]",
            "url": "https://www.theverge.com/news/631951/gm-nvidia-gtc-deal-cars-robots-factories"
        },
        {
            "title": "US music subscriptions cross 100 million as digital downloads drop",
            "content": "Vinyl music sales are on an 18-year growth streak.\r\nVinyl music sales are on an 18-year growth streak.\r\nBusiness is still booming for music streaming services, which crossed the 100 million US subscr… [+1228 chars]",
            "url": "https://www.theverge.com/news/632045/riaa-music-streaming-revenue-100-million-subscriptions"
        },
        {
            "title": "The Volkswagen ID. EVERY1 is an affordable EV for the masses",
            "content": "The sporty hatchback will sell for 20,000 when it launches in Europe in 2027. But when will we see it in the US?\r\nThe sporty hatchback will sell for 20,000 when it launches in Europe in 2027. But whe… [+4137 chars]",
            "url": "https://www.theverge.com/news/624676/vw-id-every1-ev-price-range-specs-2027"
        },
        {
            "title": "Ford hires a Twitch and PlayStation veteran to run its digital services",
            "content": "Ford continues to forge a path to increase revenue in services a la Apple.\r\nFord continues to forge a path to increase revenue in services a la Apple.\r\nFord has hired a former Twitch, PlayStation, an… [+1470 chars]",
            "url": "https://www.theverge.com/news/629710/ford-digital-integrated-services-mike-aragon-subscriptions"
        },
        {
            "title": "Elon Musk made more promises about Optimus and Cybercabs at Tesla’s surprise all-hands meeting",
            "content": "The Tesla CEO pleads with employees (and, indirectly, to investors) to hang onto their stocks.\r\nThe Tesla CEO pleads with employees (and, indirectly, to investors) to hang onto their stocks.\r\nAt a su… [+2089 chars]",
            "url": "https://www.theverge.com/news/633907/elon-musk-tesla-employee-meeting-stock-value-drop-cybercab-optimus"
        },
        {
            "title": "HP EliteBook X G1a Review: An AI Laptop That’s All Business",
            "content": "On the surface, the HP EliteBook X G1a ($2,199 testing, $1,999 starting) looks like any other business laptop. Its got a safe, elegant design that screams work laptop. But dig a little deeper, and yo… [+10998 chars]",
            "url": "https://gizmodo.com/hp-elitebook-x-g1a-review-an-ai-laptop-thats-all-business-2000570228"
        },
        {
            "title": "Trump's chaos could spook the ad business",
            "content": "Donald Trump's new presidency is generating lots of economic question marks. That could slow ad spending.BRENDAN SMIALOWSKI/AFP via Getty Images\r\n<ul><li>People who run businesses hate uncertainty. T… [+3279 chars]",
            "url": "https://www.businessinsider.com/trumps-chaos-could-spook-ad-business-spending-2025-3"
        },
        {
            "title": "Additional Google Gemini aid arrives in Meet and Chat for more Workspace users",
            "content": "What you need to know\r\n<ul><li>Google is rolling out several Gemini-backed features for its Workspace Business and Enterprise edition (Standard and Plus) users.</li><li>Meet grabs a new \"Studio\" feat… [+3572 chars]",
            "url": "https://www.androidcentral.com/phones/google/google-gemini-meet-chat-workspace-editions-users-rollout"
        },
        {
            "title": "23andMe files for bankruptcy as CEO steps down",
            "content": "Once valued at $6 billion, executives have yet to find a bidder for the $50 million gene testing company that has never turned a profit.\r\nOnce valued at $6 billion, executives have yet to find a bidd… [+1897 chars]",
            "url": "https://www.theverge.com/news/634497/23andme-chapter-11-bankruptcy-gene-testing"
        },
        {
            "title": "I'm a small-business owner. The tariff whiplash has me stuck in a holding pattern.",
            "content": "Vivian Hoffman founded the women's boutique chain Whim Love in 2017, which has five locations in New York and Connecticut. Most of Whim's merchandise retails for under $100. Hoffman previously served… [+4958 chars]",
            "url": "https://www.businessinsider.com/tariff-whiplash-mexico-china-canada-retail-clothing-supply-chain-prices-2025-3"
        },
        {
            "title": "8 legal considerations to recession-proof your small business",
            "content": "It's best to understand your legal options in advance instead of scrambling during a market crash.Bet_Noire/Getty, Jim Lin/Getty, SusanWoodImages/Getty, Tyler Le/BI\r\n<ul><li>Recession fears are back,… [+7101 chars]",
            "url": "https://www.businessinsider.com/small-business-legal-steps-recession-preparation-2025-3"
        },
        {
            "title": "Apple's cofounder has some advice for DOGE",
            "content": "Steve Wozniak said that mass firings are \"not good for a business\" in a recent interview.Getty Images\r\n<ul><li>Steve Wozniak said DOGE's mass firings are a bad business tactic.</li><li>Wozniak said D… [+2117 chars]",
            "url": "https://www.businessinsider.com/apple-steve-wozniak-elon-musk-doge-firing-federal-employees-2025-3"
        },
        {
            "title": "Venture capitalist says making sure 'killer robots' aren't running around is the 'cost of doing business' in defense AI",
            "content": "Militaries around the world are increasingly looking to AI and autonomous systems for future warfare, but there are ethical considerations that industry figures say can't be overlooked.US Army\r\n<ul><… [+5795 chars]",
            "url": "https://www.businessinsider.com/not-making-killer-robots-cost-business-defense-ai-vc-founder-2025-3"
        },
        {
            "title": "CEOs say they feel stuck as they wait for the dust to settle from Trump's on-again, off-again tariffs",
            "content": "President Donald Trump has placed tariffs on goods from Canada and other countries.Chip Somodevilla/Getty Images\r\n<ul><li>CEOs are grappling with uncertainty over Trump's unpredictable tariffs.</li><… [+3362 chars]",
            "url": "https://www.businessinsider.com/tariff-business-uncertainty-ceo-trump-mexico-canada-china-2025-3"
        },
        {
            "title": "Critical Role's cofounders credit 4 things to stay friends after running a business together for a decade",
            "content": "Critical Role's cofounders have been in business with each other for a decade.Robyn Von Swank/Critical Role\r\n<ul><li>Critical Role, the nerdworld business giant, started streaming their show in March… [+4063 chars]",
            "url": "https://www.businessinsider.com/critical-role-cofounders-tips-for-doing-business-with-your-friends-2025-3"
        },
        {
            "title": "It's easy to eat more protein and boost your gut health at the same time. A doctor explains how.",
            "content": "Dr Rupy Aujla is a London-based doctor who specializes in nutrition.Faith Mason\r\n<ul><li>Eating enough protein is important for our health.</li><li>But we don't need to eat lots of meat and ultra-pro… [+4627 chars]",
            "url": "https://www.businessinsider.com/eat-more-protein-boost-gut-health-same-time-easy-doctor-2025-3"
        },
        {
            "title": "How to Approach Business Ethics as Global Consensus Breaks Down",
            "content": "During the last decade, weve seen increased global pressures on companies and their leaders to conduct business with integrity, through both regulations and stakeholder initiatives. While not all reg… [+211 chars]",
            "url": "https://hbr.org/2025/03/how-to-approach-business-ethics-as-global-consensus-breaks-down"
        },
        {
            "title": "Strategic Impact Initiatives Can Make Your Business Stronger",
            "content": "Traditional corporate social responsibility (CSR) programs have long felt like box-checking exercisesa bolt-on, or something driven mostly by public relations. But for leaders navigating an increasin… [+126 chars]",
            "url": "https://hbr.org/2025/03/strategic-impact-initiatives-can-make-your-business-stronger"
        },
        {
            "title": "Inside the virtual battles Ukrainian soldiers are fighting with top-of-the-line fake guns to train for real combat",
            "content": "Ukrainian servicemen search for a target with an FIM-92 Stinger launcher on the front line in the Zaporizhzhia region in May 2024.AP Photo/Andriy Andriyenko\r\n<ul><li>BI visited a facility in Kyiv whe… [+5662 chars]",
            "url": "https://www.businessinsider.com/how-ukrainian-troops-fight-fake-guns-prepare-for-real-combat-2025-3"
        },
        {
            "title": "FedEx warns of 'continued weakness and uncertainty' in the US industrial economy",
            "content": "FedEx revised its outlook downward saying that soft demand from business customers is likely to hamper earnings this year.Etienne DE MALGLAIVE/Getty Images\r\n<ul><li>FedEx revised its outlook downward… [+1775 chars]",
            "url": "https://www.businessinsider.com/fedex-warns-of-weakness-and-uncertainty-in-us-industrial-economy-2025-3"
        },
        {
            "title": "The Trump Organization sued Capital One as the bank's proposed merger with Discover hangs in the balance",
            "content": "Eric Trump and the Trump Organization, which he runs, have filed a lawsuit against Capital One.Joe Raedle/Getty Images\r\n<ul><li>The Trump Organization sued Capital One over the termination of its acc… [+6506 chars]",
            "url": "https://www.businessinsider.com/trump-organization-lawsuit-donald-trump-capital-one-2025-3"
        },
        {
            "title": "A business owner lost a year's income in one day after DOGE cuts: 'I still choke up on my free days'",
            "content": "Emily B. Brown\r\n<ul><li>Emily B. Brown lost nearly $63,000 in contract work for federal foreign aid agencies.</li><li>Brown specializes in gender equality and social inclusion — initiatives that Trum… [+5588 chars]",
            "url": "https://www.businessinsider.com/business-owner-loses-annual-income-overnight-due-to-doge-cuts-2025-3"
        },
        {
            "title": "Secretary of Commerce Howard Lutnick pummeled over Social Security 'fraudsters' comments",
            "content": "Commerce Secretary Howard Lutnick drew backlash after saying people complaining about missed Social Security checks are \"fraudsters.\"Nathan Howard/REUTERS\r\n<ul><li>Howard Lutnick is facing backlash f… [+5220 chars]",
            "url": "https://www.businessinsider.com/howard-lutnick-social-security-fraudsters-comments-doge-cuts-ssa-2025-3"
        },
        {
            "title": "Tesla springs last-minute public all hands on staffers, confusion ensues",
            "content": "Tesla announced an all-hands meeting with short notice, causing employee confusion.Frederic J. Brown/AFP via Getty Images\r\n<ul><li>Tesla announced an all-hands meeting with short notice, causing some… [+1640 chars]",
            "url": "https://www.businessinsider.com/tesla-springs-last-minute-public-all-hands-on-staffers-2025-3"
        },
        {
            "title": "A CEO spends $1,300 a month on staying fit. He's a member of gyms in NYC and London, and does 2 fitness classes before work.",
            "content": "To share how much money you spend on health, fitness, and wellness with Business Insider's Fitness Money Diaries, fill out this form.\r\nYann Magnan, the CEO of the startup software company 73 Strings,… [+4384 chars]",
            "url": "https://www.businessinsider.com/ceo-spends-staying-fit-monthly-class-before-work-orangetheory-barrys-2025-3"
        },
        {
            "title": "A top 3% fund manager warns a 'multi-year bear market' is coming with stocks in the biggest momentum swing of his 45-year career",
            "content": "Investors have enjoyed sunny days over the last two-and-a-half years thanks to a strong economy and enthusiasm around artificial intelligence.\r\nBut at some point, it's going to rain, warns Smead Capi… [+3007 chars]",
            "url": "https://www.businessinsider.com/stock-market-crash-inflation-bear-market-momentum-sp500-outlook-smead-2025-3"
        },
        {
            "title": "A new DOGE staffer at the Department of Labor has helped run a fertility clinic and has pronatalist ties",
            "content": "Staff at the US Department of Labor in Washington have identified new faces in their offices in recent weeks: three people associated with the White House's Department of Government Efficiency office… [+3449 chars]",
            "url": "https://www.businessinsider.com/doge-staffer-fertility-clinic-pronatalist-department-of-labor"
        },
        {
            "title": "One cheeky question led me to a new love after I thought I had given up on men",
            "content": "I thought I was destined to be single forever and viewed dating as a temporary distraction on the path to pursuing my best life, alone. Then I matched with a cute chef on Tinder who I'd briefly met m… [+5197 chars]",
            "url": "https://www.businessinsider.com/found-love-after-giving-up-on-men-run-business-together-2025-3"
        },
        {
            "title": "An absentee landlord and his former tenant are fighting over who should pay a $180,000 Airbnb fine",
            "content": "The battle over a jaw-dropping fine on a Las Vegas Airbnb is heating up.\r\nFor two years, Xin Tao, an engineer based in Oregon, rented a Las Vegas house he had bought as an investment property to a te… [+4219 chars]",
            "url": "https://www.businessinsider.com/airbnb-lawsuit-landlord-sues-tenant-over-fine-2025-3"
        },
        {
            "title": "Is Incrementalism Holding Back Your AI Strategy?",
            "content": "Artificial intelligence is delivering impressive gains for many companiesautomating customer service, optimizing supply chains, and supercharging marketing. But such incremental progress, while valua… [+332 chars]",
            "url": "https://hbr.org/2025/03/is-incrementalism-holding-back-your-ai-strategy"
        },
        {
            "title": "Angel investor says she's ditching her Teslas over Elon Musk — and might let people smash one with sledgehammers",
            "content": "Getty Images\r\n<ul><li>Joanne Wilson says she's among the cohort of Americans ditching their Teslas in protest of Elon Musk.</li><li>The angel investor and her husband, VC Fred Wilson, owned a pair of… [+2579 chars]",
            "url": "https://www.businessinsider.com/angel-investor-sold-tesla-elon-musk-2025-3"
        },
        {
            "title": "Ukraine already had an Abrams tank problem. Now, it's only going to get worse.",
            "content": "An M1 Abrams tank in service with the Ukrainian military fires its cannon in the Kursk region.Ukrainian Ministry of Defense/Screengrab\r\n<ul><li>The US has sent Ukraine a small number of powerful M1 A… [+5079 chars]",
            "url": "https://www.businessinsider.com/ukraine-abrams-tank-problem-going-to-get-worse-trump-administration-2025-3"
        },
        {
            "title": "My best friend and I built a multimillion-dollar business. We travel the world together and live in the same building.",
            "content": "Salim Elhila and his friend Tan Gera (not pictured) are best friends and cofounders of Decentralized Masters.Anchiy/Getty Images\r\n<ul><li>Salim Elhila founded a crypto company with his friend, Tan Ge… [+4539 chars]",
            "url": "https://www.businessinsider.com/best-friends-built-multimillion-dollar-business-together-2025-3"
        },
        {
            "title": "Deloitte and Accenture workers worry about losing their jobs as DOGE focuses on consulting contracts",
            "content": "Federal agencies have been told to justify their contracts with 10 major consulting firms.Andrew Harnik/Getty Images\r\n<ul><li>The US government spends billions on consulting contracts, making them a … [+5997 chars]",
            "url": "https://www.businessinsider.com/deloitte-accenture-job-fears-doge-consulting-contracts-trump-musk-2025-3"
        },
        {
            "title": "I took a 12-hour train ride in business class. It was better and cheaper than the one-hour flight I usually book.",
            "content": "I spent 12-hours by myself in business class on a train. It was better and cheaper than my usual flight. Margie Pumpa\r\n<ul><li>I usually take a one-hour flight to visit family, but this time I took t… [+3956 chars]",
            "url": "https://www.businessinsider.com/long-train-ride-business-class-better-than-short-flight-overland-2025-3"
        },
        {
            "title": "Older Americans watching their retirement investments fluctuate under Trump: 'I hope he knows what he's doing.'",
            "content": "AaronAmat/Getty; Ava Horton/BI\r\n<ul><li>Older Americans are facing tough choices amid market and economic uncertainty.</li><li>The stock market's decline and policy changes have heightened some fears… [+7273 chars]",
            "url": "https://www.businessinsider.com/retirement-stock-market-trump-social-security-investing-401k-economic-policy-2025-3"
        },
        {
            "title": "Jared Padalecki teases an onscreen reunion with 'Supernatural' costar Jensen Ackles on the final season of 'The Boys'",
            "content": "Jensen Ackles and Jared Padalecki will appear in the fifth and final season of \"The Boys.\"Jon Kopaloff/Getty Images\r\n<ul><li>Jared Padalecki spoke to Business Insider about being part of the final se… [+3428 chars]",
            "url": "https://www.businessinsider.com/jared-padalecki-the-boys-season-5-jensen-ackles-interview-2025-3"
        },
        {
            "title": "Cate Blanchett says the 'shelf life' for actresses was 'about 5 years' when she started out in Hollywood. She explains why she thinks it's different for women now.",
            "content": "The smile of a woman who is booked and busy.Gareth Cattermole/Getty Images\r\n<ul><li>Cate Blanchett reflected on sexism and ageism toward women in Hollywood.</li><li>She said the \"shelf life\" for actr… [+2764 chars]",
            "url": "https://www.businessinsider.com/cate-blanchett-actresses-shelf-life-5-years-sexism-hollywood-2025-3"
        },
        {
            "title": "Inside the anger-fueled fight to shoot down exploding Russian drones with a truck-mounted .50 caliber machine gun",
            "content": "A Ukrainian soldier looks at the thermal imaging display on the M2 Browning gun.AP Photo/Marko Ivkov\r\n<ul><li>Business Insider visited a Ukrainian mobile air defense unit near Kyiv last week.</li><li… [+6737 chars]",
            "url": "https://www.businessinsider.com/how-ukraine-fights-russian-drones-with-truck-mounted-machine-gun-2025-3"
        },
        {
            "title": "Ukrainian soldiers react to Trump: If we run out of American bullets, we'll find another gun",
            "content": "Recent Trump administration decisions on support for Ukraine have created new challenges for Ukrainian troops, several soldiers in an air defense unit told BI.Photo by Roman Chop/Global Images Ukrain… [+5219 chars]",
            "url": "https://www.businessinsider.com/ukrainian-troops-another-gun-if-run-out-of-us-bullets-2025-3"
        },
        {
            "title": "The cofounders of nerdworld giant Critical Role are expanding in 5 areas. Here's an inside look at their master plan.",
            "content": "The eight founders of Critical Role started streaming on Twitch in 2015. Now they're rolling out their 10th anniversary road map.Heirlume Photography\r\n<ul><li>The nerdworld business Critical Role cel… [+6218 chars]",
            "url": "https://www.businessinsider.com/critical-roles-co-founders-talk-10th-anniversary-releases-2025-3"
        },
        {
            "title": "I flew 16 hours in business class with Cathay Pacific. The $5,444 flight had meals and drinks I never imagined having on a plane.",
            "content": "I have had positive experiences flying in the Cathay Pacific business class. Amber Gibson\r\n<ul><li>Recently, I took a 16-hour long-haul flight in business class with Cathay Pacific. </li><li>My fligh… [+5903 chars]",
            "url": "https://www.businessinsider.com/what-its-like-business-class-cathay-pacific-review-2025-3"
        },
        {
            "title": "I cofounded Kayak that sold for $2.1 billion. Here's how finding out I had bipolar illness at 25 impacted my career.",
            "content": "Paul English said he tried to model vulnerability as a leader at Kayak.Courtesy of Paul English\r\n<ul><li>Paul English cofounded Kayak, a travel search engine that sold for $2.1 billion in 2013.</li><… [+5669 chars]",
            "url": "https://www.businessinsider.com/kayak-founder-paul-english-bipolar-illness-leadership-2025-3"
        },
        {
            "title": "Delaware is trying to make nice again with corporations after Elon Musk's exit",
            "content": "Elon Musk has reincorporated both Tesla and SpaceX outside Delaware.Samuel Corum/Getty Images\r\n<ul><li>Delaware has long been a corporate haven due to its business-friendly laws.</li><li>Elon Musk's … [+3076 chars]",
            "url": "https://www.businessinsider.com/delaware-corporations-elon-musk-tesla-exit-business-climate-2025-3"
        },
        {
            "title": "'Severance' star Patricia Arquette hints that Cobel's interest in Mark and Gemma is 'more than just scientific'",
            "content": "Patricia Arquette as Harmony Cobel in season two of \"Severance.\"Apple TV+\r\n<ul><li>\"Severance\" star Patricia Arquette said that Cobel has a \"complicated relationship\" with Mark and Gemma.</li><li>She… [+4088 chars]",
            "url": "https://www.businessinsider.com/why-cobel-helped-mark-severance-season-2-finale-2025-3"
        },
        {
            "title": "Gavin Newsom Is Reportedly Sending Burner Phones To Tech CEOs",
            "content": "It was Newsom's idea, a representative said, and has already yielded some \"valuable interactions.\" That arrangement surprised some people POLITICO spoke with, largely because Newsom is already known … [+819 chars]",
            "url": "https://mobile.slashdot.org/story/25/03/18/2220249/gavin-newsom-is-reportedly-sending-burner-phones-to-tech-ceos"
        },
        {
            "title": "6 strategies that turned one small-business founder's coffee shop into a thriving chain",
            "content": "As a high schooler in the Dominican Republic, Daniella Senior started a catering business from her home to help fund her studies at the Culinary Institute of America.\r\nAfter graduation, she leveraged… [+4142 chars]",
            "url": "https://www.businessinsider.com/lessons-entrepreneurs-founder-coffee-shop-chain-2025-2"
        },
        {
            "title": "Intel Delays Ohio Semiconductor Factory to 2030, Maybe 2031",
            "content": "There has been little good news to come out of Intel in recent memory, and now the storied chipmaker has announced it will postpone the opening of a new Ohio semiconductor factory that was originally… [+3097 chars]",
            "url": "https://gizmodo.com/intel-delays-ohio-semiconductor-factory-to-2030-maybe-2031-2000570189"
        },
        {
            "title": "Leaf Twig and Thorn Razor Review: A Sharp Single-Edge",
            "content": "Its dangerous to have epiphanies while shaving. But in this case it was unavoidable: My epiphany was about shaving.\r\nFor the past few weeks, my bathroom routine has been a little like George Clooney … [+2879 chars]",
            "url": "https://www.wired.com/review/leaf-thorn-and-twig-razor/"
        },
        {
            "title": "Seeking nominations for Business Insider's most innovative CMOs of 2025 list — submit entries by April 25",
            "content": "Duolingo CMO Manu Orssaud featured on BI's most innovative CMOs of 2024 list — will your marketing chief be featured this year?Duolingo\r\n<ul><li>We're seeking nominations for Business Insider's 10th … [+1752 chars]",
            "url": "https://www.businessinsider.com/nominations-entry-form-most-innovative-cmo-list-2025-3"
        },
        {
            "title": "SoftBank-backed creator juggernaut Jellysmack spins off part of its original content business",
            "content": "Jellysmack is a prominent startup in the creator economy.Jellysmack\r\n<ul><li>Creator economy startup Jellysmack has spun off part of its original content business into a new entity.</li><li>Blue Foxe… [+2661 chars]",
            "url": "https://www.businessinsider.com/creator-economy-startup-jellysmack-spins-off-blue-foxes-facebook-youtube-2025-3"
        },
        {
            "title": "Private lunar lander Blue Ghost touches down on the moon",
            "content": "CAPE CANAVERAL, Fla. A private lunar lander carrying a drill, vacuum and other experiments for NASA touched down on the moon Sunday, the latest in a string of companies looking to kickstart business … [+4058 chars]",
            "url": "https://www.npr.org/2025/03/02/g-s1-51579/private-lunar-lander-blue-ghost-touches-down-on-the-moon"
        },
        {
            "title": "How the Ph.D. Project, and 45 colleges, became a target of the Trump administration",
            "content": "When Leyland Lucas was a Ph.D. student at Rutgers University, there weren't a lot of professors in the business department who looked like him. He's Black and originally from Guyana, in South America… [+8453 chars]",
            "url": "https://www.npr.org/2025/03/24/nx-s1-5330715/trump-phd-college-university-investigation-dei-diversity"
        },
        {
            "title": "I lived with my mom and ate McDonald's daily while bootstrapping my company. We made over $1 million in revenue last year.",
            "content": "Daniel Meursing and his employees at Premier Staff.Daniel Meursing\r\n<ul><li>Daniel Meursing is the CEO of Premier Staff, a luxury event staffing company in LA.</li><li>He worked as server and started… [+5769 chars]",
            "url": "https://www.businessinsider.com/founder-bootstrap-events-company-advice-2025-3"
        },
        {
            "title": "I thought my strict diet and fitness regime were just proof I was driven — but I was too lean. Now I'm heavier, fitter, and happier.",
            "content": "Tom Trotter at his leanest (left) and now.Tom Trotter\r\n<ul><li>Tom Trotter was an active, sporty child and trained hard as a rugby player. </li><li>In his 20s, he became obsessed with working out and… [+6292 chars]",
            "url": "https://www.businessinsider.com/strict-diet-fitness-regime-driven-too-lean-heavier-fitter-happier-2025-3"
        },
        {
            "title": "I quit my 9-to-5 in crypto and started an e-commerce business that made $1.3 million in sales last year. I work 24/7 because I love it.",
            "content": "Yong-Soo Chung.Courtesy of Yong-Soo Chung\r\n<ul><li>Yong-Soo Chung left his job as a software engineer at Ripple in 2015 after the startup was fined.</li><li>He launched an e-commerce business and doe… [+5690 chars]",
            "url": "https://www.businessinsider.com/quit-tech-job-e-commerce-business-no-regrets-2025-2"
        },
        {
            "title": "Chinese Companies Rush to Put DeepSeek in Everything",
            "content": "A mobile shooting game developed by Tencent is using DeepSeek to power an in-game assistant that can, among other things, give players fortune-telling readers about whether they are going to have a g… [+3020 chars]",
            "url": "https://www.wired.com/story/deepseek-china-nationalism/"
        },
        {
            "title": "Donald Trump Held Another Million-Dollar 'Candlelight' Dinner—With Elon Musk in Tow",
            "content": "An invitation to a candlelight dinner held this past Saturday at President Donald Trumps Mar-a-Lago club asked prospective guests to spend $1 million per seat. Trump attended the dinner along with El… [+3561 chars]",
            "url": "https://www.wired.com/story/trump-million-dollar-candlelight-dinner-elon-musk/"
        },
        {
            "title": "Portage County inspections: Two restaurants with double-digit violations and 8 ace reports",
            "content": "The following are the latest results of Portage County Health Department inspections on licensed food establishments and other types of businesses, which the Stevens Point Journal reports monthly.<li… [+6358 chars]",
            "url": "https://www.stevenspointjournal.com/story/news/local/2025/03/24/portage-county-inspections-two-restaurants-with-double-digit-violations-and-eight-ace-reports/82589818007/"
        },
        {
            "title": "Launching your first AI project with a grain of RICE: Weighing reach, impact, confidence and effort to create your roadmap",
            "content": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\r\nBusinesses know they cant ignore AI, but when it comes to building with… [+11151 chars]",
            "url": "https://venturebeat.com/ai/launching-your-first-ai-project-with-a-grain-of-rice-weighing-reach-impact-confidence-and-effort-to-create-your-roadmap/"
        },
        {
            "title": "Decoding the Knock Knock situation",
            "content": "Novels, movies, even consulting, are based on a knock knock business model.\r\nTom Cruise made a movie, and you need to buy a ticket to see it. Jane Collins is an engineering professional and you need … [+2943 chars]",
            "url": "https://seths.blog/2025/03/decoding-the-knock-knock-situation/"
        },
        {
            "title": "A Year of the Cheapest Airfare Imaginable Is Yours for Just $10 With a Dollar Flight Club Subscription",
            "content": "If someone offered you thousands of dollars of savings on domestic and international airfare in exchange for just $10, would you go for it? That’s not a hypothetical question, by the way StackSocial … [+2777 chars]",
            "url": "https://gizmodo.com/a-year-of-the-cheapest-airfare-imaginable-is-yours-for-just-10-with-a-dollar-flight-club-subscription-2000572879"
        },
        {
            "title": "Home flippers explain the simple key to turning a profit: If you're doing it right, it's a 'pretty boring business'",
            "content": "If done correctly, flipping a home can turn a tidy profit.\r\nColorado-based investor Whitney Elkins-Hutten bought her first property a single-family home in need of some elbow grease in Fort Collins i… [+4554 chars]",
            "url": "https://www.businessinsider.com/real-estate-investing-how-to-flip-home-for-profit-2025-3"
        },
        {
            "title": "Historic Butler County hotel, restaurant closing after nearly 200 years",
            "content": "A historic Butler County hotel, bar and restaurant is closing its doors after nearly 200 years of business.\r\nIt is with heavy hearts that we announce the closing of Hotel Saxonburg, the business said… [+1168 chars]",
            "url": "https://www.yahoo.com/news/historic-butler-county-hotel-restaurant-160401213.html"
        },
        {
            "title": "‘Functional soda’ seen in rude health as PepsiCo takes plunge",
            "content": "If anyone needed convincing that, in the US at least, better-for-you soda isnt a flash in the pan, perhaps PepsiCos latest acquisition will have persuaded them.\r\nOn Monday (17 March), just under 72 h… [+7884 chars]",
            "url": "https://www.just-drinks.com/features/functional-soda-seen-in-rude-health-as-pepsico-takes-plunge/"
        },
        {
            "title": "Dow Jones CEO Almar Latour on AI, press freedom, and the future of news",
            "content": "Today, I’m talking with Almar Latour, who is the publisher of The Wall Street Journal and CEO of its parent company Dow Jones, which you can think of as a huge research and data provider for companie… [+52490 chars]",
            "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/626229/dow-jones-ceo-almar-latour-wsj-interview-ai-journalism"
        },
        {
            "title": "National Park Summer Bookings Down Amid DOGE-Fueled Turmoil",
            "content": "After recent years of overcrowding, this summer might be a good time to visit your favorite national park, and you can thank Elon Musk and Big Balls for that. Tourist reservations at key hot spots ar… [+4312 chars]",
            "url": "https://gizmodo.com/national-park-summer-bookings-down-amid-doge-fueled-turmoil-2000579301"
        },
        {
            "title": "Forget the iPad Pro, Amazon Slashes Prices on Microsoft’s Surface Pro for the Big Spring Sale",
            "content": "If youre still working off of a piece of ten year old tech, it may be time to start looking for a replacement. The Microsoft Surface Pro laptop is a super versatile option that can fulfill a lot of t… [+2175 chars]",
            "url": "https://gizmodo.com/forget-the-ipad-pro-amazon-slashes-prices-on-microsofts-surface-pro-for-the-big-spring-sale-2000579773"
        },
        {
            "title": "Mexico Is Suing U.S. Gun Makers for $10 Billion. Here’s What to Know About the Case",
            "content": "WASHINGTON The Supreme Court will hear arguments Tuesday in a $10 billion lawsuit Mexico filed against top firearm manufacturers in the U.S., alleging their business practices have fueled cartel gun … [+2593 chars]",
            "url": "https://time.com/7264184/scotus-mexico-lawsuit-us-gun-manufacturers/"
        },
        {
            "title": "Dude Perfect and Mark Rober may be the next YouTubers to get big streaming deals",
            "content": "Following the success of MrBeasts Beast Games, efforts by Netflix and others to sign creators are in overdrive.\r\nFollowing the success of MrBeasts Beast Games, efforts by Netflix and others to sign c… [+1455 chars]",
            "url": "https://www.theverge.com/streaming-wars/630997/youtube-dude-perfect-mark-rober-youtubers-netflix-amazon-deals"
        },
        {
            "title": "Apple TV Plus is reportedly losing $1 billion per year",
            "content": "The Severance streamer is reportedly the only Apple service that isnt profitable.\r\nThe Severance streamer is reportedly the only Apple service that isnt profitable.\r\nApple TV Plus is losing more than… [+1819 chars]",
            "url": "https://www.theverge.com/news/633591/apple-tv-plus-losing-1-billion"
        },
        {
            "title": "Best Buy and Target CEOs say prices are about to go up because of tariffs",
            "content": "Target relies on produce from Mexico during the winter, while Best Buy sources most of its products from Mexico and China.\r\nTarget relies on produce from Mexico during the winter, while Best Buy sour… [+1554 chars]",
            "url": "https://www.theverge.com/news/624254/best-buy-target-raise-prices-tariffs"
        },
        {
            "title": "X’s head of engineering is out",
            "content": "The sudden departure comes after Musk shifted his attention to DOGE and xAI.\r\nThe sudden departure comes after Musk shifted his attention to DOGE and xAI.\r\nXs director of engineering, Haofei Wang, ha… [+1790 chars]",
            "url": "https://www.theverge.com/twitter/634833/x-head-engineering-leaves-elon-musk"
        },
        {
            "title": "The tech and business leaders who attended the Oscars and its after party — from Bob Iger to Sergey Brin",
            "content": "Bob Iger and Kieran Culkin at Searchlight Pictures' Oscars party.David Jon/Getty Images for Searchlight Pictures\r\n<ul><li>The Oscars on Sunday drew big names from Hollywood — and business.</li><li>Di… [+3278 chars]",
            "url": "https://www.businessinsider.com/oscars-tech-business-leaders-red-carpet-party-bob-iger-brin-2025-3"
        },
        {
            "title": "Critical Role's founders are over a decade into the nerdworld business — and they're finally answering the big question of succession",
            "content": "From left to right: Taliesin Jaffe, Liam O'Brien, Marisha Ray, Travis Willingham, Ashley Johnson, Sam Riegel, Laura Bailey, and Matthew Mercer.Robyn von Swank\r\n<ul><li>Critical Role's cofounders sat … [+3458 chars]",
            "url": "https://www.businessinsider.com/cr-critical-role-cofounders-talk-big-question-succession-legacy-2025-3"
        },
        {
            "title": "The Business of Phish (2013)",
            "content": "Over the past fouryears, the rock band Phish has generated over $120 million in ticket sales, handily surpassing more well known artists like Radiohead, The Black Keys, and One Direction. Since their… [+24426 chars]",
            "url": "https://priceonomics.com/business-of-phish/"
        },
        {
            "title": "Open Safety In The Auto Business: Renault Shares Its Battery Fire Suppression Tech",
            "content": "As consumers worldwide slowly make the switch from internal combustion vehicles to lower-carbon equivalents, a few concerns have appeared about electric vehicles. Range anxiety is ebbing away as batt… [+1198 chars]",
            "url": "https://hackaday.com/2025/03/07/open-safety-in-the-auto-business-renault-shares-its-battery-fire-suppression-tech/"
        },
        {
            "title": "Morrisons to shut 52 cafes and 17 stores",
            "content": "Supermarket chain Morrisons is to shut 52 cafes and 17 stores putting hundreds of jobs at risk.\r\nThe retailer will also close a number of in-store services, like the meat and fish counters, pharmacie… [+347 chars]",
            "url": "https://www.bbc.com/news/articles/cqx0v5xprz4o"
        },
        {
            "title": "“Some Assembly Required” Makes Us Love Things More",
            "content": "For the maker looking to turn their project into a business, trying to price your widget can be a bit of a conundrum. You want to share your widget with the world without going broke in the process. … [+1379 chars]",
            "url": "https://hackaday.com/2025/03/02/some-assembly-required-makes-us-love-things-more/"
        },
        {
            "title": "Using Starlink Wi-Fi in the White House Is a Slippery Slope for US Federal IT",
            "content": "As the Trump administration's Department of Government Efficiency (DOGE) continues to rampage through the United States federal government, essentially guided by Elon Musk, the group has also been up… [+4676 chars]",
            "url": "https://www.wired.com/story/white-house-starlink-wifi/"
        },
        {
            "title": "Brazil Clears 8 Miles of Amazon Rainforest to Make Space for UN Climate Conference",
            "content": "This November, the United Nations will descend on the city of Belém, Brazil in an attempt to solve climate change. The 2025 United Nations Climate Change Conference, or COP30, will bring 50,000 peopl… [+3591 chars]",
            "url": "https://gizmodo.com/brazil-clears-8-miles-of-amazon-rainforest-to-make-space-for-un-climate-conference-2000574955"
        },
        {
            "title": "Government vows to clean up England's largest lake",
            "content": "Windermere attracts seven million visitors a year but campaigners say it is treated like an \"open sewer\"\r\nEnvironment Secretary Steve Reed is to pledge to ensure \"only rainwater\" enters England's lar… [+2391 chars]",
            "url": "https://www.bbc.com/news/articles/cm2je1djrm2o"
        },
        {
            "title": "Phytoremediation to Clean the Environment and Mine Critical Materials",
            "content": "Nickel contamination can render soils infertile at levels that are currently impractical to treat. Researchers at UMass Amherst are looking at how plants can help these soils and source nickel for th… [+1391 chars]",
            "url": "https://hackaday.com/2025/02/28/phytoremediation-to-clean-the-environment-and-mine-critical-materials/"
        },
        {
            "title": "A part-time Uber driver who earned $24,000 last year explains how he thinks a ukulele and an EV earned him more tips",
            "content": "Gabe Ets-Hokin was struggling to get his rideshare customers to leave tips. Then he bought a ukulele.\r\n\"It sparks lots of questions, conversations, and connections,\" the 56-year-old told Business Ins… [+4007 chars]",
            "url": "https://www.businessinsider.com/how-get-more-tips-driving-uber-lyft-passenger-conversations-2025-3"
        },
        {
            "title": "Behold ‘Big Wheel’: An Unusually Monstrous Galaxy From the Early Universe",
            "content": "Observations by the keen-eyed Webb Space Telescope have revealed a huge galaxy in the distantwhich is to say earlyuniverse.\r\nThe galaxy is a vibrant orange disk, dubbed the Big Wheel. Its life began … [+2559 chars]",
            "url": "https://gizmodo.com/behold-big-wheel-an-unusually-monstrous-galaxy-from-the-early-universe-2000579038"
        },
        {
            "title": "Leaked WaPo memo reveals big changes coming to Jeff Bezos' newsroom",
            "content": "Jeff Bezos owns The Washington Post, which will undergo a reorganization.Axelle/Bauer-Griffin/FilmMagic\r\n<ul><li>Washington Post executive editor Matt Murray detailed a newsroom reorganization in a m… [+10230 chars]",
            "url": "https://www.businessinsider.com/leaked-wapo-memo-reveals-big-changes-coming-to-bezos-newsroom-2025-3"
        },
        {
            "title": "Seeking nominations for Business Insider's most innovative CMOs of 2025 list — submit entries by April 25",
            "content": "Duolingo CMO Manu Orssaud featured on BI's most innovative CMOs of 2024 list — will your marketing chief be featured this year?Duolingo\r\n<ul><li>We're seeking nominations for Business Insider's 10th … [+1752 chars]",
            "url": "https://www.businessinsider.com/nominations-entry-form-most-innovative-cmo-list-2025-3"
        },
        {
            "title": "Get ready for the law school hunger games",
            "content": "Getting into law schools, like that of the University of Michigan, could be tougher as applications rise.Ken Wolter/Shutterstock\r\n<ul><li>Law school applications are up 20% from a year ago amid econo… [+4635 chars]",
            "url": "https://www.businessinsider.com/law-school-applications-surge-economic-worry-slow-hiring-2025-3"
        },
        {
            "title": "Google DeepMind’s new AI models help robots perform physical tasks, even without training",
            "content": "Gemini Robotics also makes robots more dexterous, allowing them to perform more precise tasks, like folding a piece of paper.\r\nGemini Robotics also makes robots more dexterous, allowing them to perfo… [+3121 chars]",
            "url": "https://www.theverge.com/news/628021/google-deepmind-gemini-robotics-ai-models"
        },
        {
            "title": "Scientists Discover Troves of New Species at the Ocean’s Deepest Depths",
            "content": "Earths hadal zone includes marine regions 19,700 to 36,000 feet (6,000 to 11,000 meters) below sea level. The reference to the Greek god of the underworld, Hades, is not coincidentalthese are the dee… [+3755 chars]",
            "url": "https://gizmodo.com/researchers-discover-thousands-of-new-species-in-the-oceans-deepest-trenches-2000574604"
        },
        {
            "title": "Sensory Substitution Device Tingles Back Of Your Hand",
            "content": "A team from the University of Chicago brings us a new spin on sensory substitution, the “Seeing with the Hands” project, turning external environment input into sensations. Here specifically, the foc… [+973 chars]",
            "url": "https://hackaday.com/2025/03/03/sensory-substitution-device-tingles-back-of-your-hand/"
        },
        {
            "title": "A 6502, In The Shell",
            "content": "Shell scripting is an often forgotten programming environment, relegated to simple automation tasks and little else. In fact, it’s possible to achieve much more complex tasks in the shell. As an exam… [+1035 chars]",
            "url": "https://hackaday.com/2025/03/17/a-6502-in-the-shell/"
        },
        {
            "title": "A Private Space Mission Just Successfully Landed on the Moon for the First Time",
            "content": "With its Blue Ghost lunar module, Texas-based Firefly Aerospace has just achieved what no other private company, anywhere in the world, has ever accomplished: successfully landing on the surface of t… [+1964 chars]",
            "url": "https://www.wired.com/story/a-private-space-mission-has-successfully-landed-on-the-moon-for-the-first-time-blue-ghost-firefly-aerospace/"
        },
        {
            "title": "This $35,000 Computer Is Powered by Trapped Human Brain Cells",
            "content": "Cortical Labs would like to sell you a brain in a box. Itll cost about $35,000, and you can teach it to do all kinds of nifty things. If thats out of your price range, you can sign up for its Wetware… [+3156 chars]",
            "url": "https://gizmodo.com/this-35000-computer-is-powered-by-trapped-human-brain-cells-2000573993"
        },
        {
            "title": "Nvidia says ‘the age of generalist robotics is here’",
            "content": "At GTC 2025, Nvidia demonstrated 1Xs NEO Gamma humanoid robot running its GR00T N1 foundation model.\r\nAt GTC 2025, Nvidia demonstrated 1Xs NEO Gamma humanoid robot running its GR00T N1 foundation mod… [+2624 chars]",
            "url": "https://www.theverge.com/news/631743/nvidia-issac-groot-n1-robotics-foundation-model-available"
        },
        {
            "title": "How North Sea tanker crash could impact wildlife-rich coastline",
            "content": "George King\r\nThe oil tanker and cargo vessel were involved in the serious collision in the North Sea close to the East Yorkshire coastline\r\nAcademics have raised fears over the ecological impact the … [+6219 chars]",
            "url": "https://www.bbc.com/news/articles/czdngyedm26o"
        },
        {
            "title": "How bad could the ship collision be for the environment?",
            "content": "Esme StallardClimate and science reporter, BBC News\r\nTom InghamClimate and science team, BBC News\r\nHow bad could the collision in the North Sea of an oil tanker and a cargo ship be for the environmen… [+5424 chars]",
            "url": "https://www.bbc.com/news/articles/cg5dmv4yydpo"
        },
        {
            "title": "Samsung confirms two Health app updates for Galaxy as we spring forward",
            "content": "What you need to know\r\n<ul><li>Samsung highlighted a couple of new Health app features for Galaxy phones \"later this month.\"</li><li>The Sleep Environment Report will offer insights into how to impro… [+3444 chars]",
            "url": "https://www.androidcentral.com/apps-software/samsung-health-app-daylight-savings-updates-confirmed"
        },
        {
            "title": "An Ode to My Family’s E-Bike",
            "content": "On a chilly morning last October, my 8-year-old daughter and I took our new e-bike, which she had named Toby, on its maiden voyage to school. We admired trees exploding in vibrant golds and flocks of… [+7802 chars]",
            "url": "https://www.theatlantic.com/family/archive/2025/03/e-bike-family-parenthood/682052/"
        },
        {
            "title": "Under Trump, AI Scientists Are Told to Remove ‘Ideological Bias’ From Powerful Models",
            "content": "The National Institute of Standards and Technology (NIST) has issued new instructions to scientists that partner with the US Artificial Intelligence Safety Institute (AISI) that eliminate mention of … [+3395 chars]",
            "url": "https://www.wired.com/story/ai-safety-institute-new-directive-america-first/"
        },
        {
            "title": "Canadians Want to Cut off Americans’ PornHub Access",
            "content": "The trade war between the U.S. and Canada is getting nasty and two new suggestions for how to give Canada the edge could make it worse. The first is for Canada to flout U.S. intellectual property law… [+3713 chars]",
            "url": "https://gizmodo.com/canadians-want-to-cut-off-americans-pornhub-access-and-sell-jailbreaking-tech-2000576903"
        },
        {
            "title": "Evolving Agents – AI Agents That Communicate, Collaborate, and Improve over Time",
            "content": "A production-grade framework for creating, managing, and evolving AI agents with intelligent agent-to-agent communication. The framework enables you to build collaborative agent ecosystems that can s… [+15071 chars]",
            "url": "https://github.com/matiasmolinas/evolving-agents"
        },
        {
            "title": "Sony is experimenting with AI-powered PlayStation characters",
            "content": "Sonys advanced technology group has created an AI-powered version of Aloy from PlayStations Horizon games.\r\nSonys advanced technology group has created an AI-powered version of Aloy from PlayStations… [+3464 chars]",
            "url": "https://www.theverge.com/news/626695/sony-playstation-ai-characters-aloy-horizon-forbidden-west-prototype"
        },
        {
            "title": "This 2024 Samsung 75-Inch QLED Smart TV Is Over $1,000 Off, Never Seen It This Cheap Before",
            "content": "If youve been eyeing an upgrade for your TV or are looking to treat a loved one to something new this year, look no further than the Samsung QLED 4K television. The 75 Q80D model is going for about 5… [+2117 chars]",
            "url": "https://gizmodo.com/this-2024-samsung-75-inch-qled-smart-tv-is-over-1000-off-never-seen-it-this-cheap-before-2000575723"
        },
        {
            "title": "Universal Just Gave Us Our First Look Inside Epic Universe",
            "content": "Take a look at the nearly completed worlds at Epic Universe that will transport theme park guests into their favorite adventures within the realms of Nintendo, Universal Monsters, Harry Potter, and H… [+2306 chars]",
            "url": "https://gizmodo.com/universal-just-gave-us-our-first-look-inside-epic-universe-2000576943"
        },
        {
            "title": "Beats Studio Buds Now Just $99, the Best Apple Alternative to AirPods on a Budget",
            "content": "Amazon has quite a deal today. We’re far away from any big savings holiday like Black Friday or Amazon’s own Prime Days, and yet the e-commerce giant has some great discounts on a variety of popular … [+2050 chars]",
            "url": "https://gizmodo.com/beats-studio-buds-now-just-99-the-best-apple-alternative-to-airpods-on-a-budget-2000576307"
        },
        {
            "title": "Strategic Impact Initiatives Can Make Your Business Stronger",
            "content": "Traditional corporate social responsibility (CSR) programs have long felt like box-checking exercisesa bolt-on, or something driven mostly by public relations. But for leaders navigating an increasin… [+126 chars]",
            "url": "https://hbr.org/2025/03/strategic-impact-initiatives-can-make-your-business-stronger"
        },
        {
            "title": "Dick’s Sporting Goods’ stock falls as it faces ‘dynamic economic environment’",
            "content": "Dicks Sports Goods said its business looks strong for 2025 but its profit outlook fell short of Wall Street analyst estimates, as its stock dropped in premarket trading on Tuesday.\r\nOur outlook refle… [+180 chars]",
            "url": "https://www.marketwatch.com/story/dicks-sporting-goods-outlook-falls-short-as-it-faces-dynamic-economic-environment-0551f85b"
        },
        {
            "title": "What nine months in space does to the human body",
            "content": "Spending time in space and having an unrivalled view of planet Earth is an experience many of us dream of.\r\nHowever, the human body evolved to function in the gravity of Earth. So time in the weightl… [+3906 chars]",
            "url": "https://www.bbc.com/news/articles/c1jpyl8g772o"
        },
        {
            "title": "Archaeologists uncover Bronze Age stone circle",
            "content": "Jude Winter\r\nArchaeologists from the series Time Team took part in the excavations with Forestry England\r\nArchaeologists have discovered that what was thought to be a single standing stone in a fores… [+2536 chars]",
            "url": "https://www.bbc.com/news/articles/c5y06r662jzo"
        },
        {
            "title": "Your environment can increase your dementia risk",
            "content": "A new study focuses on the powerful role our surroundings play in shaping dementia risk.\r\nThe meta-analysis demonstrates that factors including air pollution and access to green or blue spaces can si… [+2779 chars]",
            "url": "https://www.futurity.org/environmental-triggers-dementia-risk-3273302/"
        },
        {
            "title": "Blood brothers - bonds and betrayal on a rugby pitch",
            "content": "Williams, having supposedly brought disgrace on Harlequins by independently concocting the blood capsule plan, sought advice from the Rugby Players' Association.\r\nThey urged him to appeal, to blow th… [+4596 chars]",
            "url": "https://www.bbc.com/sport/rugby-union/articles/cqjd1p98l4jo"
        },
        {
            "title": "Hamilton does not feel pressure to 'prove anything'",
            "content": "Hamilton is teamed with Charles Leclerc at Ferrari and said he had been impressed by the 27-year-old's \"work ethic\".\r\n\"It is not too dissimilar to mine,\" Hamilton said. \"Just getting on with it. He i… [+1682 chars]",
            "url": "https://www.bbc.com/sport/formula1/articles/ce8mr3rvyd5o"
        },
        {
            "title": "Aider: Using Uv as an Installer",
            "content": "Aider: Using uv as an installer. Paul Gauthier has an innovative solution for the challenge of helping end users get a copy of his Aider CLI Python utility installed in an isolated virtual environmen… [+2008 chars]",
            "url": "https://simonwillison.net/2025/Mar/6/aider-using-uv-as-an-installer/"
        },
        {
            "title": "New Mac Studio Supports Low Power Mode With Two Benefits",
            "content": "The new Mac Studio models with M4 Max and M3 Ultra chips support Low Power Mode, according to an Apple support document updated today.\r\nApple says turning on Low Power Mode reduces the Mac Studio's f… [+728 chars]",
            "url": "https://www.macrumors.com/2025/03/12/new-mac-studio-supports-low-power-mode/"
        },
        {
            "title": "Billions of Years Ago, Mars Featured Beaches Fit for a Vacation, Astronomers Say",
            "content": "Step aside, Santa Monica. It seems that Mars once had beaches that would give the Californian coast a run for its money.\r\nAn international team of researchers has revealed evidence of bygone “vacatio… [+3266 chars]",
            "url": "https://gizmodo.com/billions-of-years-ago-mars-featured-beaches-fit-for-a-vacation-astronomers-say-2000568051"
        },
        {
            "title": "Google Gemini Is Coming to a Robot Near You",
            "content": "I have barely figured out how to get Gemini going on my Android device, and already, Google has announced it’s putting Gemini 2.0 into real-life robots. The company announced two new AI models that “… [+2914 chars]",
            "url": "https://gizmodo.com/google-gemini-is-coming-to-a-robot-near-you-2000574732"
        },
        {
            "title": "How to Track the Flood of Bullshit Coming From Trump’s White House",
            "content": "During Donald Trump’s first term, Steve Bannon explicitly laid out what the administration’s strategy would be to get things done: “flood the zone with shit. The theory is pretty simple: throw out as… [+2769 chars]",
            "url": "https://gizmodo.com/how-to-track-the-flood-of-bullshit-coming-from-trumps-white-house-2000575201"
        },
        {
            "title": "Lunar Lander Photographs a ‘Diamond Ring’ During Solar Eclipse on the Moon",
            "content": "Firefly’s Blue Ghost lander captured breathtaking images of the so-called diamond ring effect as it observed a solar eclipse from its perch on the lunar surface early this morning.\r\nBlue Ghost got it… [+2419 chars]",
            "url": "https://gizmodo.com/lunar-lander-photographs-a-diamond-ring-during-solar-eclipse-on-the-moon-2000576129"
        },
        {
            "title": "Bill Gates Is Giving Up on Climate Change as Trump Drains the Woke Out of Washington",
            "content": "As if there was any doubt, we can go ahead and officially add climate change to the list of things that we can’t count on billionaires to figure out for us. According to the New York Times, Breakthro… [+3377 chars]",
            "url": "https://gizmodo.com/bill-gates-is-giving-up-on-climate-change-as-trump-drains-the-woke-out-of-washington-2000576270"
        },
        {
            "title": "What to Know About BMW’s Futuristic Panoramic Vision Windshield",
            "content": "Among the most notable automotive tech on display at CES 2025 was BMWs Panoramic Vision, set to appear in all new models by the end of the year. Its a heads-up display (HUD), but unlike a conventiona… [+3367 chars]",
            "url": "https://gizmodo.com/what-to-know-about-bmws-futuristic-panoramic-vision-windshield-2000573324"
        },
        {
            "title": "GNOME 48 Released",
            "content": "GNOME 48 desktop environment has been released after six months of development with major new features that have been expected for more than four years, such as dynamic triple buffering, HDR support,… [+640 chars]",
            "url": "https://tech.slashdot.org/story/25/03/20/0324212/gnome-48-released"
        },
        {
            "title": "COSMIC Desktop Alpha 6 Released",
            "content": "Linuxiac reports that the 6th alpha release of the COSMIC desktop environment has been released. The new alpha release includes zooming, desktop icon management, some new scaling options, and improve… [+651 chars]",
            "url": "https://tech.slashdot.org/story/25/03/01/0059224/cosmic-desktop-alpha-6-released"
        },
        {
            "title": "What Makes a Kid a Strong Reader",
            "content": "Why is it that one high school student aces her SAT verbal section while another barely finishes the exam, scoring near the bottom of the heap?  \r\nSome would say that the teenager with the high score… [+8221 chars]",
            "url": "https://time.com/7269188/reading-ability-nature-nurture/"
        },
        {
            "title": "Apple is ‘actively developing’ AirPods with cameras: What to expect",
            "content": "According to Bloomberg’s Mark Gurman, Apple is ‘actively developing’ a version of AirPods with integrated cameras. This tech is unlikely to make an appearance in AirPods Pro 3, which are expected to … [+2635 chars]",
            "url": "https://9to5mac.com/2025/03/09/airpods-with-cameras-what-to-expect/"
        },
        {
            "title": "New Research Suggests Ancient Ocean on Mars",
            "content": "Hidden layers of rock below the surface of Mars \"strongly suggest\" the presence of an ancient ocean, according to an international team of scientists including researchers at Penn State.From the univ… [+2562 chars]",
            "url": "https://science.slashdot.org/story/25/03/01/0719208/new-research-suggests-ancient-ocean-on-mars"
        },
        {
            "title": "Amazon forest felled to build road for climate summit",
            "content": "Watch: Drone shots show scale of Amazon deforestation for COP30 road\r\nA new four-lane highway cutting through tens of thousands of acres of protected Amazon rainforest is being built for the COP30 cl… [+6166 chars]",
            "url": "https://www.bbc.com/news/articles/c9vy191rgn1o"
        },
        {
            "title": "'My best friend went to work - and was crushed to death by rubbish'",
            "content": "Hasham Cheema\r\nFighting back the tears, 22-year-old rubbish collector Okuku Prince recalls the moment his best friend's lifeless body was found at a massive rubbish dump in Uganda's capital, Kampala.… [+6631 chars]",
            "url": "https://www.bbc.com/news/articles/cvgepq6269vo"
        },
        {
            "title": "Boy surprised with gift made from thousands of tubs he saved from landfill",
            "content": "Jamie MorrisReporting from\r\nSouthampton &amp; Exeter\r\nTeddy was surprised to arrive at school and find a special bench made of his recycled plastic tubs\r\nA little boy, who has earned the nickname \"Sw… [+3355 chars]",
            "url": "https://www.bbc.com/news/articles/c33744nxpdro"
        },
        {
            "title": "The 10 happiest cities in the US, ranked",
            "content": "Money can only contribute to your happiness up to a point where you live may also impact how content you are, according to a new WalletHub study.\r\n\"Research shows that having more money only increase… [+1198 chars]",
            "url": "https://www.businessinsider.com/happiest-cities-in-us-ranked-2025-3"
        },
        {
            "title": "Wake, Boot, Repeat: Remote OS Selection with GRUB and ESP",
            "content": "What do you do when you need to choose an OS at boot but aren’t physically near your machine? [Dakhnod]’s inventive solution is a mix of GRUB, Wake-on-LAN (WOL), and a lightweight ESP8266 running a s… [+1630 chars]",
            "url": "https://hackaday.com/2025/03/03/wake-boot-repeat-remote-os-selection-with-grub-and-esp/"
        },
        {
            "title": "Why do some birds mimic the sounds of other species?",
            "content": "Although some birds learn their species’ song during their first year of life, others, including mockingbirds, continue adding to their repertoire as they grow older. Northern Mockingbirds can learn … [+2767 chars]",
            "url": "https://www.allaboutbirds.org/news/why-do-some-birds-mimic-the-sounds-of-other-species/"
        },
        {
            "title": "Itoje rejects Carling criticism of England coaches",
            "content": "England captain Maro Itoje has rejected Will Carling's suggestion that Steve Borthwick's inexperienced coaching set-up is preventing the side from reaching its potential. \r\nSpeaking to BBC Radio 4 on… [+2873 chars]",
            "url": "https://www.bbc.com/sport/rugby-union/articles/c93n1q7zx1go"
        },
        {
            "title": "Man forced to pay dead father's £3,000 car fines",
            "content": "Josh Sandiford &amp; George Scotland\r\nGary Davies paid Birmingham City Council £3,000 but wants the money back\r\nA bereaved man claims he was forced to pay £3,000 after Birmingham City Council pursued… [+3130 chars]",
            "url": "https://www.bbc.com/news/articles/cwyg0vj8wjqo"
        },
        {
            "title": "New national forest to see 20m trees planted",
            "content": "Malcolm Prior and Jenny KumahBBC News rural affairs team\r\nThe new Western Forest area will include a mix of 20m newly-planted trees and restored woodland\r\nTwenty million trees will be planted and 2,5… [+3505 chars]",
            "url": "https://www.bbc.com/news/articles/c93nxj5n5g9o"
        },
        {
            "title": "Private spacecraft Blue Ghost lands on Moon",
            "content": "A private spacecraft has landed on the Moon, becoming only the second commercial vehicle to reach the lunar surface.\r\nBlue Ghost left Earth on January 15, after being launched by US firm Firefly Aero… [+2704 chars]",
            "url": "https://www.bbc.com/news/articles/cd9208qv1kzo"
        },
        {
            "title": "First picture of North Sea tanker collision crew released",
            "content": "Some of the 23-strong crew of the Stena Immaculate oil tanker, which was in collision with the Solong cargo ship in the North Sea\r\nThe co-owners of an oil tanker involved in a collision with a cargo … [+3779 chars]",
            "url": "https://www.bbc.com/news/articles/cj3npryp6y7o"
        },
        {
            "title": "FaunaDB Shuts Down But Hints At Open Source Future",
            "content": "FaunaDB, a serverless database combining relational and document features, will shut down by the end of May due to unsustainable capital demands. The company plans to open source its core technology,… [+1233 chars]",
            "url": "https://news.slashdot.org/story/25/03/24/2027215/faunadb-shuts-down-but-hints-at-open-source-future"
        },
        {
            "title": "New Open Source Windows-Compatible Operating System Released",
            "content": "Red Hat product manager Pau Garcia Quiles (also long-time Slashdot reader paugq) spotted an interesting project on GitHub:\r\nFree95, a new lean, Windows-compatible operating system is available from G… [+839 chars]",
            "url": "https://tech.slashdot.org/story/25/03/10/0142235/new-open-source-windows-compatible-operating-system-released"
        },
        {
            "title": "Canadian Manufacturer Closes Plant, Moves Production to North Carolina",
            "content": "A Canadian furniture manufacturer is shutting down a facility in its home country and moving those operations to the U.S. but the company and the workers affected by the move are at odds over whether… [+1493 chars]",
            "url": "https://finance.yahoo.com/news/canadian-manufacturer-closes-plant-moves-143339551.html"
        },
        {
            "title": "Playing a game with your boss? Just let them win.",
            "content": "Beating your boss could either earn you their respect, or their cold shoulder.sankai/Getty Images\r\n<ul><li>A former Facebook executive said employees once let Mark Zuckerberg win when playing a board… [+4226 chars]",
            "url": "https://www.businessinsider.com/bosses-playing-games-workers-winning-losing-jobs-careers-management-workplace-2025-3"
        },
        {
            "title": "4 things to know about Judge Boasberg as he battles Trump over deportation flights",
            "content": "Judge James \"Jeb\" Boasberg's time leading the federal trial court in Washington, D.C., had already proved memorable before last weekend. \r\nBut his role overseeing a new case that challenges the depor… [+3483 chars]",
            "url": "https://www.npr.org/2025/03/18/g-s1-54493/judge-boasberg-trump-deportation-flights"
        },
        {
            "title": "Is it safe to travel with your phone right now?",
            "content": "Recent high-profile deportations began with phone searches at airports. What are your rights? The answer: it depends.\r\nIn recent weeks, airport Customs and Border Protection (CBP) agents have drawn p… [+11572 chars]",
            "url": "https://www.theverge.com/policy/634264/customs-border-protection-search-phone-airport-rights"
        },
        {
            "title": "The Dynamic Leaves Tower With Geometric Planters Is Set To Transform Vlore’s Skyline",
            "content": "Planned to ascend in Vlore, along Albanias picturesque Riviera, The Leaves by Davide Macullo Architects is designed as an extension of its striking natural environment. This tower embodies an organic… [+2835 chars]",
            "url": "https://www.yankodesign.com/2025/03/16/the-dynamic-leaves-tower-with-geometric-planters-is-set-to-transform-vlores-skyline/"
        },
        {
            "title": "10 Must-Have Personal Care Products For The Ultimate Urban Gentleman’s Grooming Kit",
            "content": "In the fast-paced urban environment, maintaining a polished appearance while balancing a hectic lifestyle is crucial for the modern gentleman. Personal care is not just about looking good; it’s about… [+12908 chars]",
            "url": "https://www.yankodesign.com/2025/03/22/10-must-have-personal-care-products-for-the-ultimate-urban-gentlemans-grooming-kit/"
        },
        {
            "title": "Split Fiction doesn’t need to be original when the co-op play is this good",
            "content": "Hazelight Studios keeps nailing it with its co-op games by doing simple things really well.\r\nSplit Fiction, the new game from It Takes Two developer Hazelight Studios, doesnt do anything particularly… [+6561 chars]",
            "url": "https://www.theverge.com/games-review/623660/split-fiction-review-hazelight-studios-it-takes-two"
        },
        {
            "title": "Mercedes-Benz is hedging its bets with rebooted CLA sedan",
            "content": "The automaker plans to offer electric, hybrid, and gas versions of the upcoming model all built on the new MMA platform.\r\nThe automaker plans to offer electric, hybrid, and gas versions of the upcomi… [+6722 chars]",
            "url": "https://www.theverge.com/news/628464/mercedes-benz-cla-ev-hybrid-mma-platform"
        },
        {
            "title": "What 2 Wellness Editors Learned From Taking the Apple Hearing Test With Our AirPods",
            "content": "According to the CDC, 48 million people in the US have trouble hearing with one or both of their ears. This doesn't just affect older adults -- the CDC also reports that five in 10 young people liste… [+7326 chars]",
            "url": "https://www.cnet.com/health/personal-care/what-wellness-editors-learned-taking-apple-hearing-test-with-airpods/"
        },
        {
            "title": "Tech Execs Are Pushing Trump to Build ‘Freedom Cities’ Run by Corporations",
            "content": "A billionaire-backed push to develop libertarian enclaves in Central America is being imported back to the United States, where its proponents want to lay the groundwork for their own privately run, … [+4352 chars]",
            "url": "https://gizmodo.com/tech-execs-are-pushing-trump-to-build-freedom-cities-run-by-corporations-2000574510"
        },
        {
            "title": "Musk Plans to Give Trump Groups $100 Million After Tesla Ad at the White House",
            "content": "Elon Musk is planning to give $100 million to two political groups associated with President Donald Trump, according to a report from the New York Times. The move is unprecedented in American politic… [+5302 chars]",
            "url": "https://gizmodo.com/musk-plans-to-give-trump-groups-100-million-after-tesla-ad-at-the-white-house-2000575040"
        },
        {
            "title": "7 Details We Loved in Andor Season 2’s New Trailer",
            "content": "This morning Lucasfilm dropped our latest look at Andor‘s second and final season, with a tense examination of what price Rebels and Imperials alike are willing to play in the simmering Galactic Civi… [+5365 chars]",
            "url": "https://gizmodo.com/star-wars-andor-season-2-trailer-breakdown-ghorman-dedra-mon-mothma-2000579834"
        },
        {
            "title": "Samsung Android XR Headset Could Cost as Much as the Apple Vision Pro",
            "content": "Samsungs upcoming Android XR project is turning heads, not just because it has a variety of Vision Pro-like features, but because it may have even better displays than Apples $3,500 headset. Thats no… [+4541 chars]",
            "url": "https://gizmodo.com/samsung-android-xr-headset-could-cost-as-much-as-the-apple-vision-pro-2000573128"
        },
        {
            "title": "Android's native Linux Terminal app is live in Google's latest update",
            "content": "Summary\r\n<ul><li>\r\n Google has launched a native Linux Terminal app for Android, allowing users to run Debian in a virtual machine, primarily benefiting developers, security professionals, and those … [+2501 chars]",
            "url": "https://www.androidpolice.com/android-15-linux-terminal-app/"
        },
        {
            "title": "FedEx warns of 'continued weakness and uncertainty' in the US industrial economy",
            "content": "FedEx revised its outlook downward saying that soft demand from business customers is likely to hamper earnings this year.Etienne DE MALGLAIVE/Getty Images\r\n<ul><li>FedEx revised its outlook downward… [+1775 chars]",
            "url": "https://www.businessinsider.com/fedex-warns-of-weakness-and-uncertainty-in-us-industrial-economy-2025-3"
        },
        {
            "title": "Experts sound alarm over health hazard lurking in water supply: 'Wherever we look, we find it'",
            "content": "Water experts and providers are pushing for a broad ban on PFAS, or \"forever chemicals,\" which stay in our environment for years, The Guardian reported.\r\nThese substances can be found in thousands of… [+2416 chars]",
            "url": "https://www.yahoo.com/news/experts-sound-alarm-over-health-031500557.html"
        },
        {
            "title": "The Best First Jobs for Liberal Arts Majors Now That Trump Is President",
            "content": "Prostock-Studio / Getty Images/iStockphoto\r\nThe job market has always been a daunting place for many new graduates, and recent political shifts arent making it any easier. With changes in funding pri… [+2576 chars]",
            "url": "https://finance.yahoo.com/news/best-first-jobs-liberal-arts-120027939.html"
        },
        {
            "title": "Outraged fans call out Coca-Cola after noticing glaring issue with new ad: 'How ... lazy can one of the biggest companies in the world be?'",
            "content": "Eagle-eyed consumers are criticizing the world's largest beverage company after spotting an error in a new advertisement generated by artificial intelligence.\r\nA Reddit user posted a screenshot of th… [+2614 chars]",
            "url": "https://www.yahoo.com/lifestyle/outraged-fans-call-coca-cola-110011983.html"
        },
        {
            "title": "Nate Silver on Disney’s 538",
            "content": "Nate Silver writes a few thoughts on the closing of FiveThirtyEight:\r\nFor more extended thoughts on the environment at Disney plus plenty of self-reflection/self-criticism you can see the item at the… [+1043 chars]",
            "url": "https://flowingdata.com/2025/03/05/nate-silver-on-disneys-538/"
        },
        {
            "title": "Samsung’s new sleep tracking tool is arriving soon, but only on select devices",
            "content": "<ul><li>Samsung has confirmed that the Sleep Environment Report feature of Samsung Health will roll out by the end of March.</li><li>The feature will track sleep conditions like temperature, humidity… [+1644 chars]",
            "url": "https://www.androidauthority.com/samsung-sleep-environment-report-march-3532754/"
        },
        {
            "title": "South Sudan’s rising violence in “polarised regional environment”",
            "content": "Quotable\r\nAlan Boswell of the International Crisis Group unpacks South Sudans escalating violence, whos behind it, and whats next.\r\nRead moreAlan Boswell from the International Crisis Group unpacks w… [+143 chars]",
            "url": "https://www.aljazeera.com/program/quotable/2025/3/14/aje-onl-qtalanboswellfinal-130325"
        },
        {
            "title": "The Elon tax: Ad insiders say they're advising clients to spend on X to avoid legal and political headaches",
            "content": "Elon Musk owns X, which has seen some advertisers return to the platform.AP/Evan Vucci\r\n<ul><li>Some ad agencies and consultants say they're advising clients to spend on Elon Musk's X.</li><li>Indust… [+7701 chars]",
            "url": "https://www.businessinsider.com/ad-insiders-advise-to-spend-x-avoid-political-legal-pain-2025-3"
        },
        {
            "title": "HomeKit Weekly: Making the case for putting an Aqara temperature and humidity sensor in every room",
            "content": "HomeKit has changed how I interact with many of the rooms in my house. While lighting and cameras tend to have the spotlight for most people as they can easily see the impact, environment monitoring … [+2591 chars]",
            "url": "https://9to5mac.com/2025/03/07/the-case-for-putting-an-aqara-temperature-and-humidity-sensor-in-every-room/"
        },
        {
            "title": "GNSS Signals Tracked on the Moon By LuGRE",
            "content": "As part of the payloads on the Firefly Blue Ghost Mission 1 (BGM1) that recently touched down on the Moon, the Lunar GNNS Receiver Experiment (LuGRE) has become the first practical demonstration of a… [+971 chars]",
            "url": "https://hackaday.com/2025/03/07/gnss-signals-tracked-on-the-moon-by-lugre/"
        },
        {
            "title": "Apple Still Exploring Smart Glasses Similar to Meta's Ray-Bans",
            "content": "Apple is still discussing the possibility of making smart glasses similar to Meta's popular Ray-Ban glasses, according to Bloomberg's Mark Gurman.\r\nWriting in his latest Power On newsletter, Gurman s… [+1940 chars]",
            "url": "https://www.macrumors.com/2025/03/10/apple-still-exploring-smart-glasses-meta-ray-bans/"
        },
        {
            "title": "The Capacitor Plague of the Early 2000s",
            "content": "Somewhere between the period of 1999 and 2007 a plague swept through the world, devastating lives and businesses. Identified by a scourge of electrolytic capacitors violently exploding or splurging t… [+1293 chars]",
            "url": "https://hackaday.com/2025/03/18/the-capacitor-plague-of-the-early-2000s/"
        },
        {
            "title": "Jupiter's Moon Callisto Probably Has an Ocean Under Its Surface",
            "content": "If there was a contest for the most interesting moon in our solar system, Callisto would be a contender. Jupiter's second-largest moon has more impact craters on its surface than any other planetary … [+5536 chars]",
            "url": "https://www.cnet.com/science/jupiters-moon-callisto-probably-has-an-ocean-under-its-surface/"
        },
        {
            "title": "What does NHS England do? Your questions answered on health reforms",
            "content": "Nick Triggle\r\nHelen Catt\r\nThe government has announced NHS England will be abolished to \"cut bureaucracy\" and reform how the National Health Service is run.\r\nThe changes will not impact anyone's acce… [+4882 chars]",
            "url": "https://www.bbc.com/news/articles/crknrrz7ln6o"
        },
        {
            "title": "Grangemouth: A new dawn for the home of UK's oldest oil refinery?",
            "content": "Kevin KeaneBBC Scotland's environment correspondent\r\nThere is both concern and optimism about the Grangemouth site's long-term future\r\nThe history of Grangemouth has been built on fossil fuels but no… [+5388 chars]",
            "url": "https://www.bbc.com/news/articles/c62x6l5g36lo"
        },
        {
            "title": "A look at UK fintechs Revolut and Monzo's push to expand in the US, where they face steep challenges in a complex regulatory environment and strong competition (Akila Quinio/Financial Times)",
            "content": "About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 2:35 AM ET, March 12, 2025.\r\nThe most current version of the site as always is available at our home page.\r\nTo vie… [+68 chars]",
            "url": "https://www.techmeme.com/250312/p8"
        },
        {
            "title": "Hoping to revive mammoths, scientists create 'woolly mice'",
            "content": "Scientists have genetically engineered mice with some key characteristics of an extinct animal that was far larger the woolly mammoth. \r\nThis \"woolly mouse\" marks an important step toward achieving t… [+5079 chars]",
            "url": "https://www.npr.org/sections/shots-health-news/2025/03/04/nx-s1-5299962/woolly-mammoth-extinction-mice-genetic-engineering"
        },
        {
            "title": "The Asian elephant population in Cambodia is more robust than previously thought",
            "content": "PHNOM PENH, Cambodia A genetic study of Asian elephants in northern Cambodia published Thursday reveals a larger and more robust population than previously thought, raising hopes the endangered speci… [+2389 chars]",
            "url": "https://www.npr.org/2025/03/14/nx-s1-5328054/asian-elephants-cambodia-population"
        },
        {
            "title": "A scientist tested 15 longevity hacks. 3 weren't worth the money, including a gut health test.",
            "content": "John Tregoning tried a diet with restricted calories but it wasn't sustainable. John Tregoning/ Getty Images\r\n<ul><li>John Tregoning, 47, tried 15 longevity hacks to see which ones were worth buying.… [+5486 chars]",
            "url": "https://www.businessinsider.com/scientist-tried-15-longevity-hacks-werent-worth-the-money-2025-3"
        },
        {
            "title": "Net zero by 2050 'impossible' for UK, says Badenoch",
            "content": "Sam Francis\r\nKemi Badenoch has said it is \"impossible\" for the UK to meet its net zero target by 2050 - a goal set by a previous Conservative government.\r\nThe UK is legally committed to reaching net … [+4856 chars]",
            "url": "https://www.bbc.com/news/articles/cly3pnjyzp4o"
        },
        {
            "title": "Canada joins Portugal in weighing alternatives to the US-made F-35 fighter jet",
            "content": "A US F-35 in flight.US Air Force photo by Senior Airman Jack Rodgers\r\n<ul><li>Canada is reviewing its contract with Lockheed Martin for F-35 fighter jets, the country's Defense Minister said.</li><li… [+2297 chars]",
            "url": "https://www.businessinsider.com/canada-weighs-purchase-f-35-fighter-jets-amid-us-portugal-2025-3"
        }
    ]
}