{
    "validNarratives": {
        "Cluster_0": {
            "articles": [
                {
                    "title": "Watch this ultra-detailed animation of the seafloor",
                    "content": "A NASA and CNES satellite lets scientists see the ocean floor in new ways. \r\nA NASA and CNES satellite lets scientists see the ocean floor in new ways. \r\nThe world has a more detailed map of the seaf… [+2724 chars]",
                    "url": "https://www.theverge.com/nasa/634086/ocean-floor-map-satellite-nasa-cnes"
                },
                {
                    "title": "FCC chair says we’re too dependent on GPS and wants to explore ‘alternatives’",
                    "content": "FCC chair Brendan Carr says relying heavily on GPS leaves us exposed.\r\nFCC chair Brendan Carr says relying heavily on GPS leaves us exposed.\r\nThe Federal Communications Commission (FCC) plans to vote… [+1179 chars]",
                    "url": "https://www.theverge.com/news/625671/fcc-vote-gps-911-technologies-inquiry"
                },
                {
                    "title": "Writing a GPS Receiver from Scratch",
                    "content": "GPS is an incredible piece of modern technology. Not only does it allow for locating objects precisely anywhere on the planet, but it also enables the turn-by-turn directions we take for granted thes… [+1234 chars]",
                    "url": "https://hackaday.com/2025/03/18/writing-a-gps-receiver-from-scratch/"
                },
                {
                    "title": "Driverless racecar sets a new autonomous speed record",
                    "content": "A fully driverless Maserati MC20 Coupe reached 197.7 mph at Kennedy Space Center last week.\r\nA fully driverless Maserati MC20 Coupe reached 197.7 mph at Kennedy Space Center last week.\r\nLook out: the… [+2018 chars]",
                    "url": "https://www.theverge.com/news/621990/autonomous-speed-record-indy-challenge-maserati"
                },
                {
                    "title": "UK autonomous driving startup Wayve rolls into Germany with new testing hub",
                    "content": "British autonomous driving startup Wayve is set to establish a testing and development hub in Germany as it prepares to deploy self-driving vehicles in Europes largest automotive market. \r\nWayves new… [+2575 chars]",
                    "url": "https://thenextweb.com/news/autonomous-vehicles-startup-wayve-bring-embodied-ai-to-germany"
                },
                {
                    "title": "Military vehicles to get mixed reality windshields controlled by human eyes",
                    "content": "Finnish startup Distance Technologies emerged from stealth last year with a technology it claims can turn any transparent surface into a mixed reality (MR) display. Now, it has teamed up with Patria … [+3372 chars]",
                    "url": "https://thenextweb.com/news/military-vehicles-add-distance-mixed-reality-windshields"
                },
                {
                    "title": "iRobot launches eight new Roombas and finally adds lidar mapping",
                    "content": "iRobot’s new lineup of Roomba robot vacuum and mops now all come with lidar navigation and mapping and a whole new look.\r\n\n\nAfter a tumultuous 2024, in which iRobot lost its founder and CEO, Colin An… [+7882 chars]",
                    "url": "https://www.theverge.com/news/627751/irobot-launches-eight-new-roombas-with-lidar-room-mapping"
                },
                {
                    "title": "The Corvette ZR1’s 233-mph run had to start in a virtual world",
                    "content": "The Corvette ZR1s 233-mph run had to start in a virtual world\r\nIt turns out it takes a little Fortran to make a faster Corvette.\r\nThe Corvette ZR1s 233-mph run had to start in a virtual world\r\nIt tur… [+11443 chars]",
                    "url": "https://www.theverge.com/chevrolet/624087/chevy-corvette-zr1-speed-record-simulation"
                },
                {
                    "title": "Check Out Stunning Images of the Scientifically Plausible Alien Planet From Ash",
                    "content": "If you’re going to set a sci-fi movie on an alien planet, it’s a nice bonus if that planet actually exists. Or, at least, is inspired by one that actually exists. In the new film Ash, director Flying… [+1890 chars]",
                    "url": "https://gizmodo.com/ash-movie-planet-elza-gonzalez-aaron-paul-2000572816"
                },
                {
                    "title": "How to get pets for your Hideout in Assassin’s Creed Shadows",
                    "content": "Good news: You can pet the dog in Assassin’s Creed Shadows. When you pet an animal, you’re rewarded with a really cute cinematic — apparently, even strange cats are ready to leap into Naoe’s hands fo… [+2941 chars]",
                    "url": "https://www.polygon.com/assassins-creed-shadows-guides/543533/pets-cats-dogs-how-to-get"
                },
                {
                    "title": "Portage County inspections: Two restaurants with double-digit violations and 8 ace reports",
                    "content": "The following are the latest results of Portage County Health Department inspections on licensed food establishments and other types of businesses, which the Stevens Point Journal reports monthly.<li… [+6358 chars]",
                    "url": "https://www.stevenspointjournal.com/story/news/local/2025/03/24/portage-county-inspections-two-restaurants-with-double-digit-violations-and-eight-ace-reports/82589818007/"
                },
                {
                    "title": "Brazil Clears 8 Miles of Amazon Rainforest to Make Space for UN Climate Conference",
                    "content": "This November, the United Nations will descend on the city of Belém, Brazil in an attempt to solve climate change. The 2025 United Nations Climate Change Conference, or COP30, will bring 50,000 peopl… [+3591 chars]",
                    "url": "https://gizmodo.com/brazil-clears-8-miles-of-amazon-rainforest-to-make-space-for-un-climate-conference-2000574955"
                },
                {
                    "title": "Behold ‘Big Wheel’: An Unusually Monstrous Galaxy From the Early Universe",
                    "content": "Observations by the keen-eyed Webb Space Telescope have revealed a huge galaxy in the distantwhich is to say earlyuniverse.\r\nThe galaxy is a vibrant orange disk, dubbed the Big Wheel. Its life began … [+2559 chars]",
                    "url": "https://gizmodo.com/behold-big-wheel-an-unusually-monstrous-galaxy-from-the-early-universe-2000579038"
                },
                {
                    "title": "What nine months in space does to the human body",
                    "content": "Spending time in space and having an unrivalled view of planet Earth is an experience many of us dream of.\r\nHowever, the human body evolved to function in the gravity of Earth. So time in the weightl… [+3906 chars]",
                    "url": "https://www.bbc.com/news/articles/c1jpyl8g772o"
                },
                {
                    "title": "Aider: Using Uv as an Installer",
                    "content": "Aider: Using uv as an installer. Paul Gauthier has an innovative solution for the challenge of helping end users get a copy of his Aider CLI Python utility installed in an isolated virtual environmen… [+2008 chars]",
                    "url": "https://simonwillison.net/2025/Mar/6/aider-using-uv-as-an-installer/"
                },
                {
                    "title": "Billions of Years Ago, Mars Featured Beaches Fit for a Vacation, Astronomers Say",
                    "content": "Step aside, Santa Monica. It seems that Mars once had beaches that would give the Californian coast a run for its money.\r\nAn international team of researchers has revealed evidence of bygone “vacatio… [+3266 chars]",
                    "url": "https://gizmodo.com/billions-of-years-ago-mars-featured-beaches-fit-for-a-vacation-astronomers-say-2000568051"
                },
                {
                    "title": "What Makes a Kid a Strong Reader",
                    "content": "Why is it that one high school student aces her SAT verbal section while another barely finishes the exam, scoring near the bottom of the heap?  \r\nSome would say that the teenager with the high score… [+8221 chars]",
                    "url": "https://time.com/7269188/reading-ability-nature-nurture/"
                },
                {
                    "title": "New Research Suggests Ancient Ocean on Mars",
                    "content": "Hidden layers of rock below the surface of Mars \"strongly suggest\" the presence of an ancient ocean, according to an international team of scientists including researchers at Penn State.From the univ… [+2562 chars]",
                    "url": "https://science.slashdot.org/story/25/03/01/0719208/new-research-suggests-ancient-ocean-on-mars"
                },
                {
                    "title": "Amazon forest felled to build road for climate summit",
                    "content": "Watch: Drone shots show scale of Amazon deforestation for COP30 road\r\nA new four-lane highway cutting through tens of thousands of acres of protected Amazon rainforest is being built for the COP30 cl… [+6166 chars]",
                    "url": "https://www.bbc.com/news/articles/c9vy191rgn1o"
                },
                {
                    "title": "New national forest to see 20m trees planted",
                    "content": "Malcolm Prior and Jenny KumahBBC News rural affairs team\r\nThe new Western Forest area will include a mix of 20m newly-planted trees and restored woodland\r\nTwenty million trees will be planted and 2,5… [+3505 chars]",
                    "url": "https://www.bbc.com/news/articles/c93nxj5n5g9o"
                },
                {
                    "title": "The Dynamic Leaves Tower With Geometric Planters Is Set To Transform Vlore’s Skyline",
                    "content": "Planned to ascend in Vlore, along Albanias picturesque Riviera, The Leaves by Davide Macullo Architects is designed as an extension of its striking natural environment. This tower embodies an organic… [+2835 chars]",
                    "url": "https://www.yankodesign.com/2025/03/16/the-dynamic-leaves-tower-with-geometric-planters-is-set-to-transform-vlores-skyline/"
                },
                {
                    "title": "10 Must-Have Personal Care Products For The Ultimate Urban Gentleman’s Grooming Kit",
                    "content": "In the fast-paced urban environment, maintaining a polished appearance while balancing a hectic lifestyle is crucial for the modern gentleman. Personal care is not just about looking good; it’s about… [+12908 chars]",
                    "url": "https://www.yankodesign.com/2025/03/22/10-must-have-personal-care-products-for-the-ultimate-urban-gentlemans-grooming-kit/"
                },
                {
                    "title": "HomeKit Weekly: Making the case for putting an Aqara temperature and humidity sensor in every room",
                    "content": "HomeKit has changed how I interact with many of the rooms in my house. While lighting and cameras tend to have the spotlight for most people as they can easily see the impact, environment monitoring … [+2591 chars]",
                    "url": "https://9to5mac.com/2025/03/07/the-case-for-putting-an-aqara-temperature-and-humidity-sensor-in-every-room/"
                },
                {
                    "title": "GNSS Signals Tracked on the Moon By LuGRE",
                    "content": "As part of the payloads on the Firefly Blue Ghost Mission 1 (BGM1) that recently touched down on the Moon, the Lunar GNNS Receiver Experiment (LuGRE) has become the first practical demonstration of a… [+971 chars]",
                    "url": "https://hackaday.com/2025/03/07/gnss-signals-tracked-on-the-moon-by-lugre/"
                },
                {
                    "title": "Jupiter's Moon Callisto Probably Has an Ocean Under Its Surface",
                    "content": "If there was a contest for the most interesting moon in our solar system, Callisto would be a contender. Jupiter's second-largest moon has more impact craters on its surface than any other planetary … [+5536 chars]",
                    "url": "https://www.cnet.com/science/jupiters-moon-callisto-probably-has-an-ocean-under-its-surface/"
                }
            ],
            "generated_title": "new chars"
        },
        "Cluster_12": {
            "articles": [
                {
                    "title": "Android 16 is getting a major hearing accessibility feature",
                    "content": "Auracast will give people who use hearing aids a little extra clarity.\r\nAuracast will give people who use hearing aids a little extra clarity.\r\nAndroid phones will soon support Auracast with Bluetoot… [+1443 chars]",
                    "url": "https://www.theverge.com/tech/628533/android-16-auracast-hearing-aid-support"
                },
                {
                    "title": "Xiaomi Buds 5 Pro are the first to deliver on Qualcomm’s promise of Wi-Fi earbuds",
                    "content": "They even have better battery life than the Bluetooth model.\r\nThey even have better battery life than the Bluetooth model.\r\nXiaomi has given a European launch to its Buds 5 Pro, the first earbuds to … [+2156 chars]",
                    "url": "https://www.theverge.com/news/622452/xiaomi-buds-5-pro-are-the-first-to-deliver-on-qualcomms-promise-of-wi-fi-earbuds"
                },
                {
                    "title": "Sony’s Dazzling New RGB LED TV Comes in 2026",
                    "content": "LED TVs are about to get a lot better. As demonstrated by Hisense and to some extent Samsung at CES 2025, a new backlight technology called RGB LED is poised to improve the quality and efficiency of … [+2714 chars]",
                    "url": "https://www.wired.com/story/sony-rgb-led-tv/"
                },
                {
                    "title": "Sony Ult Wear Noise Cancelling Headphones Are Now at a Steal for $148, Way Cheaper Than AirPods Max",
                    "content": "The pursuit of perfect audio has led many enthusiasts down an expensive path, but true immersive sound doesn’t always require breaking the bank. Sony’s Ult Wear Over-Ear Noise Cancelling Headphones r… [+2599 chars]",
                    "url": "https://gizmodo.com/sony-ult-wear-noise-cancelling-headphones-are-now-at-a-steal-for-148-way-cheaper-than-airpods-max-2000576011"
                },
                {
                    "title": "Wire Recording Speaks Again",
                    "content": "If you think of old recording technology, you probably think of magnetic tape, either in some kind of cassette or, maybe, on reels. But there’s an even older technology that recorded voice on hair-th… [+1324 chars]",
                    "url": "https://hackaday.com/2025/03/16/wire-recording-speaks-again/"
                },
                {
                    "title": "Sony Unveils RGB LED Backlight Tech That Outperforms Traditional Mini LED",
                    "content": "Sony has developed a new TV display technology combining individual red, green, and blue LEDs for backlighting, potentially offering a middle ground between existing Mini LED and OLED panels. Dubbed … [+1065 chars]",
                    "url": "https://entertainment.slashdot.org/story/25/03/19/0743248/sony-unveils-rgb-led-backlight-tech-that-outperforms-traditional-mini-led"
                },
                {
                    "title": "Shark FlexStyle Styling System Hits a Record Low of $250, the Dyson Airwrap Alternative You Need",
                    "content": "The Shark FlexStyle represents a revolutionary approach to hair styling, combining the versatility of a multi-styler with the power of a premium hair dryer. This innovative system transforms from a p… [+2669 chars]",
                    "url": "https://gizmodo.com/shark-flexstyle-styling-system-hits-a-record-low-of-250-the-dyson-airwrap-alternative-you-need-2000573444"
                },
                {
                    "title": "The Dyson Hot and Cool Purifier Drops to Its Lowest Price, Save $130 on Year-Round Air Treatment",
                    "content": "Looking for a single solution to your year-round air quality and temperature needs? The Dyson Purifier Hot + Cool Gen 1 stands as one of the most versatile home appliances on the market, combining po… [+2772 chars]",
                    "url": "https://gizmodo.com/the-dyson-hot-and-cool-purifier-drops-to-its-lowest-price-save-130-on-year-round-air-treatment-2000575942"
                },
                {
                    "title": "Theater-Like Audio for Just $100, Amazon Fire TV Soundbar Makes It Possible",
                    "content": "Looking to upgrade your TV’s audio without breaking the bank? Amazon’s Fire TV Soundbar offers a compelling solution for anyone seeking better sound quality than their TV’s built-in speakers can prov… [+2529 chars]",
                    "url": "https://gizmodo.com/theater-like-audio-for-just-100-amazon-fire-tv-soundbar-makes-it-possible-2000572335"
                },
                {
                    "title": "Apple Watch Series 10 Just Hit Its Lowest Price Since Launch, $100 Off on Amazon for a Limited Time",
                    "content": "The Apple Watch Series 10 represents the pinnacle of wearable technology, combining advanced health monitoring, fitness tracking, and smart features in a sleeker, more refined design. With a larger d… [+2647 chars]",
                    "url": "https://gizmodo.com/apple-watch-series-10-just-hit-its-lowest-price-since-launch-100-off-on-amazon-for-a-limited-time-2000573441"
                },
                {
                    "title": "Sony will give the PS5 Pro crisper graphics — by backporting FSR 4",
                    "content": "Sony says its working on a reimplementation of AMDs FSR 4 upscaler that will make PS5 Pro games look crisper.\r\nSony says its working on a reimplementation of AMDs FSR 4 upscaler that will make PS5 Pr… [+2326 chars]",
                    "url": "https://www.theverge.com/news/626952/sony-fsr-4-upscaler-coming-to-ps5-pro-reimplementation"
                },
                {
                    "title": "A Year of the Cheapest Airfare Imaginable Is Yours for Just $10 With a Dollar Flight Club Subscription",
                    "content": "If someone offered you thousands of dollars of savings on domestic and international airfare in exchange for just $10, would you go for it? That’s not a hypothetical question, by the way StackSocial … [+2777 chars]",
                    "url": "https://gizmodo.com/a-year-of-the-cheapest-airfare-imaginable-is-yours-for-just-10-with-a-dollar-flight-club-subscription-2000572879"
                },
                {
                    "title": "Forget the iPad Pro, Amazon Slashes Prices on Microsoft’s Surface Pro for the Big Spring Sale",
                    "content": "If youre still working off of a piece of ten year old tech, it may be time to start looking for a replacement. The Microsoft Surface Pro laptop is a super versatile option that can fulfill a lot of t… [+2175 chars]",
                    "url": "https://gizmodo.com/forget-the-ipad-pro-amazon-slashes-prices-on-microsofts-surface-pro-for-the-big-spring-sale-2000579773"
                },
                {
                    "title": "This 2024 Samsung 75-Inch QLED Smart TV Is Over $1,000 Off, Never Seen It This Cheap Before",
                    "content": "If youve been eyeing an upgrade for your TV or are looking to treat a loved one to something new this year, look no further than the Samsung QLED 4K television. The 75 Q80D model is going for about 5… [+2117 chars]",
                    "url": "https://gizmodo.com/this-2024-samsung-75-inch-qled-smart-tv-is-over-1000-off-never-seen-it-this-cheap-before-2000575723"
                },
                {
                    "title": "Beats Studio Buds Now Just $99, the Best Apple Alternative to AirPods on a Budget",
                    "content": "Amazon has quite a deal today. We’re far away from any big savings holiday like Black Friday or Amazon’s own Prime Days, and yet the e-commerce giant has some great discounts on a variety of popular … [+2050 chars]",
                    "url": "https://gizmodo.com/beats-studio-buds-now-just-99-the-best-apple-alternative-to-airpods-on-a-budget-2000576307"
                },
                {
                    "title": "Apple is ‘actively developing’ AirPods with cameras: What to expect",
                    "content": "According to Bloomberg’s Mark Gurman, Apple is ‘actively developing’ a version of AirPods with integrated cameras. This tech is unlikely to make an appearance in AirPods Pro 3, which are expected to … [+2635 chars]",
                    "url": "https://9to5mac.com/2025/03/09/airpods-with-cameras-what-to-expect/"
                },
                {
                    "title": "Why do some birds mimic the sounds of other species?",
                    "content": "Although some birds learn their species’ song during their first year of life, others, including mockingbirds, continue adding to their repertoire as they grow older. Northern Mockingbirds can learn … [+2767 chars]",
                    "url": "https://www.allaboutbirds.org/news/why-do-some-birds-mimic-the-sounds-of-other-species/"
                },
                {
                    "title": "What 2 Wellness Editors Learned From Taking the Apple Hearing Test With Our AirPods",
                    "content": "According to the CDC, 48 million people in the US have trouble hearing with one or both of their ears. This doesn't just affect older adults -- the CDC also reports that five in 10 young people liste… [+7326 chars]",
                    "url": "https://www.cnet.com/health/personal-care/what-wellness-editors-learned-taking-apple-hearing-test-with-airpods/"
                },
                {
                    "title": "Samsung Android XR Headset Could Cost as Much as the Apple Vision Pro",
                    "content": "Samsungs upcoming Android XR project is turning heads, not just because it has a variety of Vision Pro-like features, but because it may have even better displays than Apples $3,500 headset. Thats no… [+4541 chars]",
                    "url": "https://gizmodo.com/samsung-android-xr-headset-could-cost-as-much-as-the-apple-vision-pro-2000573128"
                }
            ],
            "generated_title": "pro tv"
        }
    },
    "excludedNarratives": {
        "Cluster_10": {
            "reason": "Articles do not share the same general subject (Similarity: 0.15).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_1": {
            "reason": "Articles do not share the same general subject (Similarity: 0.09).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_4": {
            "reason": "Articles do not share the same general subject (Similarity: 0.19).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_6": {
            "reason": "Articles do not share the same general subject (Similarity: 0.19).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_9": {
            "reason": "Articles do not share the same general subject (Similarity: 0.08).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_2": {
            "reason": "Articles do not share the same general subject (Similarity: 0.31).",
            "common_tokens": [
                "since",
                "char",
                "astronaut",
                "last",
                "nasa",
                "space"
            ]
        },
        "Cluster_8": {
            "reason": "Articles do not share the same general subject (Similarity: 0.24).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_11": {
            "reason": "Articles do not share the same general subject (Similarity: 0.32).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_13": {
            "reason": "Articles do not share the same general subject (Similarity: 0.36).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_7": {
            "reason": "Articles do not share the same general subject (Similarity: 0.27).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_3": {
            "reason": "Articles do not share the same general subject (Similarity: 0.10).",
            "common_tokens": [
                "char"
            ]
        },
        "Cluster_5": {
            "reason": "Articles do not share the same general subject (Similarity: 0.19).",
            "common_tokens": [
                "char"
            ]
        }
    }
}