{
    "validNarratives": {
        "Musk Pentagon": {
            "articles": [
                {
                    "title": "Trump wants a ‘Golden Dome’ capable of defending the entire US: ‘Strategically, it doesn’t make any sense’",
                    "url": "https://www.cnn.com/2025/03/22/politics/pentagon-golden-dome-scramble/index.html",
                    "source": "cnn",
                    "content": "US military officials are scrambling to develop a “Golden Dome” defense system that can protect the country from long-range missile strikes and have been told by the White House that no expense will be spared in order to fulfill one of President Donald Trump’s top Pentagon priorities, according to multiple sources familiar with the matter. “Golden Dome” is the Trump administration’s attempt to rebrand vague plans for developing a missile defense system akin to Israel’s Iron Dome. At a time the Pentagon is looking to cut budgets, the Trump administration has ordered military officials to ensure future funding for “Golden Dome” is reflected in new budget estimates for 2026 to 2030 – but the system itself remains undefined beyond a name, the sources said. “Right now, Golden Dome is, it’s really an idea,” one source familiar with internal discussions about the project said, adding there may be technology in the pipeline that, if ever scaled up, could apply to it, but as of now discussions"
                },
                {
                    "title": "Left loses it over possibility of Musk top secret China briefing: 'No business'",
                    "url": "https://www.foxnews.com/politics/left-loses-over-possibility-musk-top-secret-china-briefing-no-business",
                    "source": "fox",
                    "content": "Sen. Kirsten Gillibrand, D-N.Y., said SpaceX and Tesla CEO Elon Musk has \"no business\" conducting affairs at the Pentagon, amid reports Musk would receive secret information from top military officials Friday about military contingency plans should a war break out with China. While The New York Times reported that Musk was set to receive military plans about any potential China conflict, the Pentagon and White House pushed back and said Musk’s briefing wouldn’t cover China. \"Elon Musk is an unelected, self-interested billionaire with no business anywhere near the Pentagon,\" Gillibrand said in an X post Friday morning with a photo of the Times story, just after Musk arrived at the Pentagon. Gillibrand is a member of the Senate Armed Services"
                }
            ]
        }
    },
    "excludedNarratives": {
        "Ukraine Putin": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Department Education": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Boasberg Judge": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Canada State": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Biden Former": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "King Files": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Government Federal": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Democrats Town": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Tesla Musk": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.10)."
        },
        "Administration Power": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "State Rubio": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.08)."
        },
        "Walz 2024": {
            "reason": "Articles do not share a similar dominant topic based on LDA topic modeling."
        },
        "Crisis Been": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.07)."
        },
        "Maher Food": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.02)."
        }
    }
}