{
    "How to decode a head-spinning few days of Ukraine war diplomacy": "Ukraine Putin",
    "Trump eyes control of Ukraine's nuclear plants as US prepares ceasefire talks with Russia": "Ukraine Putin",
    "Trump delivers on a generational conservative goal, but it could be risky for Republicans as well as students": "Department Education",
    "Trump revokes security clearances of former opponents Kamala Harris, Hillary Clinton": "Department Education",
    "Trump wants to speed release of FBI’s MLK spying files. But why?": "Department Education",
    "Trump suggests US could join British Commonwealth if offered by King Charles": "Department Education",
    "A fateful moment looms as Trump's team seeks to bypass the judiciary": "Department Education",
    "Fox News Politics Newsletter: A Primer on Abolishing the Dept of Education": "Department Education",
    "Fox News Politics Newsletter: DOJ Weighs Playing 'State Secrets' Card in Deportation Fight": "Department Education",
    "Canadians in crosshairs of trade war call Trump’s tariffs a ‘bad dream’": "Canada State",
    "Trump downplays Canada’s liberal lean from Oval Office, calls border an 'artificial line'": "Canada State",
    "DOGE USAID budget cuts hit UN in 'worst liquidity crisis since its establishment'": "Government Federal",
    "Trump administration unveils tax cut plan ahead of midterms": "Government Federal",
    "Trump’s new tax cut proposal sparks debate over economic impact": "Government Federal",
    "Trump’s moves to hollow out government could be difficult to undo": "Government Federal",
    "DOGE Madness: 'Sweet 16' bracket set up as craziest federal waste competes for championship": "Government Federal",
    "Americans think Trump’s cuts will hurt (and help) the country. Here’s how": "Government Federal",
    "Musk’s Tesla faces new lawsuit over self-driving claims": "Tesla Musk",
    "Tesla sued over misleading self-driving technology claims": "Tesla Musk",
    "Walz defends 2024 campaign strategy amid Democratic losses": "Walz 2024",
    "Democrats reflect on 2024 loss, Walz’s role under scrutiny": "Walz 2024",
    "U.S. imposes new tariffs on China, escalating trade tensions": "Trump Tariffs",
    "China vows retaliation as U.S. tariffs hit $200 billion in goods": "Trump Tariffs",
    "U.S. pushes for ceasefire in Gaza as Israel-Hamas talks falter": "Middle East",
    "Gaza ceasefire talks hit deadlock, U.S. steps in with new proposal": "Middle East",
    "Trump administration rolls back Biden-era climate regulations": "Climate Policy",
    "Environmental groups vow to fight Trump’s climate regulation rollbacks": "Climate Policy",
    "Supreme Court to hear challenge to Trump’s immigration policies": "Supreme Court",
    "Trump’s deportation policy faces Supreme Court scrutiny": "Supreme Court",
    "‘Principled and fair’: Judge Boasberg had nonpartisan record before facing Trump’s fury": "Boasberg Judge",
    "What is a constitutional crisis and are we in one right now?": "Boasberg Judge",
    "Fact check: Trump’s false claims on immigration, Biden, Ukraine in DOJ remarks": "Biden Former",
    "Fact check: Trump exaggerates trade deficits, his 2024 vote total, Ukraine aid, border crossings and fentanyl deaths": "Biden Former",
    "Deleted tweets show top State Department official spread false rumor about Rubio’s sexuality, called him ‘low IQ’": "State Rubio",
    "Bill Maher on ‘Real Time’: Food has become America’s new culture war": "Maher Food",
    "Bill Maher says food is the new culture war dividing America": "Maher Food",
    "'Chaos and confusion': How Democrats infiltrated 'thunderous' GOP town halls": "Political Opposition",
    "Bush DOJ lawyer warns Trump admin against 'terrible mistake' in judicial standoff": "Department Education"
  }