{
    "Musk Pentagon": [
        {
            "title": "Trump wants a ‘Golden Dome’ capable of defending the entire US: ‘Strategically, it doesn’t make any sense’",
            "url": "https://www.cnn.com/2025/03/22/politics/pentagon-golden-dome-scramble/index.html",
            "source": "cnn",
            "content": "US military officials are scrambling to develop a “Golden Dome” defense system that can protect the country from long-range missile strikes and have been told by the White House that no expense will be spared in order to fulfill one of President Donald Trump’s top Pentagon priorities, according to multiple sources familiar with the matter. “Golden Dome” is the Trump administration’s attempt to rebrand vague plans for developing a missile defense system akin to Israel’s Iron Dome. At a time the Pentagon is looking to cut budgets, the Trump administration has ordered military officials to ensure future funding for “Golden Dome” is reflected in new budget estimates for 2026 to 2030 – but the system itself remains undefined beyond a name, the sources said. “Right now, Golden Dome is, it’s really an idea,” one source familiar with internal discussions about the project said, adding there may be technology in the pipeline that, if ever scaled up, could apply to it, but as of now discussions "
        },
        {
            "title": "Left loses it over possibility of Musk top secret China briefing: 'No business'",
            "url": "https://www.foxnews.com/politics/left-loses-over-possibility-musk-top-secret-china-briefing-no-business",
            "source": "fox",
            "content": "Pentagon spokesperson Sean Parnell joins 'Fox & Friends' to discuss the Defense Department's reduction of wasteful spending, his response to a 'fake' report on Elon Musk's access to classified information and the removal of DEI ideology in the DOD. Sen. Kirsten Gillibrand, D-N.Y., said SpaceX and Tesla CEO Elon Musk has \"no business\" conducting affairs at the Pentagon, amid reports Musk would receive secret information from top military officials Friday about military contingency plans should a war break out with China. While The New York Times reported that Musk was set to receive military plans about any potential China conflict, the Pentagon and White House pushed back and said Musk’s briefing wouldn’t cover China. \"Elon Musk is an unelected, self-interested billionaire with no business anywhere near the Pentagon,\" Gillibrand said in an X post Friday morning with a photo of the Times story, just after Musk arrived at the Pentagon. Gillibrand is a member of the Senate Armed Services "
        }
    ],
    "Ukraine Putin": [
        {
            "title": "How to decode a head-spinning few days of Ukraine war diplomacy",
            "url": "https://www.cnn.com/2025/03/19/politics/ukraine-war-trump-putin-zelensky-russia-diplomacy/index.html",
            "source": "cnn",
            "content": "President Donald Trump’s calls with President Vladimir Putin and President Volodymyr Zelensky this week represent the most intense diplomacy aimed at ending the war in Ukraine since Russia’s invasion three years ago. Early signs are discouraging, since Putin refused to sign up for Trump’s proposal of a 30-day ceasefire. But Trump is framing the opening of any dialogue as a triumph. And each leader is trying to manipulate the diplomacy to their own ends and playing the public relations game – not least to escape blame if everything falls apart. The White House is spinning a fiction of significant progress both to keep alive the chances of a peace process developing and to support the increasingly tenuous conceit that Trump is a great dealmaker, uniquely able to forge peace. Related article\nIn Ukraine and Gaza, Trump finds out that ending wars is tougher than it looks Putin flatly refused Trump’s big ask on the ceasefire. Quite simply, he’s not ready to end the war yet, as can be seen fr"
        },
        {
            "title": "Trump eyes control of Ukraine's nuclear plants as US prepares ceasefire talks with Russia",
            "url": "https://www.foxnews.com/world/trump-eyes-control-ukraines-nuclear-plants-us-prepares-ceasefire-talks-russia",
            "source": "fox",
            "content": "Fox News contributor Dan Hoffman joined 'America's Newsroom' to discuss President Donald Trump's negotiations with Russian President Putin on the Ukraine war and why he believes the U.S. should tread lightly in peace talks. As top U.S. officials prepare for a meeting with a Russian delegation in Saudia Arabia Sunday, questions have mounted over how the Trump administration will push Moscow to extend a preliminary ceasefire. Russian President Vladimir Putin this week agreed to temporarily halt strikes on Ukraine’s energy infrastructure, which includes Europe’s largest nuclear power plant, the Zaporizhzhia Nuclear Power Station. Secretary of State Marco Rubio and National Security Advisor Mike Waltz, who will both travel to Jeddah for the negotiations, said the next step will be to secure a ceasefire over the Black Sea. MILITARY LEADERS TO MEET ON UK-FRANCE 'COALITION OF THE WILLING' PLAN FOR UKRAINE From left, U.S. National Security Advisor Mike Waltz, U.S. Secretary of State Marco Rubi"
        }
    ],
    "Department Education": [
        {
            "title": "Trump delivers on a generational conservative goal, but it could be risky for Republicans as well as students",
            "url": "https://www.cnn.com/2025/03/21/politics/education-department-trump-executive-order-universities/index.html",
            "source": "cnn",
            "content": "President Donald Trump is claiming generational wins for the Republican Party on the cultural and ideological battlefield of education – which MAGA supporters see as a hostile bastion of liberal power ripe for disruption. In a move he described as “45 years in the making,” Trump, seated among children at desks in a mock classroom set up in the White House, signed an executive order designed to obliterate the Department of Education. “It sounds strange, doesn’t it? Department of Education, we’re going to eliminate it,” Trump said, aware that he’s unlikely to get Congress to vote to abolish the agency – but that he can suffocate it from the inside anyway. Republicans see the department as a hotbed of liberal activism, a source of “woke” social policies on diversity and inclusion and an ally of teachers’ unions, which are a foundation of the Democratic Party. A sense among GOP voters that the department promotes values antithetical to conservative principles was exacerbated by school clos"
        },
        {
            "title": "Fox News Politics Newsletter: A Primer on Abolishing the Dept of Education",
            "url": "https://www.foxnews.com/politics/fox-news-politics-newsletter-primer-abolishing-dept-education",
            "source": "fox",
            "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Trump drops Biden-era legal challenge to Texas border security law -ICE arrests Indian Georgetown doctoral student accused of spreading Hamas propaganda -Taliban frees American hostage George Glezmann following negotiations with US, Qatar President Donald Trump could begin to dismantle the Department of Education via an executive order, but he would need congressional approval in order to officially abolish the agency. Trump is expected to sign the order to start dissolving the department in an effort to \"turn over education to families instead of bureaucracies,\" according to a White House fact sheet previously reported by Fox News Digital. If Trump signs such an order, expected as soon as Thursday, he can significantly diminish the department. However, the entire agency cannot be outright abolished unless Congress "
        }
    ],
    "Boasberg Judge": [
        {
            "title": "‘Principled and fair’: Judge Boasberg had nonpartisan record before facing Trump’s fury",
            "url": "https://www.cnn.com/2025/03/22/politics/who-is-judge-james-boasberg/index.html",
            "source": "cnn",
            "content": "James Boasberg wasn’t supposed to be famous. As the chief judge for the federal court in Washington, DC, Boasberg is well-liked in wonky legal circles and in the courthouse community. He’s a former law school roommate of Brett Kavanaugh and his personality has poked through his rulings with quirky uses of Star Trek quotes and Fugees lyrics. Even with 23 years as a judge in DC, Boasberg is very far from a household name. That all changed last week when Boasberg was randomly assigned a case that put him at a loggerheads with President Donald Trump and his administration’s efforts to use colonial-era laws and send undocumented immigrants to a notorious prison in El Salvador. His attempts to reign in Trump administration officials who appeared to violate his orders with controversial deportation flights to El Salvador earned him the unwanted position of being the target of Trump’s red-hot fury. In a series of social media posts, Trump smeared Boasberg as a “Radical Left Lunatic Judge” and "
        },
        {
            "title": "Fox News Politics Newsletter: DOJ Weighs Playing 'State Secrets' Card in Deportation Fight",
            "url": "https://www.foxnews.com/politics/fox-news-politics-newsletter-doj-weighs-playing-state-secrets-card-deportation-fight",
            "source": "fox",
            "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Illiterate high school grads sue school districts as Ivy League professor warns of 'deeper problem' -Court order halting deportation flights ‘unconstitutionally impedes’ on executive branch, Trump allies argue -Bernie Sanders, AOC take aim at Trump and Musk, as well as Democrats, at rallies The Justice Department said Friday it is considering invoking the state secrets privilege in its ongoing court battle over the Trump administration’s deportation flights to El Salvador, a tool that could allow them to withhold certain information for national security purposes. In a declaration filed Friday morning, U.S. Deputy Attorney General Todd Blanche told U.S. District Court Judge James Boasberg that he is aware of the Cabinet-level discussions invoking state secrets privilege. Invoking that privilege \"is a serious matter "
        }
    ],
    "Canada State": [
        {
            "title": "Canadians in crosshairs of trade war call Trump’s tariffs a ‘bad dream’",
            "url": "https://www.cnn.com/2025/03/06/politics/canada-trump-tariffs-impact/index.html",
            "source": "cnn",
            "content": "Karim Walji is certain he is about to lose business. Worried he may have to shrink his workforce — fire people — for the first time in eight years. He blames President Donald Trump and what Walji sees as a reckless power trip. “He wants the US to flex their muscle,” said Walji, a partner in AI Industries, a steel fabricating plant in western Canada. “He wants to show that the US is strong and, ‘Because I am bigger than you are, I can bully you around, and this is how I am going to do it.’” Last week, AI Industries was a shining example of one of the world’s most remarkable and lucrative trade relationships; US-Canada trade totals just shy of $800 billion annually. This week, it is one piece of a confusing trade confrontation that keeps shifting from war to detente. Trump on Tuesday slapped a new 25% tariff on almost all goods coming from Canada and Mexico. Then on Thursday, Trump suspended some tariffs for nearly one month, his latest about face. Walji prefers no tariffs, of course. Bu"
        },
        {
            "title": "Trump downplays Canada’s liberal lean from Oval Office, calls border an 'artificial line'",
            "url": "https://www.foxnews.com/politics/trump-downplays-canadas-liberal-lean-from-oval-office-calls-border-artificial-line",
            "source": "fox",
            "content": "President Donald Trump called the U.S.-Canada border an \"artificial line\" while also declining to say whether Canada would lean right or left if it were to become a state. President Donald Trump called the U.S.-Canada border an \"artificial line\" while also declining to say whether Canada would lean right or left if it were to become a state. Trump's Friday comments were made during a press conference in the Oval Office amid controversy over the president speaking of Canada as the \"51st state.\" Fox News' Peter Doocy asked the president whether he would be \"concerned\" about whether Canada \"would be a very, very blue state.\" CANADIAN POLITICIAN CLAIMS TRUMP ADMIN'S '51ST STATE' RHETORIC IS AN 'ACT OF WAR' Trump's Friday comments were made during a press conference in the Oval Office amid controversy over the president speaking of Canada as the \"51st state.\" (Andrew Harnik/Getty Images) \"It's just an artificial line that was drawn in the sand or in the ice,\" Trump said. \"You add that to th"
        }
    ],
    "Biden Former": [
        {
            "title": "Fact check: Trump’s false claims on immigration, Biden, Ukraine in DOJ remarks",
            "url": "https://www.cnn.com/2025/03/14/politics/fact-check-trump-immigration-biden-ukraine-doj/index.html",
            "source": "cnn",
            "content": "President Donald Trump made multiple false claims in a Friday speech at the Department of Justice in which he discussed the legal system and crime but also a wide range of other topics, including immigration, the war in Ukraine and former President Joe Biden. Trump also made numerous allegations for which he provided no evidence, alleging unspecified “egregious crimes” in the government during the Biden administration, corruption among unspecified judges, illegality by media outlets that he claimed cover him too negatively and “crooked” behavior by law firms connected to cases involving Trump. Here is a fact check of some of his assertions. Trump’s prosecutions and Biden: Trump repeated his regular unsubstantiated claim that former President Joe Biden used his office to wield the legal system against Trump. “Etched onto the walls of this building are the words English philosopher John Locke said: ‘Where law ends, tyranny begins.’ And I see that, and I saw it over the last four years wh"
        },
        {
            "title": "Trump revokes security clearances of former opponents Kamala Harris, Hillary Clinton",
            "url": "https://www.foxnews.com/politics/trump-revokes-security-clearances-former-opponents-kamala-harris-hillary-clinton",
            "source": "fox",
            "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com. President Donald Trump revoked the security clearances of Joe Biden, Hillary Clinton, Kamala Harris, Liz Cheney and several other opponents who either severely criticized or acted against him. The White House released a memo on Friday that read: \"I have determined that it is no longer in the national interest for the following individuals to access classified information:  Antony Blinken, Jacob Sullivan, Lisa Monaco, Mark Zaid, Norman Eisen, Letitia James, Alvin Bragg, Andrew Weissmann, Hillary Clinton, Elizabeth Cheney, Kamala Harris, Adam Kinzinger, Fiona Hill, Alexander Vindman, Joseph R. Biden Jr., and any other member of Joseph R. Biden Jr.’s family.\" Left to Right: Former Vice President Kamala Harris, President Donald Trump and former Secretary of State Hillary Clinton (Reuters/Getty Images) TRUMP STRIPS SECURITY CLEARANCES FROM LAW FIRM TIED TO JACK SMITH CASES Earlier this month, Director of Nation"
        }
    ],
    "King Files": [
        {
            "title": "Trump wants to speed release of FBI’s MLK spying files. But why?",
            "url": "https://www.cnn.com/2025/03/22/politics/mlk-fbi-files-trump-justice-department-what-matters/index.html",
            "source": "cnn",
            "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for free here. The US attorney in Washington, DC, arguing the public needs to know the “truth” about the assassination of Martin Luther King, Jr., filed a motion to speed up by two years the release of FBI files related to the civil rights icon. Appearing at the White House on Friday, Trump also referred to sealed files on King. “They’re going to release everything,” he said. The material, sealed since 1977, apparently includes tapes and transcripts of FBI surveillance of the civil rights icon before his death, including unflattering and prurient details about King’s relationships with women that could tarnish the legacy of a man whose image is chiseled in granite in a monument off the National Mall. President Donald Trump, a noted conspiracy theorist, has publicly championed transparency, notably for files related to the JFK assassination, even as his administration has embraced secrecy"
        },
        {
            "title": "Trump suggests US could join British Commonwealth if offered by King Charles",
            "url": "https://www.foxnews.com/politics/trump-suggests-us-could-join-british-commonwealth-offered-king-charles",
            "source": "fox",
            "content": "President Donald Trump accepts an invitation for a second state visit to the United Kingdom. President Trump said Friday he liked the idea of the United States joining the British Commonwealth after a report claimed King Charles III would make an offer. \"I love King Charles,\" Trump wrote on Truth Social Friday morning while linking to an article citing a Daily Mail report that said the monarch would secretly offer the U.S. associate membership in the Commonwealth during Trump's second state visit to Britain. \"Sounds good to me!\" Trump also reposted the same report about the king’s \"secret\" offer of membership late Saturday morning. Fox News Digital has reached out to the White House for comment. PRINCE WILLIAM VIEWS TRUMP RELATIONSHIP AS KEY TO MONARCHY 'S FUTURE: EXPERT President Trump on Friday said he liked the idea of the United States joining the British Commonwealth after a report claimed King Charles III would make an offer.  (Victoria Jones/WPA Pool/Getty Images) The British Co"
        }
    ],
    "Government Federal": [
        {
            "title": "Trump’s moves to hollow out government could be difficult to undo",
            "url": "https://www.cnn.com/2025/03/20/politics/trump-musk-federal-government-reagan/index.html",
            "source": "cnn",
            "content": "Americans have grown accustomed to dramatic shifts in policy each time control of the White House changes between parties. But across a wide range of domestic and foreign policy issues, President Donald Trump is now pursuing structural changes to the federal government that could prove very difficult for the next Democratic president to undo. On many fronts, Trump is seeking not just to reduce spending or to roll back regulation, but to hollow out the federal government’s institutional capacity to influence events both domestically and internationally. Far more aggressively than in his first term, Trump is unraveling many of the key mechanisms Washington for decades has used to advance its goals. Together with Elon Musk and his Department of Government Efficiency, the Trump administration has sought to rapidly deconstruct governmental power through, among other approaches, massive reductions in the federal workforce; the sale of federal buildings; the complete elimination of federal ag"
        },
        {
            "title": "DOGE Madness: ‘Sweet 16’ bracket set up as craziest federal waste competes for championship",
            "url": "https://www.foxnews.com/politics/doge-madness-sweet-16-bracket-set-up-craziest-federal-waste-competes-championship",
            "source": "fox",
            "content": "Sen. Joni Ernst, R-Iowa, joined 'Fox & Friends' to discuss Elon Musk's effort to expose wasteful government spending at the Defense and Education Departments as USAID expenditures receive heavy backlash. EXCLUSIVE: Department of Government Efficiency (DOGE) leaders in the Senate will be releasing an NCAA-style bracket of the craziest items of federal waste needing to be cut, as the public will be able to actively vote for their picks in successive Elite Eight and Final Four rounds. Sen. Joni Ernst, R-Iowa, the leader of the upper chamber’s DOGE caucus, told Fox News Digital on Friday that while college basketball’s March Madness only lasts a month, the federal government’s \"spending madness\" is a year-round, debt-defying event. \"The Senate DOGE Caucus is dividing and conquering to bring waste to a squealing halt,\" Ernst said. \"This March, we will be scoring buckets for taxpayers by increasing transparency, stopping the silly spending, and making government actually start to work for th"
        }
    ],
    "Democrats Town": [
        {
            "title": "Americans think Trump’s cuts will hurt (and help) the country. Here’s how",
            "url": "https://www.cnn.com/2025/03/15/politics/trump-government-cuts-musk-voters-what-matters/index.html",
            "source": "cnn",
            "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for free here. Senate Democrats’ decision to allow Republicans to pass a spending bill will avert a short-term shutdown, but it will also give Republicans the power to grant President Donald Trump new leverage to control spending for the rest of the year. The Democrats’ tactical retreat from this spending battle means the government will remain open and Trump can more easily carry on with the systemic changes and deep cuts he has done heretofore without the blessing of Congress. Entire divisions at agencies such as the Department of Education and NASA have already been laid off, along with the gutting of the government’s consumer protection arm, the Consumer Financial Protection Bureau. A large-scale “reduction in force” of federal workers is expected in the near future. Americans are both deeply concerned and somewhat excited about the prospect of Trump’s cuts, whose potential breadth i"
        },
        {
            "title": "'Chaos and confusion': How Democrats infiltrated 'thunderous' GOP town halls",
            "url": "https://www.foxnews.com/politics/chaos-confusion-how-democrats-infiltrated-thunderous-gop-town-halls",
            "source": "fox",
            "content": "Senator Bernie Sanders speaks to Fox News Digital about Trump, Musk and Democrats during his 'Fight Oligarchy Tour' in Tempe, Arizona. Large campaign rallies and town halls are pillars of election year politics, but two months into President Donald Trump's second term, town halls are erupting across the country. While Republicans have largely been told to stay home, Democrats seem to be driving the narrative for the first time since Trump returned to the White House. Democrats last week launched a coordinated effort to host \"People’s Town Halls\" in all 50 states after disruptive protests led Republican leadership to advise against hosting in-person town halls. The first week of town halls brought a new wave of political drama and engagement resembling that of an election year. \"When folks get out of the DC bubble and into communities across the country, there is one undeniably clear trend emerging: Americans are feeling betrayed by Republicans. Across party lines, people are furious th"
        }
    ],
    "Tesla Musk": [
        {
            "title": "Tesla vandals are terrorists, according to President Trump",
            "url": "https://www.cnn.com/2025/03/19/politics/tesla-attacks-trump-musk-domestic-terrorism-what-matters/index.html",
            "source": "cnn",
            "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for free here. President Donald Trump’s administration is trying to expand the definition of domestic terrorism as it aims to crack down on a wave of attacks in which Teslas have been shot and set on fire, apparently to protest CEO Elon Musk’s powerful but murky role in cutting the US government. Critics of Musk and Trump will see irony in use of the term “domestic terrorism” to describe people attacking electric vehicles after Trump issued mass pardons for more than 1,000 January 6 rioters who stormed the Capitol and tried to disrupt confirmation of the 2020 election results. Under President Joe Biden’s Attorney General Merrick Garland, the Department of Justice announced a new national strategy to combat domestic terrorism after January 6 as well as a wave of deadly mass shootings by White nationalists and right-wing extremists. The term will apparently take a new meaning under Trump a"
        },
        {
            "title": "Owner of vandalized Tesla saddened that 'regular people' have been dragged into anti-Musk attacks",
            "url": "https://www.foxnews.com/media/owner-vandalized-tesla-saddened-regular-people-have-been-dragged-anti-musk-attacks",
            "source": "fox",
            "content": "Tesla owner Shawn Freed joins ‘America’s Newsroom’ to discuss his car being vandalized and the rise in attacks on Tesla vehicles amid controversy surrounding Elon Musk. A Tesla owner whose car was defaced in upstate New York expressed frustration after being targeted amid backlash against Elon Musk and the Department of Government Efficiency (DOGE). \"Regular people like myself are getting caught up in this,\" Shawn Freed told \"America’s Newsroom\" Friday. \"It's sad to me that they are attacking Tesla, the company, because they disagree with the opinions of an individual,\" Freed continued. \"Tesla owners like myself have nothing to do with this.\" ELON MUSK IN ‘SHOCK’ OVER DEMS' ALLEGED ‘HATRED AND VIOLENCE,’ LAMENTS 'DERANGED' ATTACKS ON TESLA PLANTS Engineer Shawn Freed's Tesla was defaced with black Sharpie marker while parked in downtown Syracuse, New York. (Shawn Freed/Fox News) Freed, an engineer, explained that his wife and mother-in-law were attending a show in downtown Syracuse whe"
        }
    ],
    "Administration Power": [
        {
            "title": "A fateful moment looms as Trump’s team seeks to bypass the judiciary",
            "url": "https://www.cnn.com/2025/03/18/politics/trump-deportations-judge-executive-power/index.html",
            "source": "cnn",
            "content": "The most chilling aspect of a new White House claim of boundless executive power is not whether officials ignored a judge’s order to halt deportations of Venezuelan alleged gang members. It’s that some senior Trump administration aides seem not to care if they did. There are even claims that some judges are simply too junior to question the actions of a president. The furor caused by the administration’s peacetime use of wartime powers under the 18th-century Alien Enemies Act is the latest, and perhaps most overt, sign of President Donald Trump’s sense of omnipotence. He’s also betting voters will reward him for, in his view, keeping them safe with ruthless immigration enforcement rather than recoil from his challenges to the Constitution. The growing showdown is so critical because the courts are one of the final checks on Trump’s power after he crushed opposition in the Republican Party and helped shut the Democratic Party out of any power in any branch of government in Washington. T"
        },
        {
            "title": "Bush DOJ lawyer warns Trump admin against 'terrible mistake' in judicial standoff",
            "url": "https://www.foxnews.com/politics/bush-doj-lawyer-warns-trump-admin-against-terrible-mistake-judicial-standoff",
            "source": "fox",
            "content": "Fox News correspondent Alexandria Hoff has the latest on President Donald Trump’s legal challenge on his administration’s deportation flights on ‘FOX & Friends.’ A top former Bush administration lawyer is warning the White House not to begin ignoring court orders amid its standoff over President Donald Trump's deportation flights under the Alien Enemies Act. \"I worry that there might be some people in the administration who would actually like to defy a judicial order. Which I think would be a terrible mistake,\" John Yoo, Distinguished Professor of Law at the University of California at Berkeley, told Fox News Digital in an interview on Tuesday. More than a dozen injunctions have been levied to at least temporarily block Trump policies across the country, including his deportation flights, birthright citizenship reforms and Department of Government Efficiency (DOGE) efforts. Republican allies of the president have accused \"activist judges\" of seeking to override the executive in an imp"
        }
    ],
    "State Rubio": [
        {
            "title": "Deleted tweets show top State Department official spread false rumor about Rubio’s sexuality, called him ‘low IQ’",
            "url": "https://www.cnn.com/2025/03/10/politics/darren-beattie-marco-rubio-deleted-tweets-kfile/index.html",
            "source": "cnn",
            "content": "A top acting State Department official deleted at least half a dozen tweets that ridiculed his now boss, Secretary of State Marco Rubio, including ones calling him “low IQ” and repeating a false rumor about Rubio’s sexuality. The deleted tweets from Darren Beattie, the acting under secretary of state for public diplomacy, were uncovered as part of a CNN review of his social media and include a mixture of insults and harsh attacks against Rubio. Beattie, who was fired from his role as a speechwriter during the first Trump administration after CNN’s KFile revealed he attended a conference featuring White nationalists, made a series of attacks over the years against other Republicans, including a number of offensive, homophobic and racist comments. Though Beattie left up several of his most inflammatory posts, he does appear to have purged criticism of Rubio from his feed. Beattie deleted tweets suggesting a deep hostility toward Rubio — particularly after the then-senator voted to certif"
        },
        {
            "title": "Red state leader defends decision to include 2020 election 'discrepancies' in high school curriculum",
            "url": "https://www.foxnews.com/politics/red-state-leader-defends-decision-include-2020-election-discrepancies-high-school-curriculum",
            "source": "fox",
            "content": "Oklahoma Superintendent of Public Instruction Ryan Walters is predicting a 'dramatic turnaround' in the state’s educational outcomes after Trump shuts down the Department of Education which he says will get students ‘back to the basics.’ Facing criticism from the media and even from his state’s governor, the head of Oklahoma’s education system is defending a recently approved high school history curriculum that teaches about irregularities and \"discrepancies\" in the 2020 election. In an interview with Fox News Digital, Oklahoma Superintendent of Public Instruction Ryan Walters, a Republican, said that the state is \"in the middle of a dramatic turnaround\" in education, made possible by President Donald Trump’s dismantling of the federal Department of Education. According to Walters, the changes are being spurred on by Oklahoma parents and grandparents, who he says are demanding the state \"get back to the basics\" of education and eliminate any left-wing or legacy media-driven narratives "
        }
    ],
    "Walz 2024": [
        {
            "title": "Fact check: Trump exaggerates trade deficits, his 2024 vote total, Ukraine aid, border crossings and fentanyl deaths",
            "url": "https://www.cnn.com/2025/03/21/politics/fact-check-trump-oval-office-remarks/index.html",
            "source": "cnn",
            "content": "President Donald Trump made at least nine false claims in his Friday remarks to reporters in the Oval Office – including a series of wildly exaggerated statistics on a variety of topics. Trump used inaccurate figures for the number of votes he received in the 2024 presidential election, US aid to Ukraine, the number of migrants who entered the US during the Biden administration, the US trade deficits with China and Canada, and annual US fentanyl deaths. He also wrongly declared, again, that Honda announced it is building a new factory in Indiana. He repeated his years-old baseless claim that NATO would no longer have existed if not for his first presidency. He told his familiar unsubstantiated story about large numbers of migrants having come from jails in “the Congo” and elsewhere. And he once more discussed Canada’s dairy tariffs without mentioning a critical fact about them. Here is a fact check. While criticizing a federal judge who is presiding over a challenge to one of Trump’s i"
        },
        {
            "title": "Trump rips 'loser' Tim Walz for hurting Dems in 2024 election",
            "url": "https://www.foxnews.com/politics/trump-rips-loser-tim-walz-hurting-dems-2024-election",
            "source": "fox",
            "content": "During an MSNBC appearance on Wednesday night, Minnesota Gov. Tim Walz said that he and former Vice President Kamala Harris are to blame for the country’s current 'mess' under President Donald Trump. President Donald Trump said former Vice President Kamala Harris’ running mate, Minnesota Gov. Tim Walz, contributed to the Democrats' loss in the 2024 election. Trump’s comments came in response to statements Walz provided in a podcast with California Gov. Gavin Newsom that aired on Tuesday, in which Walz predicted he could kick the \"a--\" of most Trump supporters. \"Well, he's a loser. Yeah. No, I think so. He lost an election,\" Trump said Friday in the Oval Office of the White House. \"He played a part. You know, usually a vice president doesn't play a part. They say. I think Tim played a part. I think he was so bad that he hurt her. But she hurt herself. And Joe hurt them both. They didn't have a great group, but I would probably put him at the bottom of the group.\" A spokesperson for Walz"
        }
    ],
    "Crisis Been": [
        {
            "title": "What is a constitutional crisis and are we in one right now?",
            "url": "https://www.cnn.com/2025/03/17/politics/constitutional-crisis-courts-trump-executive-power-what-matters/index.html",
            "source": "cnn",
            "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for free here. The issue du jour is deportations, but the question has been a constant of Donald Trump’s presidencies: Is he acting within the Constitution? In his first term, it came up repeatedly: When he tried to quash an FBI investigation; when his administration ignored subpoenas; and when he tried to stay in office after losing an election. Now, while Trump has said he won’t defy the courts, he has also joined calls among his allies for US District Judge James Boasberg to be impeached. Chief Justice John Roberts rebuked such calls, without naming Trump, and said that the appeals process, not impeachment, is the avenue to disagree with courts. Read the latest CNN report. One branch of government is on a collision course with another and the third, Congress, controlled by Republicans, has so far been compliant with Trump. Be prepared for more people to the term “constitutional crisis"
        },
        {
            "title": "DOGE USAID budget cuts hit UN in 'worst liquidity crisis since its establishment'",
            "url": "https://www.foxnews.com/world/doge-usaid-budget-cuts-hit-un-worst-liquidity-crisis-since-its-establishment",
            "source": "fox",
            "content": "DOGE representative Sam Corcos and Treasury Secretary Scott Bessent break down the Trump administration's department to end wasteful spending, on 'The Ingraham Angle.' FIRST ON FOX: President Donald Trump's administration’s use of Elon Musk's DOGE to cut USAID spending is having a deep impact on the United Nations Department of Safety and Security (UNDSS), according to internal U.N. emails shared with Fox News Digital. In an email sent early Friday morning, president of the U.N. Field Staff Union, Milan Victor Dawoh wrote that the USAID funding cut resulted in \"approximately $30 million\" having been \"removed from the extra-budgetary (XB) resources, resulting in a significant reduction in staffing.\" Dawoh’s email warns that the U.N. \"is currently experiencing its worst liquidity crisis since its establishment. The situation is expected to deteriorate further before any improvement occurs.\" Dawoh said that UNDSS will lose 100 employees and that its presence will be eliminated in 35 to 45"
        }
    ],
    "First Term": [
        {
            "title": "Why Trump’s greatest first-term strength may be his biggest second-term weakness",
            "url": "https://www.cnn.com/2025/03/14/politics/trump-economic-poll-ratings-inflation/index.html",
            "source": "cnn",
            "content": "In President Donald Trump’s first White House term, public confidence in his handling of the economy was always among his greatest strengths. But in the early days of his second term, public views about his economic performance have quickly become his most conspicuous potential vulnerability. Even before Trump rattled the stock market this week by acknowledging his trade agenda could trigger a recession, several public polls had shown his job approval for managing the economy lagging below his overall job performance rating as president. That’s a dramatic reversal from Trump’s first term, when approval for his handling of the economy exceeded his overall approval rating every time the CNN/SRSS, Gallup or CNBC polls asked the public about both over his four years. In an early February poll this year, by contrast, Gallup found, for the first time, that fewer people gave Trump positive marks on the economy than on his overall performance — and that his economic grades were lower than at a"
        },
        {
            "title": "Trump crackdown on transgender athletes in girls' sports gets GOP backup in House bill",
            "url": "https://www.foxnews.com/politics/trump-crackdown-transgender-athletes-girls-sports-gets-gop-backup-house-bill",
            "source": "fox",
            "content": "Founder of XX-XY Athletics Jennifer Sey joined 'Fox & Friends First' to discuss a new Fox News poll on the transgender athlete debate, Maine universities' reversal on the issue and her reaction to being kicked off a DEI panel. FIRST ON FOX: A House GOP lawmaker is looking to make President Donald Trump's Title IX changes permanent. Rep. Mary Miller, R-Ill., is introducing legislation later this month to codify Trump's executive order aimed at keeping biological males out of female-only spaces, Miller told Fox News Digital. That would include locker rooms, bathrooms, school sports teams and any other extension of academia that receives funding under Title IX federal code, by threatening that funding if schools run afoul of the prospective law. HOW TRANSGENDERISM IN SPORTS SHIFTED THE 2024 ELECTION AND IGNITED A NATIONAL COUNTERCULTURE A new bill seeks to back up President Donald Trump's order on transgender students. (Getty Images/AP) \"The innocence, privacy, and safety of young girls s"
        }
    ],
    "Maher Food": [
        {
            "title": "Food banks scramble after USDA halts $500 million in deliveries",
            "url": "https://www.cnn.com/2025/03/22/politics/food-banks-usda-delivery-halt/index.html",
            "source": "cnn",
            "content": "In the coming weeks, the shelves at dozens of food pantries in California’s Fresno County will be a little emptier. Visitors won’t be able to take home as many groceries, and their bags will contain fewer nutritious items like chicken, eggs, milk and cheese. That’s largely because the US Department of Agriculture has halted $500 million in deliveries to food banks nationwide that the Biden administration announced last year, multiple food banks told CNN. The Central California Food Bank, which distributes food to 60 pantries in the county, recently learned that 13 truckloads of groceries – worth $850,000 – set to be delivered between April and July were canceled. It comes at a time when many residents are struggling to afford food since supermarket prices remain high, said Natalie Caples, the food bank’s co-CEO. “My food bank in Fresno can’t magically come up with $850,000 and 500,000 pounds of food to backfill that cancelation,” Caples said, noting that the nonprofit is already runnin"
        },
        {
            "title": "Bill Maher reveals he's going to meet Trump at the White House",
            "url": "https://www.foxnews.com/media/bill-maher-reveals-hes-going-meet-trump-white-house",
            "source": "fox",
            "content": "Fox News contributor Joe Concha reacts to Bill Maher's takedown of 'Pod Save America' host Jon Lovett's stance on transgender issues. Liberal comedian Bill Maher will soon be meeting President Donald Trump at the White House, Fox News Digital has learned. Maher revealed to fellow comedian Andrew Schulz that Maher agreed to Kid Rock's offer to introduce him to his political foe, in an exchange that will air on Sunday's installment of Maher's \"Club Random\" podcast. \"Kid Rock was here a couple of weeks ago, and he said, ‘I want you to meet Trump.’ He said, 'I'm gonna take you to the White House.' So now we're gonna do that,\" Maher told Schulz. BILL MAHER SAYS TRUMP ADMIN DOESN'T HAVE A LEG TO STAND ON REGARDING FREE SPEECH AFTER MAHMOUD KHALIL ARREST Liberal comedian Bill Maher revealed he will be meeting President Donald Trump at the White House. (Screenshot/HBO, Getty Images) Kid Rock was a guest on Maher's HBO show \"Real Time\" last month and is a strong supporter of Trump. Maher has lo"
        }
    ]
}