{
    "validNarratives": {
        "Ukraine Putin": {
            "articles": [
                {
                    "title": "How to decode a head-spinning few days of Ukraine war diplomacy",
                    "url": "https://www.cnn.com/2025/03/19/politics/ukraine-war-trump-putin-zelensky-russia-diplomacy/index.html",
                    "source": "cnn",
                    "content": "President Donald Trump's calls with President Vladimir Putin and President Volodymyr Zelensky this week represent the most intense diplomacy aimed at ending the war in Ukraine since Russia's invasion three years ago. Early signs are discouraging, since Putin refused to sign up for Trump's proposal of a 30-day ceasefire. But Trump is framing the opening of any dialogue as a triumph. And each leader is trying to manipulate the diplomacy to their own ends and playing the public relations game - not least to escape blame if everything falls apart. The White House is spinning a fiction of significant progress both to keep alive the chances of a peace process developing and to support the increasingly tenuous conceit that Trump is a great dealmaker, uniquely able to forge peace. Related article In Ukraine and Gaza, Trump finds out that ending wars is tougher than it looks Putin flatly refused Trump's big ask on the ceasefire. Quite simply, he's not ready to end the war yet, as can be seen fr"
                },
                {
                    "title": "Trump eyes control of Ukraine's nuclear plants as US prepares ceasefire talks with Russia",
                    "url": "https://www.foxnews.com/world/trump-eyes-control-ukraines-nuclear-plants-us-prepares-ceasefire-talks-russia",
                    "source": "fox",
                    "content": "Fox News contributor Dan Hoffman joined 'America's Newsroom' to discuss President Donald Trump's negotiations with Russian President Putin on the Ukraine war and why he believes the U.S. should tread lightly in peace talks. As top U.S. officials prepare for a meeting with a Russian delegation in Saudia Arabia Sunday, questions have mounted over how the Trump administration will push Moscow to extend a preliminary ceasefire. Russian President Vladimir Putin this week agreed to temporarily halt strikes on Ukraine's energy infrastructure, which includes Europe's largest nuclear power plant, the Zaporizhzhia Nuclear Power Station. Secretary of State Marco Rubio and National Security Advisor Mike Waltz, who will both travel to Jeddah for the negotiations, said the next step will be to secure a ceasefire over the Black Sea. MILITARY LEADERS TO MEET ON UK-FRANCE 'COALITION OF THE WILLING' PLAN FOR UKRAINE From left, U.S. National Security Advisor Mike Waltz, U.S. Secretary of State Marco Rubi"
                }
            ],
            "summary": "President Donald Trump engaged in intense diplomacy with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky to end the ongoing war in Ukraine. Trump proposed a 30-day ceasefire, which Putin refused, indicating his unwillingness to end the war at this time. Trump framed the opening of dialogue as a triumph, while each leader manipulated the diplomacy for their own ends and engaged in public relations efforts. The White House portrayed the talks as significant progress to keep peace process hopes alive and bolster Trump's image as a dealmaker. Meanwhile, as U.S. officials prepared for ceasefire negotiations with Russia in Saudi Arabia, Putin agreed to temporarily halt strikes on Ukraine's energy infrastructure, including the Zaporizhzhia Nuclear Power Station. The next step in the talks is to secure a ceasefire over the Black Sea."
        },
        "Department Education": {
            "articles": [
                {
                    "title": "Trump delivers on a generational conservative goal, but it could be risky for Republicans as well as students",
                    "url": "https://www.cnn.com/2025/03/21/politics/education-department-trump-executive-order-universities/index.html",
                    "source": "cnn",
                    "content": "President Donald Trump is claiming generational wins for the Republican Party on the cultural and ideological battlefield of education – which MAGA supporters see as a hostile bastion of liberal power ripe for disruption. In a move he described as “45 years in the making,” Trump, seated among children at desks in a mock classroom set up in the White House, signed an executive order designed to obliterate the Department of Education. “It sounds strange, doesn’t it? Department of Education, we’re going to eliminate it,” Trump said, aware that he’s unlikely to get Congress to vote to abolish the agency – but that he can suffocate it from the inside anyway. Republicans see the department as a hotbed of liberal activism, a source of “woke” social policies on diversity and inclusion and an ally of teachers’ unions, which are a foundation of the Democratic Party. A sense among GOP voters that the department promotes values antithetical to conservative principles was exacerbated by school clos"
                },
                {
                    "title": "Fox News Politics Newsletter: A Primer on Abolishing the Dept of Education",
                    "url": "https://www.foxnews.com/politics/fox-news-politics-newsletter-primer-abolishing-dept-education",
                    "source": "fox",
                    "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Trump drops Biden-era legal challenge to Texas border security law -ICE arrests Indian Georgetown doctoral student accused of spreading Hamas propaganda -Taliban frees American hostage George Glezmann following negotiations with US, Qatar President Donald Trump could begin to dismantle the Department of Education via an executive order, but he would need congressional approval in order to officially abolish the agency. Trump is expected to sign the order to start dissolving the department in an effort to \"turn over education to families instead of bureaucracies,\" according to a White House fact sheet previously reported by Fox News Digital. If Trump signs such an order, expected as soon as Thursday, he can significantly diminish the department. However, the entire agency cannot be outright abolished unless Congress"
                }
            ],
            "summary": "President Donald Trump has taken steps to dismantle the Department of Education through an executive order. Trump aims to eliminate the department, viewing it as a source of liberal activism and 'woke' social policies. Republicans see the department as promoting values contrary to conservative principles. However, the complete abolition of the agency would require congressional approval. Trump's move is seen as an attempt to transfer control of education from bureaucracies to families."
        },
        "Boasberg Judge": {
            "articles": [
                {
                    "title": "‘Principled and fair’: Judge Boasberg had nonpartisan record before facing Trump’s fury",
                    "url": "https://www.cnn.com/2025/03/22/politics/who-is-judge-james-boasberg/index.html",
                    "source": "cnn",
                    "content": "James Boasberg wasn’t supposed to be famous. As the chief judge for the federal court in Washington, DC, Boasberg is well-liked in wonky legal circles and in the courthouse community. He’s a former law school roommate of Brett Kavanaugh and his personality has poked through his rulings with quirky uses of Star Trek quotes and Fugees lyrics. Even with 23 years as a judge in DC, Boasberg is very far from a household name. That all changed last week when Boasberg was randomly assigned a case that put him at a loggerheads with President Donald Trump and his administration’s efforts to use colonial-era laws and send undocumented immigrants to a notorious prison in El Salvador. His attempts to reign in Trump administration officials who appeared to violate his orders with controversial deportation flights to El Salvador earned him the unwanted position of being the target of Trump’s red-hot fury. In a series of social media posts, Trump smeared Boasberg as a “Radical Left Lunatic Judge” and"
                },
                {
                    "title": "Fox News Politics Newsletter: DOJ Weighs Playing 'State Secrets' Card in Deportation Fight",
                    "url": "https://www.foxnews.com/politics/fox-news-politics-newsletter-doj-weighs-playing-state-secrets-card-deportation-fight",
                    "source": "fox",
                    "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Illiterate high school grads sue school districts as Ivy League professor warns of 'deeper problem' -Court order halting deportation flights ‘unconstitutionally impedes’ on executive branch, Trump allies argue -Bernie Sanders, AOC take aim at Trump and Musk, as well as Democrats, at rallies The Justice Department said Friday it is considering invoking the state secrets privilege in its ongoing court battle over the Trump administration’s deportation flights to El Salvador, a tool that could allow them to withhold certain information for national security purposes. In a declaration filed Friday morning, U.S. Deputy Attorney General Todd Blanche told U.S. District Court Judge James Boasberg that he is aware of the Cabinet-level discussions invoking state secrets privilege. Invoking that privilege \"is a serious matter"
                }
            ],
            "summary": "Judge James Boasberg, a well-respected federal judge in Washington, DC, found himself in the spotlight after being randomly assigned a case involving the Trump administration's deportation flights to El Salvador. Boasberg's attempts to enforce his orders and halt these controversial flights drew the ire of President Trump, who publicly criticized the judge as a 'Radical Left Lunatic Judge'. Meanwhile, the Justice Department is considering invoking the state secrets privilege in this ongoing court battle, which could allow them to withhold certain information for national security purposes. The case has thrust Boasberg, known for his nonpartisan record and quirky personality, into a high-profile legal dispute between the judiciary and the executive branch."
        },
        "Biden Former": {
            "articles": [
                {
                    "title": "Fact check: Trump’s false claims on immigration, Biden, Ukraine in DOJ remarks",
                    "url": "https://www.cnn.com/2025/03/14/politics/fact-check-trump-immigration-biden-ukraine-doj/index.html",
                    "source": "cnn",
                    "content": "President Donald Trump made multiple false claims in a Friday speech at the Department of Justice in which he discussed the legal system and crime but also a wide range of other topics, including immigration, the war in Ukraine and former President Joe Biden. Trump also made numerous allegations for which he provided no evidence, alleging unspecified “egregious crimes” in the government during the Biden administration, corruption among unspecified judges, illegality by media outlets that he claimed cover him too negatively and “crooked” behavior by law firms connected to cases involving Trump. Here is a fact check of some of his assertions. Trump’s prosecutions and Biden: Trump repeated his regular unsubstantiated claim that former President Joe Biden used his office to wield the legal system against Trump. “Etched onto the walls of this building are the words English philosopher John Locke said: ‘Where law ends, tyranny begins.’ And I see that, and I saw it over the last four years wh"
                },
                {
                    "title": "Trump revokes security clearances of former opponents Kamala Harris, Hillary Clinton",
                    "url": "https://www.foxnews.com/politics/trump-revokes-security-clearances-former-opponents-kamala-harris-hillary-clinton",
                    "source": "fox",
                    "content": "President Donald Trump revoked the security clearances of Joe Biden, Hillary Clinton, Kamala Harris, Liz Cheney and several other opponents who either severely criticized or acted against him. The White House released a memo on Friday that read: \"I have determined that it is no longer in the national interest for the following individuals to access classified information: Antony Blinken, Jacob Sullivan, Lisa Monaco, Mark Zaid, Norman Eisen, Letitia James, Alvin Bragg, Andrew Weissmann, Hillary Clinton, Elizabeth Cheney, Kamala Harris, Adam Kinzinger, Fiona Hill, Alexander Vindman, Joseph R. Biden Jr., and any other member of Joseph R. Biden Jr.’s family.\" Left to Right: Former Vice President Kamala Harris, President Donald Trump and former Secretary of State Hillary Clinton (Reuters/Getty Images) TRUMP STRIPS SECURITY CLEARANCES FROM LAW FIRM TIED TO JACK SMITH CASES Earlier this month, Director of Nation"
                }
            ],
            "summary": "The articles discuss actions taken by President Donald Trump against his political opponents, including former President Joe Biden, Hillary Clinton, and Kamala Harris. Trump made false claims about Biden using his office to target Trump legally, while also revoking security clearances of several individuals who criticized or acted against him. The articles present different perspectives on these actions, with one focusing on fact-checking Trump's claims and the other reporting on the security clearance revocations."
        },
        "Administration Power": {
            "articles": [
                {
                    "title": "A fateful moment looms as Trump’s team seeks to bypass the judiciary",
                    "url": "https://www.cnn.com/2025/03/18/politics/trump-deportations-judge-executive-power/index.html",
                    "source": "cnn",
                    "content": "The most chilling aspect of a new White House claim of boundless executive power is not whether officials ignored a judge's order to halt deportations of Venezuelan alleged gang members. It's that some senior Trump administration aides seem not to care if they did. There are even claims that some judges are simply too junior to question the actions of a president. The furor caused by the administration's peacetime use of wartime powers under the 18th-century Alien Enemies Act is the latest, and perhaps most overt, sign of President Donald Trump's sense of omnipotence. He's also betting voters will reward him for, in his view, keeping them safe with ruthless immigration enforcement rather than recoil from his challenges to the Constitution. The growing showdown is so critical because the courts are one of the final checks on Trump's power after he crushed opposition in the Republican Party and helped shut the Democratic Party out of any power in any branch of government in Washington. T"
                },
                {
                    "title": "Bush DOJ lawyer warns Trump admin against 'terrible mistake' in judicial standoff",
                    "url": "https://www.foxnews.com/politics/bush-doj-lawyer-warns-trump-admin-against-terrible-mistake-judicial-standoff",
                    "source": "fox",
                    "content": "Fox News correspondent Alexandria Hoff has the latest on President Donald Trump's legal challenge on his administration's deportation flights on 'FOX & Friends.' A top former Bush administration lawyer is warning the White House not to begin ignoring court orders amid its standoff over President Donald Trump's deportation flights under the Alien Enemies Act. \"I worry that there might be some people in the administration who would actually like to defy a judicial order. Which I think would be a terrible mistake,\" John Yoo, Distinguished Professor of Law at the University of California at Berkeley, told Fox News Digital in an interview on Tuesday. More than a dozen injunctions have been levied to at least temporarily block Trump policies across the country, including his deportation flights, birthright citizenship reforms and Department of Government Efficiency (DOGE) efforts. Republican allies of the president have accused \"activist judges\" of seeking to override the executive in an imp"
                }
            ],
            "summary": "The Trump administration is facing a critical moment as it seeks to bypass the judiciary in its use of executive power, particularly in the context of deportation policies under the Alien Enemies Act. Some senior administration aides appear to disregard court orders, claiming that certain judges lack the authority to question presidential actions. This has led to a growing showdown between the administration and the courts, with the latter serving as one of the final checks on Trump's power. A former Bush administration lawyer has warned against ignoring judicial orders, calling it a 'terrible mistake.' The administration's actions have been met with injunctions across the country, blocking various policies including deportation flights, birthright citizenship reforms, and Department of Government Efficiency efforts. Republican allies of the president have accused 'activist judges' of attempting to override executive authority."
        }
    },
    "excludedNarratives": {
        "Musk Pentagon": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.11)."
        },
        "Canada State": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.11)."
        },
        "King Files": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.14)."
        },
        "Government Federal": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.13)."
        },
        "Democrats Town": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.11)."
        },
        "Tesla Musk": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.10)."
        },
        "State Rubio": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.08)."
        },
        "Walz 2024": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.11)."
        },
        "Crisis Been": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.07)."
        },
        "Maher Food": {
            "reason": "Articles do not share the same general subject (TF-IDF similarity: 0.02)."
        }
    }
}